[
  {
    "page": 1,
    "content": "THE FOUNDER'S\nGUIDE TO UK\nCRYPTO LAW\nEDITED BY LISA MCCLORY AND CESSIAH LOPEZ\nD₂LT\nLexisNexis®"
  },
  {
    "page": 2,
    "content": "CONTENT\nCHAPTER 02\nToken Typologies\n45\nAcknowledgements\n6\n2.1 Web3 Games (Omri Bouton - Outlier Ventures)\n46\nEditor's Note\n7\nIntroduction\n9\n2.2 SocialFi: Boosting Organic User Growth with\nSocialFi (lan Cox - CEO and Founder, Avark Agency /\nManchester Blockchain Alliance)\n50\nThe UK as a Base for Distributed Ledger Technology,\nTokenisation and Fintech (Aleksandra Wawrzyszczuk -\nLawtechUK and New York University)\n6\n2.3 DePIN (Morgan Lewis - Brabners LLP)\n51\nQuick Takeaways from this Guide\n12\n2.4 Practical Guide for DeFi Developers\n(Maria Riivari - Avara)\n53\nCHAPTER\n01\nCHAPTER\n03\nProduct, Design and Planning\n15\n1.1 Tokenomics: Designing a Product that powers\n16\nSetting up for Success and Risk Mitigation (Leon\nHurd - Cybersandbox and Keystone Law Limited)\n57\nEcosystems and empowers Holders\n(Mohamed Ezeldin - Animoca Brands)\n3.1 Overview of Anti-Money Laundering (AML),\nSanctions and Compliance Law\n58\n1.2 Tokenisation (Charles Kerrigan - CMS; RAK DAO)\n19\n3.2 AML registration with the UK Financial Conduct\nAuthority (FCA)\n58\n1.3 What is a Token Warrant?\n21\n(Anne Rose and Callum Blundell - Mishcon de Reya)\n3.3 Authorisation under FSMA\n59\n1.4 Product, Data and Compliance-by-Design\n23\n(Derya Karli - Own Protocol and Lisa McClory - D2\nLegal Technology)\n3.4 Electronic Money Regulations / Payment Service\nRegulations\n60\n3.5 Sanctions\n60\n1.5 Computable Contracts (Akber Datoo - D2 Legal\nTechnology and Co-Chair, Law Society of England\nand Wales Technology and Law Committee)\n33\n1.6 Navigating Legal Architectures: Building your Web3\nProject on Solana in the UK\n(Marcus Bagnall - Wiggin)\n34\n1.7 Decentralised Autonomous Organisations\n39\n(Professor Sarah Green - D2 Legal Technology)\nCHAPTER\n04\nUK Regulation of the Financial Promotion of\nCryptoassets (Andrew Maguire, Littleton\nChambers)\n63\n1.8 Exploring Offshore Jurisdictions: Things to think\nabout (Sara Hall - Walkers)\n42\n1.9 DAO Legal and Tax Standards (Joni Pirovich -\nRegulatory Interoperability Lead, DAOstar (a project of\n43\nThe Metagovernance Project Inc)\nCHAPTER\n05\nTax and Accounting\n67\n5.1 The 5 W's (Mark Pearce - Alkimi)\n68\n5.2 Overview of Tax and Accounting for Crypto\nProjects (Dion Seymour - Andersen UK)\n71\nCHAPTER\n06\nTracing, Freezing and Recovery - When Crypto\nAssets are Stolen (Matt Green - Lawrence\nStephens and Marcin Zarakowski - Token\nRecovery)\n77\n6.1 Cryptoasset Tracing\n78\n6.2 Legal Procedures\n79\nCHAPTER\n07\nYou're Off - Token Launch (James Burnie and\n81\nPavan Kaur - WAGMI Advisers, Gunnercooke)\n7.1 Legal: Boring until it isn't!\n82\n7.2 Beyond the Legal: a CMO's Perspective\n83\n7.3 Let's face the Music and Dance\n86\nCHAPTER\n08\nThe Importance of Community and Web3\nAccelerators (Cap - Superteam UK)\n87\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 3,
    "content": "ACKNOWLEDGEMENTS\n\nEditors\nCessiah Lopez, Superteam UK\nLisa McClory, D2 Legal Technology\n\nMany thanks to Superteam UK and to all the expert contributors to this essential\nguide (in alphabetical order):\n\nContributors\n\nDISCLAIMERS\nThe content contained in this publication is not legal, financial or tax advice, nor any recommendation to\nuse any product or service. The mention of specific organisations, technologies or products does not imply\nthat they are endorsed or recommended in preference to others of a similar nature that are not mentioned.\nYou are responsible for seeking your own independent and professional advice based on your\ncircumstances. The publishers, editors, authors, contributors and reviewers of this publication, and their\naffiliated entities and employers, do not accept responsibility or liability for any claims that may arise from\nyour use or reliance on this publication, and none are responsible for outdated or incomplete content. You\nare responsible for checking the currency and accuracy of content in this publication. All rights reserved.\n\nWhilst this guide refers to the UK, different laws may apply to activities in England and Wales, Scotland and\nNorthern Ireland and you should seek advice from suitably qualified professionals in the relevant\njurisdiction.\n\n5 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n\nAkber Datoo, D2 Legal Technology and Co-Chair Law Society Technology and Law Committee\nAleksandra Wawrzyszczuk, LawtechUK and New York University School of Law\nAndrew Maguire, Littleton Chambers\nAnne Rose, Mishcon de Reya LLP\nCallum Blundell, Mishcon de Reya LLP\nCap, Superteam UK\nCharles Kerrigan, CMS; RAK DAO\nDerya Karli, Own Protocol\nDion Seymour, Andersen LLP\nlan Cox, Avark Agency / Manchester Blockchain Alliance\nJames Burnie, WAGMI Advisers, Gunnercooke LLP\nJoni Pirovich, DAOstar (a project of the The Metagovernance Project Inc)\nLeon Hurd, CyberSandbox and Keystone Law Ltd\nMarcin Zarakowski, Token Recovery\nMaria Riivari, Avara\nMarcus Bagnall, Wiggin LLP\nMark Pearce, Alkimi\nMatt Green, Lawrence Stephens Ltd\nMohamed Ezeldin, Animoca Brands\nMorgan Lewis, Brabners LLP\nOmri Bouton, Outlier Ventures\nPavan Kaur, WAGMI Advisers, Gunnercooke LLP\nSara Hall, Walkers\nProfessor Sarah Green, D2 Legal Technology\n\nThanks also to reviewers Daniel Maw, Christopher Brown and Sylvia Papadopoulou of D2 Legal Technology\nWith special thanks to our Media Partners LexisNexis UK.\n\nPR and Marketing Support:\nJo Timmins\nDesign by: designticket.co\nCover design by: @1984drum\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n6\n"
  },
  {
    "page": 4,
    "content": "EDITOR'S\nNOTE\nLisa McClory\n9 December 2024\n\nThe idea for this Founders Guide to UK Crypto Law came about during a conversation with Cap @ Superteam at the inaugural BlockStart Scotland event, shortly after a very engaging and question— filled legal discussion panel, which really brought to light the urgent need for some solid and practical guidance for projects looking to start out in the Web3 space.\n\nMuch great guidance abounds, but much of it is also highly technical, and not necessarily easy for non-lawyers to read!\n\nSo, this guide brings together many of the top experts in the area to deliver on that objective — with the hope of cutting through some of the mystery and complexity surrounding Web3 law and reducing a few of the ‘ifs, buts and it-depends’ that might categorise a project’s experience with trying to source good advice in this fast-moving area.\n\nEvery person who has contributed to this guide has been specifically chosen for their depth of experience and expertise in their field, and as a result we have sourced a great smorgasbord of topics to do with law, tax and compliance, with practical tips that people won’t read anywhere else. We hope you will enjoy reading it.\n\nThis is of course a very exciting time to be actively working and innovating in the Web3 industry. The advent of Al has begun to combine with Web3 applications in myriad ways, including onchain analytics applications, algorithmic trading and more.1 Sometimes Al helps blockchain by sifting and sorting data, creating more opportunities for information networks to engage with the offchain world. Sometimes it’s the other way around, and blockchain helps within the Al development lifecycle, or assists with the creation of digital trust and fidelity in an increasingly crowded and confusing online environment — who can anymore say for certainty that they would know a deepfake apart from the real thing?\n\nIncreasingly, there will be joined-up applications of AlxCrypto technology, with the addition of robotics, smart sensors, AR and VR and more. We are always on the edge of rapid change and innovative potential. Sometimes it feels as if we are already living in Star Trek.\n\nThe opportunity for the UK is to be right at the centre of this new industry and catalyse, incubate and grow innovation, maximising the UK’s knowledge economy and skilled digital workforce to create ground-breaking new businesses in emerging areas of the digital economy. The flexibility of the common law and the UK’s long-established reputation as a centre of dispute resolution provides strong reasons for projects to encode English law into their smart legal contracts. Of course, the benefits of this innovation and access to opportunities should not just be focused on main centres of traditional financial services-led growth, but should spread out right across the country — we need to make space for fresh ideas, pioneering opportunities and creative-thinking.\n\nWe are therefore proud to have collaborated not just with Solana Superteam UK but also with the Manchester Blockchain Alliance on this initiative, and our initial front cover celebrates this colourful link with the Manchester spirit of creative industry: the values of collaboration, friendship, collective enterprise and creative-spirit resonate greatly with the grassroots-led approach needed to deliver on the true diverse and free-thinking potential of the digital economy.\n\nAt the time of launching this guide, we are following progress with the UK’s proposed new approach to crypto regulation, with a crypto roadmap announced by the UK’s Financial Conduct Authority (FCA)2 in November 2024, following Tulip Siddiq MP’s Mansion House speech3 announcing a strategy to focus on fintech as one of five priority growth opportunities for the UK.\n\nGlobally, crypto regulatory frameworks are growing, and many regulators are moving to introduce regulatory frameworks that provide much-needed clarity and consistency in regulation of cryptoasset service providers and trading platforms.\n\nRegulation is welcome and essential to ensure the steady and safe growth of the cryptoasset industry. Proportionality is the most important challenge for regulators, and in particular ensuring access to good quality advice and support for start-ups aiming to get a foothold in these new areas. Delivering quickly on clear and user-friendly regulatory frameworks is an imperative for all regulators seeking leadership in the digital economy.\n\nAccelerators such as Superteam UK are a totally essential part of this solution, too, bridging the gap between professional advisors and projects and providing networks and co-working spaces that are such an important resource for growing projects.\n\nSo, this guide is intended as a starting point for builders and entrepreneurs in the UK, acknowledging the important role that law and regulation play. I hope it will help at least a few projects a little further along the way in overcoming uncertainty, and a few others to avoid some pitfalls, and generally equip all readers with the essential knowledge to empower and catalyse their ideas and full potential. We hope this guide will be a living document and that there will be much more to come.\n\nAnd riffing a little off our excellent chapter on Token Launch below: “Things are only impossible, until they’re not!” (Captain Jean-Luc Picard of the Starship Enterprise)\n\nLisa McClory\n\n1 Al x Crypto (Version 9.1), Outlier Ventures (Feb. 2024)\n2 Cryptoasset Roadmap, Financial Conduct Authority (03 February 2024)\n3 Mansion House 2024 Speech, UK Government (14 Nov. 2024)\n\n7 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\n8\n"
  },
  {
    "page": 5,
    "content": "INTRODUCTION\nThe UK as a Base for distributed ledger Technology,\nTokenisation and Fintech\n(Aleksandra Wawrzyszczuk - LawtechUK and New York University)\nIn 2024, there is a notable momentum building in the race\nfor legal dominance over digitised markets, including\nfinancial services operating digital assets.\nWhen it comes to internationally mobile transactions, digital\nassets are certainly leading the pack. For a borderless\ntechnology, with an eye-watering market size (revenue in the\nUS alone in 2023 is projected US$60,150.0m),4 it is\nunsurprising that the race for jurisdictional supremacy only\naccelerated with the widening adoption of the technology.\nFor example, in digital capital markets, continental European\njurisdictions eagerly stepped in with legislation governing\ndigital securities, or transactions of issuance of debt or\nequity on blockchain (and DLT) to establish a 'desirable' legal\nframework. In addition to EU-wide efforts, culminating in\nlarger frameworks such as Regulation (EU) 2023/1114 on\nMarkets in Crypto-Assets (\"MICA\"), some individual member\nstates took more targeted action at varying levels of\ngranularity. The willingness to 'get ahead' led France to\nlegislate on the matter of digital securities so early in the day\n(2019) that it has already needed to update its PACTE Act for\n2023.\nLegislation is not the only way forward, however, English law\nmay already provide the necessary tools to address most of\nthe challenges arising in industries utilising digital assets. It\nsuccessfully accommodates new technology and business\ninnovations by incrementally developing doctrines grounded\nin established general rules. Thanks to the breadth and\ndepth of its doctrinal backing, English law is highly portable;\nit has already been adopted as governing law in cross-\nborder and global transactions in many contexts, ranging\nfrom maritime law to capital markets.\n4 Digital Assets - Worldwide, Statista Market Forecast, (July 2024)\n5 UK Jurisdiction Taskforce (UKJT) Home, LawtechUK (Nov. 2023)\nIn order to promote the message that English law serves\ndigital business, the UK's Ministry of Justice established the\nUK Jurisdiction Taskforce (UKJT) to focus specifically on\npromoting English law and the UK jurisdictions for the digital\neconomy. Chaired by Master of the Rolls, Head of Civil\nJustice in England and Wales, and a vocal advocate for\ncommon law, Sir Geoffrey Vos, the Taskforce coalesces a\nmultinational community to provide clarity on legal\ncontroversies under English law.\nThe UK Jurisdiction Taskforce describes itself as 'an\nindustry-led initiative, tasked with promoting the use of\nEnglish law and UK's jurisdictions for technology and digital\ninnovation'.5 It houses representatives from the Financial\nConduct Authority, City of London Corporation and,\nimportantly, the Law Commission, as well as senior\npractitioners and judges. Its objective, broadly speaking, is\nto clarify the legal position of digital assets under English law\nand promote the UK's jurisdictions for digital economy. The\nTaskforce already publishes so-called 'authoritative legal\nstatements' that seem to perform the functions that the Law\nCommission wishes to delegate to the prospective panel.\nThe purpose of those statements is also to provide market\nassurance of English law's clarity, clarifying key technical\nissues arising in the industry, and how the English law\nshould respond to them. Unlike the Law Commission,\nhowever, it does not make recommendations for future law\nreform: instead, it simply analyses the existing laws and\nexplains them to the market.\n6 High Court endorses UKJT Legal Statement and proprietary status of cryptoassets, Linklaters (May 17, 2001),\n9 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nWhat underpins the Taskforce's mission is the assumption\nthat legal clarity and certainty is good for business, and\nEnglish law (or common law in general) is perfectly capable\nof providing not only flexibility but also security of outcomes.\nIt is hard to disagree with the assets and research that the\nTaskforce has produced to further its agenda. The legal\nstatements are a result of extensive public and private\nconsultations, drafted collectively by a team consisting of\nsenior experts in a given area, in close dialogue with the Law\nCommission, with whose projects the Taskforce's work is\nvastly complementary. Undeniably, the Taskforce, which\nincludes former Law Commissioner Sarah Green, has been a\nhelpful testing bed for the Commission's intuitions. For\nexample, the Legal Statement on Cryptoassets and Smart\nContracts first suggested the creation of a new category of\nproperty of digital assets back in 2019.\nBut the power of the UKJT is in its judicial endorsement,\nwhich helps raise its authority among the courts and legal\npractitioners. If a statement receives a stamp of approval\nfrom the second most senior judge in the country, it is likely\nthat other members of the judiciary will be more confident to\nadopt it. For example, the findings of the UKJT's Legal\nStatement on Cryptoassets and Smart Contracts were\nendorsed by the commercial division of the High Court in AA\nv Persons Unknown, a case deciding the point whether\nBitcoin (BTC) could be considered as property for the\npurposes of granting a proprietary injunction over Bitcoin.\nThe opinion specifically cited the statement as well as\nspecific points from its analysis of the nature of cryptoassets,\nfurther affirming the reasoning from B2C2 v Quoine, one of\nthe first cases to apply common law of contracts and torts to\ncryptocurrency trading.\nThe same rings true in a non-contentious context. Following\nthe UKJT's publication of research on the Economic Value of\nDigital Securities, 10 accompanied by the Legal Statement on\nDigital Securities\" earlier this year, we witnessed the\nestablishment and launch of Euroclear's Digital Financial\nMarket Infrastructure,\n7AA v. Persons Unknown [2019] EWHC 3556 (Comm) (17 January 2020)\n8 B2C2 Ltd v Quoine Pte Ltd [2019] SGHC(I) 3\nid\n10 English law and Digital Securities, Oxera x LawtechUK (Feb. 2023)\nthe first central securities depository capable of handling English law\nsecurities, followed by the inaugural digital securities issuance by the\nWorld Bank under English law. 12 Granted that Euroclear was\nrepresented by Linklaters, who are actively involved in the Taskforce,\nbut the signal that this successful transaction sends to the market is\nimmense.\nThe Taskforce complements the strategic vision of the Law\nCommission, which has done enormous amounts of work to\ndemonstrate the value of English law as a leading jurisdiction for\ndigital assets. Since November 2021, it has announced five projects in\nemerging technologies: three reviews (digital assets, smart contracts\nand electronic trade documents) have been concluded, and two\n(conflict of laws and DAOs) are due to be delivered shortly. 13 The\ncomprehensive programme of work sends a strong signal to the\nmarket that the UK is as serious about capturing tech as it has been\nabout traditional financial services.\nVarious projects across the market consistently highlight that English\nlaw:\nprovides sufficient assurance to the market to instill confidence in\noutcomes: 'if you do x, y will happen.'\noffers sufficient flexibility to accommodate novel scenarios\n(reasonable management of expectations ex ante, not ex post)\nwithout compromising predictability (rules do not change\nhaphazardly without good cause).\nif a regulatory response is required, it is always timely: as agile as\ntechnology that drives the market.\nis cheap and straightforward to comply with, eliminating any\nnegative impact on new or potential market entrants.\nis aligned with business objectives and incentives of market\nparticipants who generate value to the economy.\nunderpins the legal system, including the courts, which\ndemonstrates deep institutional understanding of:\ntechnology and its potential future;\nfinance and its potential future.\nexemplifies portability, facilitating multi-jurisdictional\ntransactions and borderless application of uniform rules.\ntech-neutral and capable of guiding business activities\nirrespective of changing technology.\n\"Legal Statement on the Issuance and Transfer of Digital Securities, LawtechUK (Feb. 2023)\n12 Citi acts as first Issuing and Paying Agent for World Bank on Euroclear's new D-FMI DLT platform, City, (Oct. 24, 2023);\nLinklaters advises Euroclear Bank on the establishment and launch of its new Digital Securities Platform, and Euroclear Bank\nand TD Securities on the inaugural digital securities issuance by the World Bank, Linklaters (Oct. 24, 2023)\n13 Law Commission to review how private international law applies to digital assets and other emerging technology, Law Commission (Oct. 18, 2022)\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 10\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 6,
    "content": "Overall, the ongoing mission to inject confidence in the English legal\nsystem within the digital assets community is beginning to show early\nsigns of success. While it may still ring true to some that English law\nrequires a more nuanced calculation of commercial risk than legislation, a\nsavvy lawyer will recognise the generally sensible attitude towards digital\nassets from both the Law Commission and the political, legal and\nbusiness community. They also tend to appreciate that English law's\nflexibility makes it generally more permissive towards creativity within\nbounds of common sense.\nQUICK TAKEAWAYS\nFROM THIS GUIDE\n• Tokens require thoughtful design, and must be a critical\ncomponent of their ecosystem. In the chapter on\n'Tokenomics' (Mo Ezeldin), you can read about the\nimportance of sustainable token economies for long-term\nsuccess of your project\n• \"If your business model involves dealing with TradFi firms\nor products, you will need to understand how the current\nsystem operates and work within it.\" To find out how, see\n'Tokenisation' (Charles Kerrigan)\n• From James Burnie and Pavan Kaur at Gunner Cooke /\nWAGMI in the section on 'Token Launch':\nThere are some quick easy wins in terms of being able\nto sell into the UK. For example, classical non-fungible\ntokens (NFTs) sold into the UK from abroad are often\nunregulated.\nAs regulation increases globally, it is becoming\nincreasingly important to factor in how compliance will\nbe ensured using a cost-effective route appropriate for\nthe project.\nIn order for a project to be successful, a more than\npurely legal approach needs to be taken. Participants\nhave expectations regarding token launches and so\nusing an experienced Web3 CMO to navigate these\nwill help ensure the success of the token launch.\n• Poorly drafted Token Warrants can often lead to issues for\na project, including oversupply of tokens > See 'What is a\nToken Warrant' (Anne Rose and Callum Blundell) for more\ntips on how to avoid pitfalls\nIf you are in a hurry and\nwould like a quick digest of\nthis guide, here are some\nof our top takeaways from\nthe different contributors'\nsections:\n• Data governance and security are an important way to\nbuild compliance into your product from the get-go > for\nchecklists and suggestions of where to start, see 'Product,\nData and Compliance by Design' (Derya Karli and Lisa\nMcClory)\nContracts need to go digital in order to be fit for the\nWeb3 era: but what does this mean for lawyers? Read\n'Computable Contracts' (Akber Datoo)\n• Building a project, sure, but building a legal architecture?\nHow should you plan that? > Read 'Navigating Legal\nArchitectures: Building your Web3 Project on Solana in\nthe UK' (Marcus Bagnall)\n• \"If truly decentralised decision-making power is to be\nachieved or retained, significant thought should be given\nas to how best to guard against this sort of concentration\nof voting power\" > Read 'Decentralised Autonomous\nOrganisations' (Professor Sarah Green) on some key\nEnglish legal factors to consider when building DAOs\n• The Cayman Foundation is a popular offshore structure\nfor DAOs, including operating a fully decentralised DEX >\nIn 'Exploring Offshore Jurisdictions: Things to Think\nabout' (Sara Hall), you can read about the importance of\nassessing the legal and regulatory status of the DAO's\ninteractions with onshore users and other important\nthings to bear in mind\nPhoto Credit: Luke Stackpoole (www.unsplash.com)\n11 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 12\nadvice specific to your situation, consult a qualified professional."
  },
  {
    "page": 7,
    "content": "* Can you automate compliance through technical standards? In 'DAO Legal and Tax Standards' (Joni Pirovich of DAOstar,) there is an introduction to the tools available to DAOs for data standardisation, allowing better interoperability with traditional legal and tax reporting frameworks\n* Many projects think about financial regulation, but what about gambling regulation? > In 'Web3 Games' (Omri Bouton), we break out the main things to consider regarding Web3 Games, gambling regulation, loot boxes and more\n* Great SocialFi doesn't just happen, it needs careful planning to provide a good experience for users > read top tips for projects in 'Boosting Organic Growth with SocialFi' (lan Cox)\n* How does DePIN differ from a traditional cloud computing arrangement? > The chapter on DePIN cloud infrastructure agreements (Morgan Lewis) discusses how to balance contractual terms with DePIN customers and nodes, whilst providing adequate contractual protections for the DePIN operator\n* The lack of specificity over the application of law and regulation in a decentralised context poses many challenges for DeFi projects > in 'Practical Guidance for DeFi Developers', read Maria Riivari for an overview and some key practical considerations for DeFi projects when managing decentralised compliance\n* When do you need to get a licence for crypto activities, and when are sanctions laws a concern? > Read Leon Hurd of Cybersandbox and Keystone Law in 'Setting up for Success (Risk Mitigation)'\n* Tax administrations globally are increasing their efforts to ensure that the correct tax is paid, including HMRC recently sending \"nudge letters\" to review potentially undeclared tax liabilities. As information on ownership of cryptoassets continues to grow, proactive compliance is an area of importance for all project founders. In 'Tax and Accounting' (Dion Seymour) you can find a general overview and key guidance, whilst 'The 5 W's' (Mark Pearce) takes you through five 'who, what and where' questions with respect to tax and accounting factors\n* The UK's new rules extending regulation of financial promotions to cryptoassets took effect in October 2023. A helpful overview is provided by Andrew Maguire in 'UK Regulation of Financial Promotions of Cryptoassets'\n* How can you recover stolen cryptoassets, and what are the most important first steps to take? > In 'Tracing, Freezing and Recovery', Matt Green and Marcin Zarakowski give an overview of cryptoasset tracing and the steps involved in recovering stolen assets in the event of a hack, theft or loss.\n13 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nPhoto Credit: Aaron Gilmore (ww splash.com)"
  },
  {
    "page": 8,
    "content": "15\nTokenomics: Designing a Product that Powers\nEcosystems and Empowers Holders\n(Mohamed Ezeldin - Animoca Brands)\nPRODUCT, DESIGN\nAND PLANNING\n01\nTokens are not just tools for governance or fundraising—they\nare products in their own right. Like any product, they require\na suite of complementary systems to sustain them, along\nwith thoughtful design to ensure usability, engagement, and\nlongevity. Founders must treat tokenomics as a critical\ncomponent of the ecosystem, where both the token and the\nsurrounding products are meticulously designed to enhance\nuser experience and value.\nThe Token as a Product\nWhen thinking of tokens as products, their success hinges on\nthree core principles:\n1. Purpose and Utility:\nThe token must serve a clear purpose within the\necosystem. Whether it's enabling governance,\nincentivising user engagement, or unlocking features, the\ntoken's value is derived from its utility. A token without\nutility risks becoming a speculative asset, detached from\nthe ecosystem's core goals.\n2. Supporting Ecosystem:\nA token cannot exist in isolation. To thrive, it requires an\necosystem of products and services that provide\ncontinuous use cases. For example:\n• Gaming Ecosystems: A game token might enable in-\ngame purchases, facilitate trading, or provide access\nto exclusive content.\n• Governance Ecosystems: Governance tokens must\nbe paired with robust decision-making platforms and\ntools for transparency.\n• DeFi Ecosystems: DeFi tokens should integrate with\nyield strategies, staking, and liquidity provision\nmechanisms to retain engagement.\nPhoto Credit: Google DeepMind (www.unsplash.com)\n3. Lifecycle Management:\nLike any product, tokens go through a lifecycle. Founders\nmust plan for the long-term evolution of the token,\nensuring mechanisms like staking, lockups, and\ndeflationary pressures align with the project's growth\ntrajectory.\nWeb2 vs. Web3 UX:\nDesigning for Two Worlds\nWeb2 and Web3 audiences bring fundamentally different\nexpectations to the table. In Web2, the focus is on seamless,\nintuitive user interfaces with minimal cognitive load. In Web3,\nthe experience is often more technical, requiring familiarity\nwith wallets, tokens, and smart contracts.\n1. Different UX Priorities:\n• Web2 UX: Prioritises simplicity, reducing barriers to entry.\nUsers expect experiences like one-click logins, clear\nnavigation, and customer support.\n• Web3 UX: Often appeals to tech-savvy, early adopters\nwho are comfortable with concepts like self-custody and\ngas fees. This audience values transparency and\nsovereignty over convenience.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 16\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 9,
    "content": "2. Bridging the Divide:\nFounders must design products that cater to both audiences. In the short term, most token interactions will be dominated by Web3-native users, but as adoption grows, Web2-style interfaces can help onboard a broader audience. Hybrid approaches, like abstracting wallet management or offering fiat onramps, can reduce friction for Web2 users while maintaining Web3 functionality.\n\nCommunity Dynamics and Expectations\nTokens are deeply tied to their communities, especially in the early stages of a project. Founders must recognize and design for the inherent expectations of Web3-savvy users, who often see participation as an entitlement to rewards.\n1. Reward Culture:\n• Incentives: Web3 users expect tangible rewards for their participation, whether through staking, governance, or contributing to the ecosystem.\n• Engagement Models: Successful projects incorporate gamification and social recognition to reinforce participation, ensuring users feel both rewarded and valued.\n\n2. Feedback Loops:\nTokens thrive on active and engaged communities. Mechanisms like governance votes, leaderboards, and airdrops can create virtuous cycles, where participation begets more engagement, which in turn strengthens the ecosystem.\n\n3. Short-Term and Long-Term Alignment:\nWeb3 communities often emphasize short-term rewards, but founders must balance this with the project's long-term vision. Strategies like vested rewards, fee-sharing models, and progressive token unlocks can align short-term engagement with sustainable growth.\n\nde-sign\n/dǝzīn/\nnoun\nPhoto Credit: Edho Pratama (www.unsplash.com\n1. a plan or drawing produc\nand function or working\nor other object before\nThe has just unveiled\nmuseum\nSynonyms plan, bl\noutlie\nrepr\n\nThe Bottom Line\nTreating your token as a standalone product ensures it is more than just a speculative asset. By designing thoughtful ecosystems, balancing UX across Web2 and Web3, and catering to community dynamics, founders can build sustainable token economies that attract users, drive engagement, foster long-term success and are legally compliant.\n\nLegal and Practical Considerations\nWhen building tokens as products and integrating them into a dual-audience ecosystem, several key legal and practical factors must be addressed:\n1. Interoperability:\nBuilding ecosystems where Web2 and Web3 products coexist requires interoperable infrastructure. Leveraging standards like ERC-20/721 for Web3 and APIs for Web2 integration ensures seamless interaction.\n2. Scalability:\nProjects must anticipate the demands of scaling from Web3-savvy users to broader audiences. This includes integrating Layer 2 solutions, optimising transaction costs, and ensuring UX scalability.\n\n3. Compliance and Regulation:\nTokens as products must still comply with UK (and global) laws and regulations, including financial promotions and AML/KYC requirements. Founders should design incentives that align with legal constraints while remaining attractive to users. For more on rules, compliance and regulation in the context of token projects, please read on after 'The Bottom Line'.\n\nPhoto Credit: Tingey Injury (www.unsplash.com\nPhoto Credit: Shubham Dhage (www.unsplash.com)\n17 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 18\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 10,
    "content": "Tokenisation\n(Charles Kerrigan - CMS; RAK DAO)\n\nThe first question might be: why do a token?\nA response is perhaps: 'To raise capital!'\nFor reasons we explain, however, this is not a good answer.\nThe reality is not as simple as some might think.\n\nThis is muddied by the fact that many 2017 ICOs did, in fact,\nissue tokens and raise capital. Perhaps the best way of\nthinking about this is that it is not so simple anymore.\nSometimes the first people who break some rules can do so\nbecause regulators are not looking in their direction. Once\nrules are broken though, regulators definitely are looking in\nthat direction.\n\nAs with everything in crypto, we have to start with some\ndefinitions. Tokenisation means different things to different\npeople. So, the first thing you have to be clear on in your\nproject is what you mean by tokenisation.\n\nTokenisation is one of the ways we see the difference\nbetween crypto and traditional finance (TradFi).\n\nIn TradFi, a token is a digital representation of a financial\ninstrument of some sort. It could be a stock or a bond or\nother debt instrument. It could be cash. It could be an\nalternative asset like wine or physical art. But current market\npractice is to issue the stock or bond or whatever, then create\nan onchain digital representation of it. The point is that the\nway TradFi currently understands tokenisation is as a wrapper\naround an existing product and process. This is the story of\nthe hugely successful BTC ETFs from the beginning of 2024.\nThey demonstrated investor appetite for BTC, not through\ninvestors buying BTC direct or through exchanges, but by\ngetting exposure to BTC through a traditional financial\nproduct, an ETF that owned BTC.\n\nIf your business model involves dealing with TradFi firms or\nproducts, you will need to understand how the current\nsystem operates and work within it. You can find information\non this by searching — Tokenisation + Investment\nAssociation.\n\nA final few points before we move on to how this works if you\nare building outside the current financial system.\n\nIf you want to have TradFi firms as investors, partners, or\ncustomers for anything:\n• you will need a legal opinion confirming if you are inside\nor outside the regulatory perimeter - i.e. if you need a\nlicence from a financial regulator to do what you're doing;\n• you will need to be incorporated in a jurisdiction that has\na good reputation for regulation - many UK financial\ninstitutions have a strong preference to deal with UK\nbased fintechs;\n• you will need enough capital to be able to survive a long\nprocess of answering questions from different\nstakeholders.\n\nThat covers enough on tokens and business models that are\ninside the current financial system.\n\nIn crypto native conversation a token can refer to a number\nof things.\n\nA token can simply be a message or instruction between\ncomputers. That is not what people think of as tokenisation.\nTokens of this type are not recognised by the legal systems as\nassets. They generally therefore do not have value because\nthey have no existence beyond the sending of the message.\n\nSo, when we talk about tokens, we are generally talking about\ntokens that have value or utility on a blockchain. Tokens of\nthis type can be recognised by legal systems as assets.\n\nThis distinction is important because it goes to the question\nof whether a token is suitable for fundraising or not.\n\n19 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n\nIf fundraising is a primary use case for your token, it will\ntrigger rules relating to securities issuance. This is why the\nargument about whether a token is or isn't a security is so\nsignificant. A token that is a security must be issued in\naccordance with securities rules and regulations. These differ\njurisdiction by jurisdiction but they all have some common\nfeatures. Regulators would refer to these features as relating\nto investor protection and market integrity.\n\nInvestor protection centres on things like making full and fair\ndisclosures of all relevant information. Relevant information\nmeans details of the issuer, the issuer's business model, the\nterms of the tokens (securities), risk factors etc. Traditional\nforms of whitepapers are not \"MICA compliant\", so there are\nno good precedents for new projects to use now.\n\nIn fact, recent regulation is designed to harmonise rules\nrelating to securities and unregulated tokens to remove the\nability for issuers to arbitrage between the rules. The recent\nEuropean rules you will have heard referred to as MICA\nessentially read across to tokens the equivalent rules that\nalready apply to securities. A MICA-compliant whitepaper will\nlook more like an IPO prospectus than a traditional\nwhitepaper for a token.\n\nMarket integrity centres on things like restrictions on front-\nrunning, trading on inside information, manipulating prices or\norder flow, and anything else that puts some investors in\nbefore worse position than others. The worst offence is for\nthe team to make money from inside information. That is\nusually illegal. It also kills projects because it destroys trust.\n\nCrypto lawyers spend a lot of time analysing the rules that\nclassify tokens. A token that gives a holder rights like those\nthat a shareholder in a company would get will be a security.\nA token that does not have those rights will not and will\ntherefore not be subject to securities regulations. If proceeds\nof a token issuance will be used to fund the costs of the\ncompany that issues the token, or if the investor is buying the\ntoken to get a return, these are indications that the token is a\nsecurity. Remember how different BTC is to this — no issuer,\nno promises, no controller beyond the community. Its value\ncomes only from its hard-capped scarcity.\n\nThe short point here is that taking in money from a third-\nparty investor is one of the most serious things that a\nbusiness or project can do in the eyes of regulators so there\nare high barriers to entry. Broadly, third party money is an\ninvestment (in shares or tokens) made by a person who is not\npersonally known to you. Regulators care about this for the\nreasons set out above, summarised as: you might lose the\ninvestors their money.\n\nBy this they mean that you might literally lose it because you\nget hacked through not having spent enough time or money\non security, or you might misspend it, use it as your own, or\nany number of other problems. Regulators also care about\npreventing financial crime. If you take investment from a\ncriminal, then you may be holding the proceeds of crime.\nHolding proceeds of crime is an offence. Returning them is\nmoney laundering. Some of these rules exist to save\ninexperienced projects from themselves. If you are not used\nto handling other people's money, you need to do a lot of\nwork understanding your responsibilities before you do so.\n\nThe analysis so far focused on securities because those are\nthe rules made famous by Gary Gensler. Alongside them\nthere are similar rules and requirements for projects that pool\ncapital. In the UK these rules require \"collective investment\nschemes\" to be licensed. In Europe, they require fund\nvehicles to be licensed.\n\nThe rules differ in specifics by jurisdiction but the themes are\nthe same. In practice, this means that most tokens are now\nlaunched in core markets only initially, then expansion follows\nas the project scales and has the bandwidth and funds to get\nsign off for other countries.\n\nThere are now other ways in which you are kept on the\nstraight and narrow. Now that CEXs are subject to strict\nmoney laundering rules and have regulators checking that\nthey are not securities exchanges without a licence, if you\nwant to list your token on an exchange (which investors will\nwant for the liquidity), the exchange will also check that the\ntoken isn't a security. Investors often now also ask for the\nsame analysis and assurance. In practice, cutting a corner by\nlaunching a token that is in breach of some regulation limits\nyour project's ability to scale — when serious investors arrive,\nthey do checks and find the flaw and it's a problem then.\n\nThis all means that there is some time and trouble now\ninvolved in a token issuance that is for building. The most\ncommon way in the UK now is for a project to take in equity\nfrom angels or VCs and use that for building, but also have a\ntoken in their roadmap and issue a token warrant (a right for\nearly investors to take tokens when they are issued) to the\nequity investors. The token follows the set up and build.\n\nThis way also solves the other main issue that applies with\ntoken issuances in the UK now. The UK regulator has limited\nthe ability to market tokens, including on social media. If you\ncan't tell people about your token, you can't get liquidity or\ntrading. These rules are called the financial promotions rules,\nand they are explained elsewhere in this guide.\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 20\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 11,
    "content": "So, what does that leave as options for tokenisation for early-\nstage firms?\nYou can tokenise the equity in a UK company without too\nmuch trouble. Rules on secondary trading of securities mean\nthat this on its own doesn't make a market. But, sometimes\nprojects do that to show their credentials as crypto projects.\nYou can be a true L1 blockchain, where the Bitcoin analysis\nabove applies. Your token could be for security and network\nvalidation. But BTC took a long time to be valuable. And a\nBitcoin fork isn't valuable these days.\nYou can go for \"sufficient decentralisation\" but that takes\nscale and money. Even well-known DeFi projects can have\nrelatively few large token holders and relatively few\nvalidators. If a regulator sees this, they will argue the project\nis not decentralised.\nYou can do a pure utility token. That means not raising\ncapital but giving features or services. As we say above, this\ndoesn't have to be at the very start of the project.\nYou can do a governance token. This could be a way to\nengage with your community. But you need to be careful\nthat you don't mix up governance rights that shareholders\nhave in your company, governance over, say, technical\nfeatures of your codebase.\nYou can do your own design of a utility token. There are\nsome that are effectively loyalty programs, but they capture\ncommunity and engagement without promising mooning\nreturns. Some of those have then been expanded and\nchanged to share value, but only when the project has the\nmoney and experience to handle the responsibilities that\ncome with that.\nTop crypto investors like tokens. They think they are where\nthe value will accrue in the best projects. But they are hard\nto impress on tech and even harder on tokenomics. You\nneed a true \"category creation\" project to win with them. So,\nwork on your plans for tokenisation but know that tokens\naren't the easy option, and they certainly aren't now free\nmoney.\nWhat is a Token Warrant?\n(Anne Rose and Callum Blundell - Mishcon de Reya)\nA Token Warrant functions as a promise that gives the holder\nthe right, but not the obligation, to purchase a set number of\ndigital tokens at a later date, for a price that's decided\nupfront. The price is fixed in advance, so if the tokens do well\nand their value goes up, you could bag a bargain! They work\nin a similar way but there are key differences that set them\napart from traditional derivatives, like stock warrants.\nToken Warrants usually pop up when a new blockchain\nproject is getting off the ground. When a company has an\nexciting new idea and starts putting it together, but before\neverything is up and running, it might offer token warrants to\nhype up potential investors and raise some cash. Token\nWarrants should not be confused with token incentive\nschemes but may be offered to team members as well as\ninvestors.\nThe Importance of Heads of Terms\nAs with any part of a funding round, it is extremely important\nfor the company and investor(s) to work together at the\noutset to agree the heads of terms for the deal and, as part\nof that, ensure they don't overlook the terms of any Token\nWarrant to be issued. For example, agreeing a clear definition\nof \"Portion\" (as discussed in more detail below) from the\nbeginning should ensure negotiations on the terms of the\nToken Warrant go much more smoothly.\nWe often find Token Warrants are sidelined in the context of\nlarger equity or debt financing rounds, meaning important\nprovisions regarding Token Warrants are left out when\ndrafting heads of terms.\n21 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nThis can have unintended consequences for the company,\nfor example, drafting the definition of \"Portion\" too widely\ncan lead to an oversupply of tokens which pushes down the\ntoken's value.\nTop Tips:\nDefining the Portion of tokens that an investor is allocated\n— the investor friendly approach is for the investor's\nallocation of any given token (Portion) to be defined as a\nfixed percentage of the total number of tokens created. This\nis often set at the same percentage as the investor's equity\nownership in the company at the time of an investment\nround. The key consideration here for the company is that\nfuture investors may demand the same treatment as early\ninvestors / token warrant holders and communities may also\nhave a negative perception of a project with tokens heavily\nallocated to investors early on, which can therefore impact\nfuture funding rounds.\nThe more company friendly compromise would be for the\nPortion of token allocation to reflect the pro rata proportion\nof the investor's equity ownership in the company at the time\nof a token launch / generation event (which could be a lower\npercentage than if a fixed percentage is agreed to at the time\nof entering into the token warrant instead).\nThe definition of \"Portion\" will usually include a\nfurther definition of \"Pro Rata Share\" reflecting the\npercentage of the investor's equity ownership in\nthe company. Be wary that where an investor has\nan unexercised stock warrant at the time of a\ntoken launch / generation event (and the Pro Rata\nShare is based on the investor's fully diluted equity\nownership), this should not artificially increase the\nPro Rata Share of the investor's Portion of tokens\nallocated. The rationale for this is that the investor\nmay decide to never exercise the equity warrant!\nCheck the definition of \"Excluded Tokens\" — as well as a\ndefinition of \"Tokens\", heads of terms should define \"Excluded\nTokens\" for example, tokens issued for development, testing\nor experimental purposes or pursuant to activities like staking\n(earning rewards by validating transactions on the\nblockchain), rewards or inflationary or dilutive controls.\nThere is no benefit to an investor being issued these types of\ntokens and failing to exclude them could have unwanted\nconsequences.\nReduce ambiguity — we often see references to intellectual\nproperty and material intellectual property, but these terms\nshould be properly defined to avoid any ambiguity. It should\nalso be abundantly clear how certain processes, such as the\nservice of notices, are triggered.\nLockup Provisions — companies typically want to restrict\nthe transfer of tokens acquired under token warrants for a\ncertain period after the token launch. For example, a lockup\nschedule preventing any transfers for 12 months after the\ntoken launch date, releasing 50% of tokens from the one-\nyear mark then a gradual release of the remaining balance\nover the next year or two. Lockups can encourage\ncooperation between token holders, allow the broader\ncommunity a fair chance to snap up popular tokens, and can\ninclude additional transfer restrictions to manage compliance\nrisks and regulatory requirements.\nMost Favoured Nations Clause — a Most Favoured Nation\n(MFN) clause is a provision often argued for by investors and\nsometimes included in Token Warrants to ensure that the\ninvestor receives equal treatment to that given to future\ninvestors. In essence, if the company grants a future investor\na Token Warrant with better terms, benefits, or privileges, for\nexample a less restrictive lockup, these must also then be\nextended to the earlier investor that is subject to the MFN\nclause.\nAn MFN clause is market practice in the USA, if a bit\naggressive, but in the UK we have seen companies\nsuccessfully push back on an MFN clause so this should\nideally be ironed out at the heads of terms stage to prevent\ninvestors sneaking it into the initial (or subsequent) drafts of\nthe Token Warrant.\nCustodians — many investors will be keen to include a\nprovision that, following any token launch / generation event\n(TGE), the company will partner with a high-quality custodian\n(a third-party which looks after the tokens) which will accept\nand support the tokens with secure wallet and storage\nservices promptly following such distribution. The company\nshould only agree to use commercially reasonable efforts in\nsuch a scenario, as otherwise it runs the risk of being strong-\narmed into partnering with a custodian on unfavourable\nterms.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 22\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 12,
    "content": "Dispute Resolution - we have found that dispute resolution\nprovisions, which enable the parties to escalate disputes to\narbitration, are not as common in Token Warrants as they\nought to be.\nWhile such provisions shouldn't prevent the parties from\ntaking a dispute to court entirely (for example, claims for\ninjunctive or equitable relief and claims relating to intellectual\nproperty rights should be reserved for the court's jurisdiction)\nit's often advisable, if the company is open to the alternative,\nto include a dispute resolution clause rather than confining\nthe parties to pursuing claims through the courts only.\nPhoto Credit: Steph Meade (www.Lummi.ai)\nProduct, Data and Compliance-by-Design\n(Derya Karli - Own Protocol and\nLisa McClory - D2 Legal Technology)\n\"Compliance is your responsibility. If we find inadequate\ncontrols in your firm, we may take action against you.\" -\nUK Financial Conduct Authority\nData is a vital force for Web3 applications! It performs many\nimportant tasks, including triggering smart contract\nfunctions, allowing access to permissioned resources,\nproviding connections and information, underpinning\ndecentralised proof of trustworthiness, identity, ownership\nand more. When building a Web3 application, you are\neffectively building a home for all the data that will one day\nlive within your app, and this can be a complex area with\nnuanced trade-offs to take into account, technical standards\nand legal requirements, all against a shifting backdrop of\ncyber risk factors. You may need to think carefully about your\nhouse's rooms and facilities to cater properly to the needs of\nits inhabitants!\nBy thinking about data governance and compliance right\nfrom the start of your product design phase, you avoid\nhaving to rewind and do an expensive rebuild when an app-\nstore or regulator later imposes requirements. Planning\naround data law and security requirements also helps you to\nmanage compliance costs later in your project.\nWhy is Data Security and Governance Important in a\nWeb3 Context?\nWeb3 applications often act as store or record of value and\nmay perform important functions relating to the allocation of\nresources or project governance. Data breach and\nexploitation of security flaws can result in a particularly\nheightened risk of financial losses, or potentially expose\npeople to severe risks of scams, theft and identity fraud.\nDue to the nature of Web3 often involving novel and\ninnovative use of emerging technologies, whilst also pushing\nthe boundaries of what is possible when enabling\ncollaboration and shared networks, there are heightened\nsecurity and data breach risks.\nThe FCA recently surveyed14 consumer attitudes and\nbehaviours towards crypto, finding that consumer awareness\nis now up to 93%, and only 1 in 10 people failed to do\nresearch before buying cryptoassets. Consumers care about\nsecurity and data, as do regulators, and it is highly important\nthat your product is built on solid foundations of good data\ngovernance practices.\nData Governance\nGood data governance is an essential starting point for any\nrobust, reliable and trustworthy product.\nIt is an approach to managing the availability, usability,\nintegrity, and security of data, including establishment of\npolicies, procedures, and standards that ensure data is\nproperly handled throughout its lifecycle. Good data\ngovernance can not only protect against risks, but will also\nhelp to streamline operations and enable better use of\nautomation, better scalability, and lower costs of data\nstorage: all very important factors to get right from the outset\nof your project.\nEffective data governance is therefore highly important to all\nWeb3 projects and should be something that developers\nconsider throughout the project lifecycle. Projects should\ndefine clear roles for data management, implement data\nclassification and access controls, and ensure consistent\npractices.\nA solid working knowledge of data law, data ethics and\nsecurity best practices is important because:\n• this is a regulatory obligation under the General Data\nProtection Regulation in the EU and the UK;\nactively embedding good data governance and security\nstandards, including responsible data practices, will help\nyou to build a secure and robust product, bringing good\nvalue to your ecosystem and community.\nTraining employees on these standards is also essential, as\nPersonal data is any information that directly or indirectly\nidentifies or relates to a natural person, including where it is\nan identifier that identifies a person only indirectly, or when\naggregated with other pieces of information. It can include a\nwide range of information and generally requires special\nprotection, e.g. name, personal ID records, user location\ndetails and so on.\nEU and UK GDPR are presently pretty much the same (at the\ntime of writing), as the UK retained a frozen version of the EU\nGDPR following the UK's exit from the European Union (the\ntransition period ended on 31 December 2020). Alongside\nthe UK GDPR, the Data Protection Act 1998 still applies in the\nUK, but is essentially only relevant for law enforcement and\nintelligence services.\nAs the UK is no longer in the EU, the UK's approach to data\nlaw is currently under review and a new Data Protection and\nDigital Information Bill15 is being proposed. This Bill will clarify\nand make provision for several important areas of the digital\neconomic environment, such as electronic signatures and\ndigital authentication, oversight of biometric data and general\nrules about privacy of electronic communications. These new\nrequirements will be relevant to Web3 businesses in any\nnumber of areas.\ntheir understanding directly impacts an organisation's ability General Data Protection\nto safeguard sensitive information. Ultimately, robust data\ngovernance enhances informed decision-making, improves\nefficiency, and builds customer trust by demonstrating a\ncommitment to security and privacy.\nTypes of Data\nThere is a key distinction between personal data and other\nmore general kinds of data or information.\nPersonal data requires particular attention because data laws,\nsuch as the EU and UK General Data Protection Regulation\n(EU) 2016/679 provide individuals with legal protection\nwhenever their personal data is processed. These regulations\nreflect the fundamental human right to privacy enshrined in\nhuman rights treaties, such as the Universal Declaration of\nHuman Rights.\nRegulation\nData protection law is centred around certain core principles\nwhich seek to ensure that personal data is processed lawfully,\nfairly and in a transparent manner. The principles are:\n• lawfulness, fairness and transparency: a general\nprinciple that organisations usually manage by creating\ndata policies with disclosures of processing activities to\npeople whose data is processed, and by documenting\ndecisions around whether activities involving data are fair\nand lawful;\n• purpose limitation: collection and processing for\nspecified, explicit and legitimate purposes, e.g. not\ncollecting data for one reason, and then using it for\nsomething very different and unexpected;\n14 FCA Finds Crypto Ownership Continues to Rise as It Delivers Plans to Regulate Crypto, Financial Conduct\nAuthority (26 November 2024)\n23 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n15Data Protection and Digital Information Bill, UK Parliament (23 September 2024)\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 24\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 13,
    "content": "• data minimisation: ensuring that data is adequate,\nrelevant and limited to what is necessary for the purposes\nof its processing;\n• accuracy: taking every reasonable step to keep data\naccurate and up-to-date and deleting or rectifying any\nerrors without delay;\n• storage limitation: ensuring data is held for no longer\nthan is necessary. Relatedly, individuals also have a legal\nright to request the erasure of their personal data (a 'right\nto be forgotten'), and in some circumstances to withdraw\ntheir consent to processing;\n• integrity and confidentiality: data must be collected and\nprocessed, stored and processed securely, ensuring\nappropriate safeguards against accidental loss,\ndestruction or damage.\n\nTransparency is one of the key features of Web3 technology.\nThis is useful because it allows people to access information\ndirectly, without relying on intermediaries, and also because it\nis possible to trace and recover assets in the event there is a\ntheft or a fraud. However, this transparency is also a\nchallenge for many Web3 projects when seeking to get the\nright approach to privacy and user safety. Where personal\ndata is concerned, the notion of storing data permanently\nonchain, where it can be accessed openly by any node or\nperson reviewing the ledger through a block explorer app, is\nvery difficult to reconcile with data laws, including the\nprinciple of data minimisation.\n\nArticle 25 GDPR sets out the obligation of data protection by\ndesign. This requires data controllers to implement\nappropriate organisational and technical measures to\nimplement the data protection principles, including data\nminimisation, in an effective way, as well as integrating\nsafeguards that meet data law requirements. This obligation\napplies both at the outset, when determining how data will\nbe processed, and later at any time when data is actually\nbeing processed.\n\nThis requirement is to be interpreted in the circumstances of\neach type of processing, and must take into account:\n• the state of the art;\n• the cost of implementation;\n• the nature, scope, context and purposes of data\nprocessing; and\n• the risks of varying likelihood and severity for rights and\nfreedoms of natural persons by the processing.\n\nArticle 32 GDPR also sets out specific expectations for\nsecurity of data processing. This includes requirements for\nthe pseudonymisation and encryption of personal data, as\nwell as processes for the regular testing and evaluation of\ntechnical and organisational security measures. 16 This\nrequirement under GDPR applies alongside other network\nand information security obligations applicable to certain\ndigital service providers, including online marketplaces,\nonline search engines and cloud computing services under\nthe Network and Information Systems Regulations 2018.\n\nKey things to consider where your product will process personal data:\n\nData controllers must register\nwith the ICO\nThere is a small fee to pay and the form is easy to complete online. Details are\navailable on the ICO's website. 17\n\nDecentralisation and data\ngovernance?\nLegal obligations apply to controllers and processors of personal data, each having a\ndifferent role and responsibility. This includes specific compliance steps, such as\npreparing a Data Protection Impact Assessment.\nIn the context of decentralised organisations, it can be difficult to define who has the\nrole of controller or processor, and individuals may not have an easy way to establish\nhow their data is stored, who is responsible for data governance, or where they can\ndirect a query in the event there is any issue. Making adequate provision for data\ngovernance and security within an app's design and build is a helpful way to resolve\nambiguities and prevent problems and disputes from arising.\n\nBe especially careful of\nsensitive personal data\nGDPR provides particular protection to special categories of personal data which are\nparticularly sensitive. Special category data relates to: racial or ethnic origin, political\nopinions, religious or philosophical beliefs, or trade union membership, and the\nprocessing of genetic data, biometric data for the purpose of uniquely identifying a\nnatural person, data concerning health or data concerning a natural person's sex life\nor sexual orientation. Processing of this type of data is only permitted under limited\ncircumstances and you should be especially careful to consider your legal obligations\nwhere dealing with any special category data.\n\nData protection by design\nand security are highly\nimportant\nGDPR requires all data controllers to design their systems and processes for\ncompliance with data protection principles.\n\nThere are specific security requirements under GDPR and this is a big part of\nensuring compliance. You can find a security checklist18 on the UK ICO's website as a\nstarting point, but this is a highly important area and requires detailed, specialist\nattention. You should seek professional support as required.\n\nEthical practices are\nimportant too\nBy associating data about wallet owners from onchain and offchain digital sources, it\nis possible for any third party to acquire a great deal of information about a person,\ntheir online activity and assets they hold.\nEven if your app does not directly hold personal data, take care to think about the\nsafety of users and put in place best practice measures to safeguard user data.\n\nPhoto Credit: Ricardo Matos (www.Lummi.ai)\n\n16 Data Protection and Digital Information Bill (23 September 2024)\n25 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n16 A Guide to Data Security, Information Commissioner's Office (last visited 03 December 2024)\n17 Data Protection Fee, Information Commissioner's Office (last visited 03 December 2024)\n18 A Guide to Data Security, Information Commissioner's Office (last visited 03 December 2024)\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 26\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 14,
    "content": "Artificial Intelligence\nRegulation\n\nIncreasingly, blockchain applications are using Al agents for smart contract execution and algorithmic trading, amongst other purposes. Developers should also be aware that new Al regulations are gradually emerging, including the EU AI Act (Regulation (EU) 2024/1689), which came into force on 1 August 2024. The Al Act creates a comprehensive framework to regulate Al systems across the EU, and also has some extra-territorial effect, e.g. where an Al system's output is used in the EU.\n\nWhere it applies, the EU AI Act will prohibit certain unacceptably high-risk Al practices, including - for example - systems that employ subliminal or purposefully manipulative or deceptive techniques with the objective or effect of materially distorting a person's behaviour in a way that is reasonably likely to cause them significant harm. Other systems are classified as high risk, including many uses of Al in a workplace setting, and some uses of biometric data. There is also a requirement to provide users with transparency that they are engaging with an Al system, where the Al system generates synthetic audio, image, video or text content (see Article 50 EU AI Act).\n\nIf your product uses Al in any area of your tech stack, ensure to check whether Al regulations may apply and take compliance steps accordingly.\n\nPractical Data Governance through the Product Lifecycle\n\nWeb3 involves many different technologies, and the approach to data governance can vary depending on the technology involved. In this section, we cover some key things within different areas of the app build process that you need to think about from a data governance and compliance perspective.\n\nWhen thinking about data governance in a Web3 context, it is helpful to be aware of the following key concepts:\n\nPhoto Credit: Nahrizul Kadri (www.unsplash.com)\nPhoto Credit: Markus Spiske (www.unsplash.com)\nPhoto Credit: Luke Chesser (www.unsplash.com)\n\nData Classification:\nInvolves categorising data based on sensitivity and regulatory requirements, including classification of personal data or Personal Identifiable Information (PII), including online identifiers or identification numbers and other personal information stored in any format, such as National Insurance records, addresses, birthdates, family situations, banking information, and medical histories.\n\nTransaction data:\nRefers to users' activity across various services and accounts. This can include the customer's transaction history, exchanges, withdrawals, transfers and payments, including dates and amounts.\n\nThe state of a smart contract\nRefers to its current set of data and conditions at a specific point in time. This includes the values of variables, balances, and any outcomes from interactions with the contract. In essence, the state is a snapshot of the smart contract's \"memory\" and how it behaves based on prior inputs and events.\n\nAnalytics and metrics\nRefer to the processes and tools used to measure, analyse, and interpret data generated by systems, users, and transactions. These insights are used to optimise performance, enhance decision-making, and monitor compliance and security.\n\nSystem logs\nAre records generated by software or hardware systems that document events, operations, and activities within the system. In the context of blockchain and crypto projects, system logs provide critical information about how dApps, nodes, or blockchain platforms are functioning. These logs are essential for debugging, auditing, and ensuring operational transparency.\n\nUSERS: LAST 7 DAYS USING MEDIAN\nLOAD TIME VS BOUNCE RATE\nMedian Page Load (LUX): 2.056s\nBounce Rate\n57.1%\nPage Load (LUX) - Bounce Rate\nOPTIONS\nSTART RENDER VS BOUNCE RATE\nMedian Start Render (LUX): 1.031s\nStart Render (LUX) - Bounce Rate\nOPTIONS\nPAGE VIEWS VS ONLOAD\nPage Load (LUX)\n0.7s\nPage Views (LUX)\n2.7Mpvs\nBounce Rate (LUX)\n40.6%\nSESSIONS\nSessions (LUX)\n479K\n4 pvs\nSession Length (LUX)\n17min\nPVs Per Session (LUX)\n2pvs\n\n27 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 28 advice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 15,
    "content": "Managing Product Data Flow\n\nWhen designing an app, a key area to consider is the product’s data flow. Overall, the aim should be to ensure data minimisation throughout the product’s lifecycle, particularly where it relates to any personal data/PII.\n\nInput data is a very important part of this, because you can encrypt data before it goes onchain and this will reduce your app’s data footprint and save you a lot of compliance worries elsewhere in your project. Always hash data before putting it onchain, and ensure to use a secure hashing algorithm with adequate sources of randomness.\n\nTransaction monitoring is not an obligatory thing to include, but it is really important for your product’s internal controls. It will allow you to keep an eye on malicious or risk-related activity in your system and helps you manage risks.\n\nYour product may require you to maintain oracle services. If so, this could be a lot of work. Consider using tools (e.g. chain.link) that help you manage data in a secure and compliant way. Think carefully about the additional work required to build your own oracle management solution and weigh up the costs and benefits associated.\n\nThere are three key areas to consider when thinking about data location:\n\n*   onchain data;\n*   offchain data;\n*   hybrid approaches.\n\nOnchain Data\n\nOnchain data is a cornerstone of blockchain systems, enabling transparency, security, and trustless operations. However, its costs and limitations demand thoughtful design. By strategically managing smart contract state, transaction history, and public attestations, and by carefully analysing the trade-offs of onchain storage, developers can build efficient, scalable, and compliant Web3 systems.\n\n1. Smart Contract State\n\nSmart contract state represents the core variables and conditions stored on the blockchain, defining the functionality and outcomes of the contract. For example, a token contract’s state might include user balances and supply limits, while a DeFi protocol might store collateral ratios and governance decisions.\n\nTo comply with data minimisation, developers should store only essential variables directly in the contract and offload non-critical data to offchain storage. Using event logs instead of state updates can significantly reduce gas costs while maintaining transparency, as events do not contribute to contract storage. Additionally, implementing robust access control mechanisms ensures that only authorised users or entities can modify sensitive state variables. Regular optimisation of smart contracts, such as batching multiple updates into a single transaction, can further reduce storage costs and improve scalability.\n\n2. Transaction History\n\nTransaction history encompasses a detailed, immutable record of all user activities, such as token transfers, staking operations, and smart contract interactions. While transaction history ensures traceability and accountability, developers must anonymise data to prevent exposing sensitive user information. Storing minimal metadata—such as transaction amounts, timestamps, and wallet addresses—rather than including personal identifiers or extraneous details is critical for compliance. Aggregating transaction data or summarising interactions can also help minimise storage requirements while maintaining verifiability. For example, rollups or batching mechanisms can summarise hundreds of transactions into a single onchain update, reducing costs and improving blockchain throughput. Cryptographic techniques like Merkle proofs or zero-knowledge proofs (ZKPs) can be employed to validate offchain transaction details onchain without compromising user privacy.\n\n3. Public Attestations\n\nPublic attestations provide verifiable proof of actions, claims, or ownership recorded on the blockchain. Examples include identity verification, proof of ownership for NFTs, or certifications of data integrity. While public attestations enhance trust and transparency, they can inadvertently expose sensitive information. To align with data minimisation principles, developers should rely on hash-based attestations where only a cryptographic hash is stored onchain, and the underlying data is kept offchain. This approach ensures that the data remains verifiable without exposing its contents. Leveraging privacy-preserving technologies like ZKPs allows users to share selective information for verification without revealing unnecessary details. Decentralised Identifiers (DIDs) and Verifiable Credentials are also effective solutions, enabling offchain storage of attestations while maintaining onchain verifiability.\n\n4. Cost-Benefit Analysis of Onchain Storage\n\nStoring data onchain provides immutability, transparency, and decentralisation but comes at a high cost, especially on networks like Ethereum. To minimise costs, developers should store only essential data directly onchain and use offchain systems like IPFS or Arweave for large or sensitive datasets. For example, instead of storing the metadata of an NFT directly onchain, developers can store a hash that points to its offchain location. Layer 2 scaling solutions like zkSync or Optimism are valuable for reducing storage costs by handling most data processing offchain and submitting only summarised data to Layer 1. Periodic data pruning can help archive outdated or inactive data offchain while retaining a root hash for future validation. When designing systems, evaluating lower-cost blockchains for less critical data storage can further optimise operations. Balancing these considerations ensures efficient use of onchain storage without compromising functionality or compliance.\n\nOffchain Data\n* Private User Information\nStoring personal data offchain is essential to comply with privacy regulations like GDPR and to safeguard users from identity theft or breaches. To protect private user information, projects should use encrypted databases and ensure robust access control mechanisms. By offloading this data to secure storage, only references or hashed pointers to the data need to be stored onchain, maintaining compliance without compromising user privacy.\n* KYC/AML Documentation\nKnow Your Customer (KYC) and Anti-Money Laundering (AML) requirements necessitate the storage of detailed user verification documents, such as government-issued IDs or proof of address. Storing these large, sensitive data sets offchain reduces costs and prevents unnecessary exposure on the blockchain. Using decentralised identity frameworks, such as Decentralised Identifiers (DIDs), allows projects to store KYC/AML data securely offchain while enabling selective onchain verification for compliance checks without revealing sensitive information.\n* Large Datasets\nBlockchain systems are not designed to handle large datasets such as media files, logs, or complex analytical reports. Storing such data offchain on platforms like IPFS or Arweave reduces costs and ensures scalability. For example, an NFT project might store high-resolution images or videos on IPFS, while retaining only the IPFS hash onchain to link the data for verification.\n* System Configuration\nSystem configurations, such as application settings, network preferences, and smart contract deployment parameters, are better stored offchain for flexibility and security. This ensures that changes to configurations can be managed dynamically without requiring costly onchain updates. Storing configuration files in secure, centralised systems or encrypted offchain databases is a practical solution for managing this type of data.\n* Analytics and Reporting Data\nAnalytical insights and reports, such as user behaviour metrics, transaction patterns, or performance logs, are typically too voluminous for onchain storage.\n\n29 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 30 advice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 16,
    "content": "Projects can store these data sets offchain in dedicated data\nwarehouses or analytic platforms like Google BigQuery or\nAWS Redshift. By integrating these tools with blockchain\ndata, projects can perform advanced analytics and generate\nreports without burdening the blockchain's storage.\n\nHybrid Solutions\nThe following hybrid approaches can offer developers a\nchoice when balancing different concerns of data privacy, vs\nsecurity and efficiency:\n• Merkle Proofs for Data Verification\nMerkle proofs allow developers to verify offchain data\nintegrity without storing the full dataset onchain. A Merkle\ntree generates a cryptographic root hash from multiple\npieces of data, enabling verification of any single piece by\ncomparing its hash to the root. For example, a supply chain\ndApp can store transactional data offchain while using\nMerkle proofs onchain to validate individual records.\n• IPFS Integration Patterns\nIPFS (InterPlanetary File System) is a decentralised file\nstorage system ideal for offloading large files while\nmaintaining onchain verifiability. Projects can store metadata,\nimages, or other bulky content on IPFS and reference the file\nusing its unique hash onchain. To ensure data persistence,\ndevelopers can use services like Pinata or Filecoin to\nmaintain file availability on IPFS.\n• Zero-Knowledge Proof Implementations\nZero-knowledge proofs (ZKPs) enable the verification of\noffchain data without revealing the underlying information.\nFor example, ZKPs can confirm that a user has passed a KYC\ncheck without exposing their personal details. By integrating\nZKP frameworks like zk-SNARKs or zk-STARKS, developers\ncan enhance privacy while maintaining compliance and trust\nin their systems. (e.g. ZK ID19 and zkTLS20 solutions for\nonchain compliance).\n• Layer 2 Scaling Solutions\nLayer 2 solutions such as Optimism, Arbitrum, or zkSync\nprocess transactions and data offchain while periodically\nposting summaries or proofs on the Layer 1 blockchain. This\napproach reduces storage and transaction costs significantly\nwhile retaining the security and trust of the main blockchain.\nFor example, a DeFi protocol can manage user balances and\ninteractions offchain on a Layer 2 network, submitting only\nessential final state updates onchain.\n\n19 ZK Identity: Why and How (Part 1), OxPARC (last visited 03 December)\n20 Oracles vs. Web Proofs: A Comparison, vLayer (23 September 2024)\nTools and Compliance Management\nEfficient data management and compliance tools are vital for\nWeb3 builders to handle data securely, streamline operations,\nand meet regulatory requirements. Developers can enhance\nsystem performance, ensure scalability, and minimise risks by\nleveraging specialised tools for data management,\nmonitoring, and compliance automation. This section\nprovides an overview of key tools and strategies for\ncompliance management in blockchain projects.\n\nData Management Tools\n• Blockchain Indexers and Query Layers\nBlockchain indexers and query layers simplify accessing\nand analysing onchain data. Tools like The Graph,\nEtherscan APIs, and Alchemy Enhanced APIs allow\ndevelopers to efficiently query transaction histories, smart\ncontract states, and logs without interacting directly with\nthe blockchain's raw data. These tools enable real-time\ninsights and significantly reduce the complexity of data\nretrieval, making them essential for analytics, compliance\nreporting, and debugging.\n• Database Compliance Capabilities: Databases must\nsupport data encryption, role-based access control, and\naudit logs to ensure compliance with regulations like\nGDPR or CCPA. Platforms such as Google Cloud SQL\nand AWS offer built-in compliance features.\n• Monitoring and Alerting Systems\nMonitoring and alerting tools ensure blockchain systems\nremain secure and operational. Tools like Prometheus,\nGrafana, and New Relic provide real-time tracking of\nsystem health, resource usage, and anomalies. These\ntools are invaluable for detecting failed transactions,\nexcessive gas usage, or potential breaches. Alerts can be\nconfigured to notify developers immediately when\nirregular patterns are identified, enabling faster resolution\nof critical issues.\n• Compliance Automation\nCompliance often requires periodic reporting of\ntransaction histories, user data usage, and system\nperformance. Automated tools like Chainalysis, Elliptic, or\nBlocknative generate reports for anti-money laundering\n(AML) compliance, tax reporting, and regulatory filings.\nThese systems reduce manual effort and minimise errors,\nensuring timely and accurate submissions.\n31 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own research. For advice\nspecific to your situation, consult a qualified professional.\n• Audit Trail Maintenance\nAudit trails are essential for tracking system changes, user\nactivity, and data interactions. Immutable logs maintained\nthrough blockchain or external systems like Splunk or\nGraylog ensure traceability and accountability. Developers\nshould design systems to log all critical events, such as\nsmart contract upgrades, access attempts, and\nconfiguration changes, to create a comprehensive audit\ntrail for compliance and debugging.\n• Data Access Logging\nData access logging tracks who accessed sensitive data,\nwhen, and for what purpose. This is critical for\nmaintaining user privacy and complying with regulations\nlike GDPR and HIPAA. Logging solutions such as AWS\nCloudTrail or Azure Monitor allow developers to\nimplement robust access logs for offchain storage\nsystems. These tools also support alerting for\nunauthorised access attempts, helping to mitigate risks in\nreal time.\n• Incident Response Procedures\nIncident response procedures outline steps to address\nand resolve security breaches, data loss, or system\nfailures. Developers should integrate automated systems\nto detect anomalies and initiate predefined response\nactions. Tools like PagerDuty or Opsgenie help\ncoordinate responses, while blockchain-specific incident\nresponse frameworks can implement mechanisms like\nsmart contract \"pauses\" to prevent further damage\nduring an exploit. Regular testing and simulation of\nresponse procedures ensure readiness for real-world\nincidents.\n\nPost-Quantum Security and\nTechnical Standards\nAlthough this guide gives an introduction to some of the data\ngovernance and security considerations when building\ncompliance into your product, this is a fast-moving area with\nmany aspects to explore further, including smart contract\nsecurity and also the risks of quantum algorithms.\n\nQuantum, particularly when combined with Al, is a known\nupcoming threat to encryption technology, and it is expected\nthat the encryption landscape could materially change at any\ntime, and certainly by 2035.\n\nThe pace of algorithmic development is increasing, and the\ntimings of technological breakthroughs are unpredictable.\nThis is a present and not just a theoretical issue, and updates\nto the NIST security standards are in progress, due for\npublication in Q4 2024. This is a big and growing area of\nfocus. Effective risk management includes making provision\nfor disaster response and recovery processes in the event of\na brute force attack on your PKI (Public Key Infrastructure).'\nFollow NIST21 and keep a close watch on standards updates\nas a priority for your product security.\n\n54%\nPynes from 8.8.8.8: icmp_seq\nfrom 8.8.8.8: icmp_se\nfrom 8.8.8.8: icmp_seq=\n8.8.8.8: icmp_seq=60\n8.8.8.8: icmp_seq=666\n8.8.8.8: icmp_seq-667\n8.8.8.8: icmp_seq-668 t\n...: icmp_seq-669 ttl\n8.8.8.8: icmp seq-670 ttl=\n8.8.8.8: icmp seq-671 ttl=5\n1.8.8: icmp seq-672 ttl=57\n8.8.8: icmp seq-673 ttl-57 t\nScxp seq-674 ttl=57 tin\nScnpseq-675 ttl=57 time\nSemp seq-676 ttl=57 time-\n18.8.8: cnpseq-679 ttl-57 time-29.5\nScnpseq-677 ttl=57 time-9\nScnpseq-678 ttl-57 time-59.\n50\nPhoto Credit: Lewis Kang'ethe Ngugi (www.unsplash.com)\n21NIST Internal Report 8547 (Initial Public Draft), National Institute of Standards and Technology (November 2024)\namaranth\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 32\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 17,
    "content": "Computable Contracts (Akber Datoo - D2 Legal\nTechnology and Co-Chair, Law Society of England\nand Wales Technology and Law Committee)\nWe are on an inevitable journey towards data-orientated\ncontracts, with a meaningful representation of the written\ncontractual terms in a manner that follows a consistent,\npredictable and structured data format. This paves the way for\nautomation in an increasingly digital world, with a promise of\nbusiness value through smart legal contracts in sight.\nThe format of contracts that best suits human to human\ncommunications requires a radical overhaul if contracts are to\nbe fit for the coming Web3 era.\nOrganisations increasingly operate through processes and\nsystems (both of which may be efficient and organised, or\nnot!) and this reaches its pinnacle in respect of global,\ndecentralised autonomous organisations (DAOS).\nThe role of agreements is to document a commercial\nunderstanding that is important, perhaps because two parties\nhave divergent commercial interests and cannot trust one\nanother. However, smart legal agreements operate in a world\nwhere resource governance can be hardwired into protocols\nand smart contracts, and shared networks provide a trust-\nengine that shifts the role of contracts into something more\nmachine-led. Contracts need to be capable of being split\ndown into clear logical statements so that a smart contract\naction can be triggered, (or at least something sufficiently\nstructured to be capable of being reliably plotted on an Al-\ndriven probabilistic journey towards that binary classification).\nWe often forget that in traditional (analogue) contracts, there\nare many areas of contractual imprecision, such as allowance\nfor reasonableness or contractual discretion. These exist\nintentionally and fulfil a crucial role in traditional contracts,\nbecause parties cannot know at the outset all of the variables\nthat might affect their relationship during its course, and\nrather than precisely drafting for all possible sets of\ncircumstances (which would of course be impracticable and\nuneconomical), the parties set out tramlines to ensure that\ncategories of unexpected happenings are dealt with\naccording to specified processes.\nGlobal information networks present a change to the core\nessence of collaboration, which is that protocols allow\nsufficient sophistication of automaticity that they enable\nstrangers to enter into structured, rule-based arrangements\nwith one another at scale.\nUp to now, this has never been possible because we did not\nhave programmatic assets, or any way of sharing a store of\ninformation that was robust against one party with access\nsimply changing the records. BTC, ETH and other subsequent\nnetwork innovations changed all of that. In this data-powered\nworld, the trade-off for friendly bargaining, gentleman's\nagreements, discretion and contractual comfort-language is\nobjectivity, speed, efficiency, global scale — which equates to\npower.\nThe oft-cited comparison to the industrial revolution rings true:\nsmart contracts and networks bring the same sort of velocity\nand power to transactional processes as did the invention of\nsteam and the combustion engine.\nMuch in the way that the invention of writing powered the\nglobal expansion of not just knowledge, but also collaboration\nand coordination (Yuval Noah Harari - Nexus), so contracts are\nthe lawyer-code that up to now has allowed human-to-human\norganisations and structured collaborations of all kinds to\nproliferate.\nIn the digital future, data will necessarily be the medium\nthrough which contracts are powered. To move from current\npaper and MS Word-based contracts to those which allow for\nthe automation and application of the data elements, meaning\nmust be given to the structured data variables and allowable\nvalues of those variables. Huge advancement in Al technology\nallows humans to glimpse inside the intricate web of smart\ncontracts and aids explainability (if it is correctly configured to\ndo so). Al can sort unstructured data into insights suitable for\ningestion by smart legal agreements, thereby expanding\ninformation networks' access to the universe outside of the\ncode-environment.\nThis is an exciting time for the evolution of the legal profession\ninto a new format that allows forward-thinking lawyers to\ninteract and engage with these powerful ecosystem-based\nnetworks, to evolve the craft of contractual drafting into\nsomething new and tech-enabled. This evolution in human\nability to collaborate is crucially essential if we are to meet the\nchallenges around resource shortage, climatic disruption, war\nand instability of the present era. The role of lawyers is about to\nchange for the better. We can finally focus on solving the\nsocietal and business problems, rather than the legal\ncomponent of such problems.\n33 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nNavigating Legal Architectures: Building your Web3\nProject on Solana in the UK (Marcus Bagnall - Wiggin)\nThe Solana blockchain offers UK developers a high-speed,\nlow-cost platform that's ripe for innovation. Whether you're\ntokenising real-world assets, crafting DeFi protocols,\nlaunching NFT art collections, developing cutting-edge\ngames, building decentralised exchanges (DEX), or creating\nidentity authentication systems, understanding the legal\narchitecture is crucial. By carefully considering your legal\narchitecture, you lay a strong foundation that supports\ninnovation, growth, and compliance.\nThe Web3 legal landscape can seem as complex as the\ntechnology itself. But fear not—this chapter demystifies the\nlegal structures available, tailoring insights specifically for UK-\nbased projects on Solana. We'll explore entity types,\nstructural considerations, project-specific suggestions and\noffer guidance to balance ambition with pragmatism.\nRemember, the right legal structure doesn't just protect you\nfrom pitfalls; it propels your project forward. It's about\ncrafting a framework that aligns with your vision, resonates\nwith your community, and withstands the scrutiny of\nregulators and investors alike.\nChoosing the Right Legal Entity:\nLaying the Foundation\nThe UK's legal system provides a variety of entity types\nsuitable for Web3 projects. Selecting the appropriate one is\nlike choosing the right programming language—each has its\nstrengths and quirks.\nPrivate Limited Company (Ltd) - the developer's favourite\nA Private Limited Company is the go-to choice for many\nstartups, and for good reason:\n• Corporate identity: A Private Limited Company enables\nthe project to enter contracts, own assets, and hire\nemployees under a legally recognised entity. This\nprofessional structure is essential when dealing with\npartners, regulators, or customers. Additionally, Ltd\ncompanies can issue shares to incentivise key personnel\nor reward early contributors.\n• Limited liability: Shareholders' liability is limited to the\ncapital they have invested. This separation of personal\nand corporate assets is essential in Web3, where\nregulatory uncertainty and rapid technological changes\npose inherent risks. If the company fails or faces legal\nchallenges, personal assets of founders and investors\nremain safe.\n• Investor appeal: The Ltd structure is familiar to venture\ncapitalists, angel investors, and institutional backers. It\nprovides governance transparency and clear ownership\nrights, making fundraising more accessible. Shareholders\nbenefit from established legal protections, ensuring their\ninvestments are safeguarded.\nIdeal for: Projects seeking external investment and rapid\nscaling. If you're planning to raise funds, a Ltd company is\noften the smoothest path.\nLimited Liability Partnership (LLP) - collaboration central\nAn LLP combines partnership flexibility with limited liability\nprotection:\n• Flexible profit distribution: Unlike companies, LLPs allow\npartners to determine how profits are distributed,\nregardless of their ownership stake. This is beneficial in\nscenarios where contributions vary significantly—for\nexample, one partner provides capital while another\ncontributes tech skills or business development.\n• Tax transparency: LLPs are tax-transparent entities,\nmeaning profits are taxed as personal income for\npartners rather than at a corporate level. This avoids\ndouble taxation seen in companies, where profits are\ntaxed first as corporate income and then as dividends for\nshareholders.\nCollaborative vibes: LLPs are often used in professional\nservices or collaborative ventures, making them suitable\nfor blockchain developer collectives, consultancies, or\nresearch consortia. Each partner contributes according to\ntheir expertise or resources, fostering a cooperative\nenvironment.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 34\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 18,
    "content": "Ideal for: Teams where members contribute differently but\nwant shared control, like consulting firms, developer\ncollectives, or joint ventures between established entities.\nGeneral Partnership - simplicity with a side of risk\nEasy to set up but comes with unlimited liability:\n• Minimal formalities: Setting up a general partnership is\nquick and requires minimal legal paperwork. Partners can\nbegin operations almost immediately, making it suitable\nfor short-term or exploratory projects.\n• Shared liability: Partners share profits and liabilities\nequally unless otherwise agreed. However, each partner\nis personally liable for all debts and obligations, which\ncan lead to significant personal risk if the venture incurs\nlosses or faces legal claims.\n• Quick exit: General partnerships can be dissolved\nrelatively easily, making them a low-commitment option\nfor temporary ventures.\nIdeal for: Small projects or temporary collaborations with\ntrusted partners, perhaps in the initial exploration or proof-\nof-concept phase of a Web3 idea.\nTrusts - guardians of assets\nTrusts hold assets for beneficiaries:\n• Asset shielding: Trusts can hold tokens, intellectual\nproperty, or other critical assets separate from your\noperational entity. This separation shields assets from\noperational risks, such as litigation or insolvency, ensuring\ntheir availability for beneficiaries.\n• Privacy and control: Trusts can offer anonymity for\nbeneficiaries. Trusts can also be structured to enforce\nspecific governance rules, such as distributing royalties or\nallocating tokens according to specific rules.\n• Complex but effective: Establishing a trust involves some\nlegal complexities, including drafting trust deeds and\nappointing trustees. Managing the trust requires ongoing\noversight, which can be expensive and time-consuming.\nBut for projects with valuable assets, it can be worth it.\nIdeal for: Projects needing to safeguard assets, perhaps in\nNFT or gaming projects where IP rights are paramount or to\nprotect valuable assets in a non-Web3 component of a\nproject.\nTailoring Legal Structures to your\nWeb3 Project\nOne size doesn't fit all in Web3. As Web3 projects are\ndiverse, the legal structure that works for one may be\nunsuitable for another. Each project type has unique\noperational, legal, and regulatory considerations, requiring a\ntailored approach to entity formation, governance, and\ncompliance. Your project's nature influences the optimal legal\nstructure.\nReal-World Assets (RWA) - Tokenising the Tangible\nLegal Challenges: Ensuring token ownership represents\nlegal ownership of the physical asset requires bridging the\ngap between blockchain technology and traditional real and\npersonal property laws. Contracts must explicitly define\nrights, liabilities, and remedies, ensuring enforceability in\nboth digital and physical realms. Regulatory complexities\narise if the asset is fractionalised or tokenised into securities.\nWithout clear legal frameworks, token holders may lack\nenforceable claims to the underlying assets.\nRegulatory Compliance: Depending on the jurisdiction,\ntokenising RWAs may require adherence to property laws,\nsecurities laws, and financial regulations. For example,\nplatforms tokenising real estate need to ensure compliance\nwith land registration requirements in the relevant country.\nFailure to comply with these laws could invalidate token-\nholder rights or expose the project to enforcement actions.\nExample: A Solana-based platform tokenising real estate\ncould use a UK company for development, if the real estate is\nin the UK then the structure could involve relevant UK entities\nholding title to land, and an offshore structure to issue\ntokens, facilitating compliance with requirements under UK\nlaws and offshore crypto regulations.\nDecentralised Finance (DeFi) - navigating regulatory\nrapids\n• Regulatory Scrutiny: DeFi projects often intersect with\nfinancial services regulations related to securities,\nderivatives, lending, or trading. Depending on the\njurisdiction, tokens or activities might fall under complex\nframeworks regarding cryptoasset services, financial\nservices and money laundering regulations. Projects\noperating without regard for these regulations face\nsignificant enforcement risks and reputational damage.\n35 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n• Compliance Programs: Implement robust KYC/AML\npolicies and transaction monitoring, even in unregulated\nenvironments. This not only builds trust with users but\nprepares the project for potential future regulatory shifts.\nEarly adoption of compliance measures positions the\nproject as trustworthy and resilient to regulatory\nevolution.\nExample: A UK-based team develops a lending protocol on\nSolana. Governance tokens are issued by an offshore entity,\nnavigating favourable regulatory conditions while keeping\ndevelopment operations separate.\nNon-Fungible Tokens (NFTs) and Gaming - protecting\ncreativity and play\n• IP Rights: Intellectual property ownership is critical in NFT\nand gaming projects. Ambiguities in IP rights can lead to\ndisputes, eroding user and creator trust. Agreements\nmust clarify the ownership of digital art, in-game assets,\nand user-generated content. Smart contracts can\nautomate royalty payments but must align with applicable\nlaws.\n• Consumer Protection Laws: Digital goods and services,\nsuch as in-game purchases or NFT sales, are subject to\nconsumer protection laws. Platforms must ensure\ntransparent pricing, refund policies, and compliance with\nconsumer protection regulations. Non-compliance risks\nreputational damage and enforcement actions.\nExample: An NFT marketplace ensures artists retain rights\nthrough smart contracts and legal agreements. A UK\ncompany manages the platform, enforcing IP rights and\nensuring compliance with UK consumer laws.\nDecentralised Infrastructure - building the backbone\n• Operational Considerations: Decentralised infrastructure\nprojects, such as those focusing on storage or compute,\ninvolve network participants who may operate globally.\nClear legal frameworks must govern participant\nrelationships and data usage. Without these frameworks,\ndisputes between network participants could disrupt\noperations.\n• Token Economics: Projects must ensure compliance with\nlaws governing utility tokens versus securities.\nMisclassifying a utility token could lead to enforcement\nactions, fines, or investor claims. Proper classification\nprotects the project from regulatory risks.\nExample: A decentralised storage network on Solana uses a\nUK company to develop software, while tokens are issued by\nan offshore foundation to support network decentralisation.\nLocation, Location, Location: Team\nand Market Considerations\nWhere your team operates from, and the market you're\ntargeting, can significantly influence the legal and\noperational architecture of your Web3 project. Each of these\nfactors comes with specific legal and practical considerations\nthat affect compliance, tax efficiency, and operational\nviability.\nTeam Location - The Heartbeat of Your Project\n• Employment Laws: UK employment contracts must\nadhere to statutory requirements, including working\nhours, minimum wage, holiday entitlements, and statutory\nbenefits like sick pay. Misclassifying employees as\ncontractors to avoid these obligations can result in\npenalties, lawsuits, or reputational damage.\nComprehensive contracts with clear terms of\nengagement and IP assignment clauses are essential to\nprotect both the company and employees. Non-\ncompliance with employment laws can disrupt operations\nand lead to costly legal disputes.\n• Tax Residency: Corporate tax residency is typically\ndetermined by the location of the company's central\nmanagement and control. Regular board meetings held\nin the UK, with directors making key decisions locally, can\nestablish UK tax residency. However, if critical decisions\nare made elsewhere, it could shift tax residency to that\njurisdiction, creating dual taxation risks. Ensuring clarity\nabout where the company is liable for corporate tax and\nhelp avoid unexpected tax bills.\n• Global Teams: A distributed team introduces operational\ncomplexity, including compliance with diverse local\nemployment laws, handling cross-border payments, and\nnavigating tax liabilities for remote workers. Time zone\ndifferences and language barriers can also affect\nproductivity and team cohesion. Employer-of-record\nservices or local entities can simplify compliance with\nforeign employment regulations.\nTip: Efficiently managing a global workforce reduces\nadministrative burdens and ensures compliance with local\nlaws. For globally distributed teams, consider setting up\nentities in key jurisdictions or using employer-of-record\nservices to manage payroll and compliance. Be mindful of\nthe costs and administrative overhead involved.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 36\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 19,
    "content": "The Paper Trail: Essential\nDocuments\nSetting up your project isn't just about code—it's about\ncontracts.\n\nPre-incorporation Documents - laying the groundwork\n\nFounders’ Agreement: This document establishes clarity\namong the founding team. It outlines the roles,\nresponsibilities, equity splits, and IP assignments among the\nfounding team. It’s crucial to establish expectations and\nprevent disputes. It also addresses what happens if a\nfounder exits or fails to meet their obligations. Key clauses\ninclude decision-making processes, vesting schedules for\nequity, and dispute resolution mechanisms.\n\nNon-Disclosure Agreements (NDAs): NDAs safeguard\nsensitive information shared during early-stage discussions.\nProtects sensitive information during discussions with\npotential partners, investors, or team members before formal\nagreements are in place. It should specify what information is\nconsidered confidential, the duration of the confidentiality\nobligation, and remedies for breaches.\n\nCorporate Governance Documents - steering the ship\n\nArticles of Association: A foundational document that sets\nout the rules for running the company. It defines the rules for\ndecision-making, share issuance, and director powers.\nCustomisation is essential for Web3 projects to address\nunique governance needs, such as token voting rights or\nalternative dispute resolution mechanisms.\n\nShareholders’ Agreement: This agreement supplements the\nArticles by defining the rights and obligations of\nshareholders. It covers areas like decision-making authority,\nminority protections, exit strategies, and how disputes\nbetween shareholders are resolved. It protects investors’ and\nfounders’ interests, especially as the company grows and you\nbring on external parties and investors.\n\nEmployment and Contractor Agreements - building the\nteam\n\nDirector Service Agreements: These agreements formalise\nthe relationship between the company and its directors. They\ndetail roles, responsibilities, confidentiality, and remuneration,\nincluding equity or token allocations. Clauses may also\naddress conflicts of interest and termination procedures.\n\nEmployment Contracts: For staff based in the UK, these\ncontracts must comply with employment laws, including\nminimum wage, leave entitlements, and dismissal rights. They\nshould also include IP assignment clauses, ensuring any work\nproduct created by employees belongs to the company.\n\nContractor Agreements: Clearly defined agreements with\ncontractors are essential, especially in global Web3 teams.\nThese documents specify the scope of work, deliverables,\npayment terms, and ownership of any IP created. They\nshould also address the contractor’s status as an\nindependent entity to avoid misclassification.\n\nIntellectual Property Documents - protecting your\ncreations\n\nIP Assignment Agreements: These agreements transfer\nownership of intellectual property created by founders,\nemployees, or contractors to the company. Without this, the\ncompany might not legally own key assets, which could deter\ninvestors or lead to disputes.\n\nTrademark Registrations: Protects your brand name, logo,\nand other identifiers from being used by others diluting your\nbrand or creating confusion in the market. In Web3, this is\nparticularly important for project names, platforms, and token\nbranding.\n\nPatent Applications: If your project involves novel technical\nsolutions (e.g., unique consensus algorithms or cryptographic\nmethods), filing patents can provide exclusive rights and give\nyou a competitive edge. The application process can be\nlengthy and complex, requiring thorough documentation.\n\nCommercial Agreements - engaging with the world\n\nTerms of Service and Privacy Policies: Essential for any\nplatform interacting with users to protects the company from\nuser disputes and ensure compliance with legal\nrequirements. Terms of Service define user rights and\nobligations, while Privacy Policies ensure compliance with\ndata protection laws like GDPR. These documents should\naddress liability limitations, user data usage, and dispute\nresolution.\n\nLicensing Agreements: These agreements are critical if your\nproject involves licensing IP, such as that required for\nsoftware. It can be used to generate revenue streams and\nprevent misuse of your IP or software. They specify the terms\nof use, royalties, and restrictions on sublicensing or\nmodifications.\n\nPartnership Agreements: Collaboration with other projects\nor entities requires clearly defined partnership terms to\nensure all parties have a shared understanding of the\ncollaboration and mitigates risks of disputes. These\nagreements typically cover roles, revenue-sharing, joint IP\nownership, and exit strategies.\n\nIntercompany Agreements - connecting the dots\n\nService Agreements: Define the services provided between\nentities, such as a UK DevCo providing development or\noperational support to an offshore foundation. These\nagreements should include fee structures, performance\nmetrics, and dispute resolution mechanisms. These are\ncritical to establishing clear roles and ensuring intercompany\ntransactions meet regulatory and tax requirements.\n\nIP Licensing Agreements: Define the services provided\nbetween entities, such as a UK DevCo providing\ndevelopment or operational support to an offshore\nfoundation. These agreements should include fee structures,\nperformance metrics, and dispute resolution mechanisms.\n\nPractical Guidance and\nRecommendations\n\nBuilding on Solana in the UK is an adventure worth\nembarking on, but with an eye on the legal compass.\n\n1. Start simple, think big - lean structures with growth\npotential\nBegin with a straightforward UK Ltd company to minimise\ncosts and administrative burdens. This structure is well-\nunderstood, easy to set up, and suitable for early-stage\nprojects focusing on development. As your project grows,\nyou can consider adding offshore entities or more complex\nstructures to address specific needs like token issuance or\ninternational expansion.\nTip: Avoid overcomplicating your structure at the outset.\nComplexity adds costs and can divert attention from building\nyour product.\n\n2. Protect your intellectual property - safeguard your\ncreations\nEnsure all IP created by founders, employees, and\ncontractors is owned by the company with clear IP\nassignment agreements. Register trademarks and consider\npatents if applicable. Protecting your IP not only secures your\ncompetitive advantage but also enhances your project’s\nvaluation in the eyes of investors.\nTip: Regularly audit your IP assets and ensure that all\nnecessary protections, registrations and renewals are up to\ndate.\n\n3. Engage early with professionals - invest in expertise\nConsult legal professionals experienced in blockchain and\ncrypto to receive tailored advice. Similarly, consult\naccountants and tax advisors to optimise your structure for\ntax efficiency and compliance. These experts can help you\nnavigate regulatory changes, draft robust contracts, and\nprevent costly mistakes.\nTip: Consider joining industry groups or networks where you\ncan access shared resources and recommendations for\ntrusted advisors.\n\n4. Stay informed and adaptive - the only constant is change\nThe Web3 legal landscape is evolving rapidly. Keep abreast\nof developments in regulations, best practices, and industry\nstandards. Participate in industry events, webinars, and\nforums. Engage with the broader Solana and Web3\ncommunities to stay connected and informed.\nTip: Assign someone on your team to monitor regulatory\nupdates and assess their impact on your project.\n\n5. Budget wisely - plan for the road ahead\nCreate a realistic budget that accounts for legal and\ncompliance costs. While it’s tempting to minimise expenses,\nskimping on legal matters can lead to greater costs down the\nline. Balance the need for compliance with your resource\nconstraints. Prioritise essential legal work and consider\nphased approaches to implementing more complex\nstructures.\nTip: Explore grant programs, accelerators, or incubators that\nmay offer legal support as part of their services.\n\n6. Embrace transparency - build trust through openness\nOperate with transparency in your governance, tokenomics,\nand compliance efforts. This builds trust with users, investors,\nand regulators. Publish clear terms of service, privacy\npolicies, and disclaimers. Be upfront about risks and how\nyou’re addressing them.\nTip: Consider open-sourcing parts of your codebase to foster\ncommunity engagement and demonstrate commitment to\nthe Web3 ethos.\n\n7. Leverage the Solana ecosystem - strength in community\nThe Solana ecosystem offers resources, partnerships, and\nsupport. Engage with Solana-focused developer groups,\nforums, and events. Collaborate with other projects to share\nknowledge and potentially pool resources for common legal\nchallenges\n\n37 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 38\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 20,
    "content": "Decentralised Autonomous Organisations\n(Professor Sarah Green - D2 Legal Technology)\nA Decentralised Autonomous Organisation (DAO) is an entity or organisation represented by rules encoded as a computer\nprogram, typically on a blockchain. Unlike traditional organisations, DAOs operate without centralised leadership, relying\ninstead on smart contracts and collective decision-making.\n\nKey Characteristics\nDecentralisation: No central authority;\ndecision-making is distributed.\nTransparency: Transactions and decisions\nare recorded on a blockchain, visible to all\nmembers.\nGovernance\nDAOs facilitate a communal approach to governance, in\ncontrast to conventional arrangements that rely on a\ncentralised authority or management team. This means of\ndecision-making is often conducted by the distribution of\ngovernance tokens. These tokens can be issued in fungible\nor non-fungible form and have the effect of granting voting\npowers or rights to those who hold them. In turn, governance\nsmart contracts provide a means by which those members of\na DAO who hold the governance tokens in question can\npropose and vote on operational and architectural decisions.\nSimilar governance smart contracts can also be set up in\norder to make treasury decisions, to manage the issuance,\ndistribution and buyback of tokens (where applicable), and to\nregister new members.\n\nAutonomy: Operates based on smart\ncontracts, executing actions automatically\nwhen conditions are met.\nCommunity Governance: Members vote\non proposals and decisions using\ngovernance tokens.\nWhilst decentralised decision-making can be highly\nbeneficial in meeting the objectives, and matching the ethos,\nof organisations and their founders, it comes with potential\ndrawbacks, all of which should be borne in mind at the\noutset. For instance, token-based governance of the sort\ndescribed above might mean that the making of decisions is\nslower and less efficient than in a traditional organisation,\n\nin which decision-making is more concentrated, or has a\nsingle point of focus. Particularly in the early days of a DAO's\nexistence, during its set up phase, when there are many\ndecisions to make, decision-making may be limited to a small\ngroup before rights are distributed over time in what\nbecomes, effectively, \"progressive decentralisation.\" An\ninherent risk of a structure of this kind is of course the\npotential for the concentration of power in any individual who\nretains or accumulates large numbers of tokens with\ncorresponding voting power. If truly decentralised decision-\nmaking power is to be achieved or retained, significant\nthought should be given as to how best to guard against this\nsort of concentration of voting power.\n\nIn Legal Terms, what is a DAO?\nIt is important to recognise that, as a matter of English law,\nthere is no discrete legal concept of a DAO. As a\nconsequence, there exist important questions about the\nproper legal characterisation of any particular DAO, and,\nconsequently, the relationships between various participants\nin such arrangements. This means that there is less certainty\nabout the content of members' legal rights and obligations\nthan there would be in a conventional entity that has a\nrecognised legal form. One option, however, is for a DAO to\nadopt traditional, legally-recognised organisational\nstructures, such as a limited company, a partnership model,\nan offshore trust or foundation. It is also possible to adopt a\nDAO-specific legal entity (which have recently been\nintroduced in some jurisdictions), or a combination of several\nof these options. The entity chosen could either be co-\nextensive with the DAO, or alternatively used only for a\nspecific function, such as to employ developers, or to hold\noff chain property. This is known as \"wrapping\". It is crucial\nto note, however, that if the DAO is only partially \"wrapped\"\nin a legal entity, this might give rise to questions about the\nnature of the relationship between the legal entity and the\nnon-wrapped part of the DAO, and about the legal\ncharacterisation of the elements that do not form part of, or\ncome under, the wrapper. Where a legal entity has been\nadopted in any capacity, the legal entity or entities in\nquestion will be subject to the usual legal, tax and regulatory\nrequirements of the jurisdiction in which they are set up.\n\nWhere a DAO has taken no active steps to set up a legal\nentity; that is, and/or where no thought has been given to the\nmembers' collective legal status, any legal intervention that is\nrequired will need to start by working out retrospectively what\nthe legal status of the arrangement is.\n\nThis can be a difficult (and therefore costly) exercise,\nespecially if the DAO does not fit easily within existing\nstructures that can arise as a matter of law, such as general\npartnerships or unincorporated associations. What a\nparticular DAO is from a legal perspective will determine\nmuch about the way it is treated by the law, including the\nrules for its operation, the liability of its participants, and how\nit can interact with the real world concepts of contracts,\nproperty, and tax. DAOs that have taken active steps to\ninclude a recognised legal entity within their structure are\ntherefore very different from those that have not. Wrapped\nDAOs therefore arguably have a greater ability to transact in\nthe \"real world\" and to do so in a way that allows their\nmembers to predict the consequences of those transactions.\nIt may be necessary, for instance, to characterise the legal\nrelationship between various actors within a DAO to\ndetermine who is liable if something goes wrong.\n\nWhat happens, for example, when actions by or on behalf of\nthe DAO give rise to liability in tort (such as negligence), or if\nthere are any regulatory breaches or criminal conduct? If and\nwhen this happens, the law will need to establish who or\nwhat is responsible for the actions of the DAO. Such an\nanalysis could conclude that all or certain participants within\na DAO are part of a general partnership or unincorporated\nassociation, or alternatively to have a contractual or agency\nrelationship with other parties. This could mean that\nindividual participants have personal liability for the actions of\nthe DAO. For example, in a general partnership, all partners\nare jointly liable for the debts and obligations of the\npartnership. If, however, a DAO has used as a wrapper a\nformal legal entity such as a company with a \"legal\npersonality\" separate from that of its participants, the\nanswers to the questions posed here are likely to be more\nstraightforward because the DAO itself will shoulder much of\nthe burden since, as a legal person, it can hold property,\nenter into contracts and sue and be sued in its own name.\n\nPractical Steps to set up and use a DAO\n1. Define the Purpose of your particular DAO\nDetermine what you want to achieve with the DAO (e.g.,\nfunding, governance, development).\n\n2. Choose the Blockchain Platform\nFactors to consider:\nHigh-speed transactions?\nMature ecosystem with numerous DAO tools?\nLower transaction costs?\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n39\n40\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nContract\nHefa y\n"
  },
  {
    "page": 21,
    "content": "3. Develop Smart Contracts\nUse frameworks like OpenZeppelin or platforms like Aragon,\nDAOstack, or Snapshot to create and deploy smart\ncontracts.\n4. Distribute Governance Tokens\nDecide how tokens will be distributed:\nInitial offering (e.g., ICO, airdrop).\nPerformance-based rewards.\n5. Engage Your Community\nBuild and grow a community of contributors.\nUse platforms like Discord and X for communication.\n6. Launch and Govern\nOpen the DAO for proposals and voting.\nAllow the community to participate in decision-making and\nresource allocation.\nSmart contracts can have vulnerabilities. Conduct audits\nregularly.\nExploring Offshore Jurisdictions: Things to think\nabout (Sara Hall - Walkers)\nMany businesses use offshore vehicles as part of their overall\nstructure, such as Kraken, Coinbase and Bitfinex, and many\ncommunity led projects have successfully developed a\nthriving ecosystem using one or more offshore vehicles.\nMaker DAO, Aave, Arbitrum and Worldcoin are well known\nglobal examples but there are hundreds more.\n\nThe principal reason to consider choosing offshore is\nbecause many activities which would be regulated in an\nonshore jurisdiction - such as token issuance or the\noperation of a fully decentralised DEX - are either outside the\nscope of regulation or lightly regulated in several of the\noffshore jurisdictions. In addition, several of the offshore\njurisdictions have a government policy of actively supporting\ndigital asset businesses and are able to shape their laws\nrelatively quickly as technology develops. There are also\nskilled service providers who are passionate about Web3\nsuch as directors, lawyers, accountants, and governance\nexperts who can support the smooth running of the\necosystem. And there are specific kinds of companies which\nlend themselves to Web3 businesses governed by DAOs\nsuch as the Cayman foundation or the British Virgin Islands\n(BVI) company limited by guarantee.\n\nBefore following the well-trodden path of setting up a\nCayman foundation, with a BVI token issuer, however, it's\nimportant to consider some \"up front\" factors and to take tax\nand regulatory advice as a first step. One of the first things to\nconsider is where the people who are making strategic\ndecisions will be based. This is because onshore activity such\nas onshore board meetings may inadvertently cause the\noperations to be \"on-shored\" - thus defeating the purpose\nof setting up offshore. It's also important to consider budget\nand which particular jurisdiction might work best from a cost/\nbenefit perspective.\n\nA Cayman foundation is often seen as the most prestigious of\nthe foundation companies offshore. Setting up and running a\nCayman foundation therefore comes at a cost which many\nnew start-ups and scale-ups are not immediately able to\nmeet. A jurisdiction such as the BVI which has lower costs\nmight be a good alternative.\nFounders should be aware that a handful of activities if\nconducted by an offshore entity for profit may require the\nentity to have adequate \"economic substance\" in the specific\njurisdiction where the profits are generated (though the\nalternative is to make the entity tax resident onshore). Before\nexecuting on a proposal, it is therefore important to take legal\nadvice on all aspects of the project, including the proposed\nincome generating elements, to ensure there are no\nshowstoppers or additional unexpected costs.\n\nIt's also important to consider if and how the founders (and\ninvestors) are going to earn revenues from the overall project.\nMany offshore ecosystems will be the brainchild of one or\nmore talented developers who have set up their own\ncompany. It is this company that often sells services to the\noffshore ecosystem, and profits can be earned by founders\nand investors in the form of dividends. Finally, the offshore\necosystem will always be accessed by people onshore - and\nso every project will need to budget for assessing whether its\ninteractions with onshore users are going to be restricted by\nonshore regulation (and if so, how to achieve compliance).\n\nPhoto Credit: Pietro Jeng (www.unsplash.com)\nPhoto Credit: Vladislav Klapin (www.unsplash.com)\n41 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 42\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 22,
    "content": "DAO Legal and Tax Standards (Joni Pirovich - Regulatory Interoperability Lead, DAOstar (a project of The Metagovernance Project, Inc)\n\nAs worldwide regulations about DAOs evolve, and without standardisation of key information about DAOs and our interactions with DAOs or blockchains, the industry cannot easily interoperate with traditional means of legal and tax reporting.\n\nDAOstar is the standards body for DAOs, with over 80 of the world's largest DAOs and DAO tooling providers, and was convened with the spirit of maturation through data standardisation.\n\nDAOstar's standards, DAOIPs - or DAO Improvement Proposals - are available here: https://github.com/metagov/daostar/tree/main/DAOIPs\n\nA DAOIP is a design document providing information to the DAO ecosystem, or describing a new feature for DAOs or their processes or environment. Each DAOIP author is responsible for building consensus within the community and documenting dissenting opinions.\n\nDAOs should firstly have regard to DAOIP-2 which describes the key data fields about a DAO that should be displayed by a DAO: https://github.com/metagov/daostar/blob/main/DAOIPs/daoip-2.md. Compliance with DAOIP-2 would be similar to sharing basic information with the registrar of limited liability companies in a jurisdiction, so that the entity information can be easily searched by the public.\n\nDAOIP-8 sets out the recommended security data fields that a DAO should present to the public, and can be found here: https://github.com/metagov/daostar/blob/main/DAOIPs/daoip-8.md.\n\nDAOIP-9 focusses on a DAO's legal communications. The goal of DAOIP-9 is to define a clear and easy method for communicating legal information to and from online communities—whether a DAO or other form of entity—that may or may not be recognised as legal or tax persons but that do have an onchain presence. DAOIP-9: Legal Communications: https://github.com/metagov/daostar/blob/main/DAOIPs/daoip-9.md\n\nFinally, DAOIP-10 is about the presentation of tax information by DAOs, and is modelled from the OECD's Crypto-Asset Reporting Framework with modifications for the idiosyncrasies of DAOS. DAOIP-10 is awaiting publication, at the time of writing this report.\n\nPhoto Credit: Tingey Injury (www.unsplash.com)\n\n43 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\n\nPhoto Credit: Hansjörg Keller (www.unsplash.com)\n45\n"
  },
  {
    "page": 23,
    "content": "45\nWeb3 Games\n(Omri Bouton - Outlier Ventures)\nTOKEN\nTYPOLOGIES\n02\nThe convergence of video games and blockchain technology\nhas now been hailed for some time as one of the most\npromising areas of Web3 convergence – one that has the\npotential to bring more people into Web3 and help the\nindustry achieve the growth and scale it has been striving for.\n\nIn this guide, the term Web3 games covers a broad range of\nimplementations, such as: i) fully onchain games, where the\ngame logic runs entirely on the blockchain; and ii) games that\nintegrate cryptoassets to a lesser degree (for example, NFTs\nfor in-game assets).\n\nWeb3 games bring unique regulatory challenges that are\noften overlooked. Many developers focus on compliance with\nfinancial services and anti-money laundering (AML) laws –\nand rightly so – but there is more to consider.\n\nFor example, if you plan to issue tokens or NFTs before\nlaunching the game to raise funds, and/or if your game\nallows for the in-game trading of cryptoassets (including\nNFTs), then your game will likely fall under the scope of anti-\nmoney laundering regulation (for more, please see “Setting\nup for Success — Risk Mitigation” and “Token Launch”\nelsewhere in this guide).\n\nConversely, if users can buy “qualifying cryptoassets” through\nyour game, then that would likely be deemed as an invitation\nor inducement to engage in investment activity under the\nFinancial Promotions regime (for more, please see the section\non financial promotions elsewhere in this guide).\n\nIn addition to the considerations outlined above, one unique\nregulatory challenge arising from the convergence of\nblockchain and gaming is gambling regulation – which forms\nthe focus of this chapter, as other regulatory topics are\nalready addressed in separate sections.\n\nBefore we delve further into the different types of gambling\nactivities, it is important to highlight two key aspects of\ngambling regulation: its extra-territorial scope and the lack of\nharmonisation across jurisdictions.\n\nFirstly, UK gambling regulation applies extra-territorially. This\nmeans that even if your business is not based in the UK,\noffering a game that falls within the scope of the UK\nGambling Act to UK players will subject you to its\nrequirements. Secondly, holding a gambling licence from a\njurisdiction outside the UK does not grant you the right to\noffer gambling activities to UK players. Each jurisdiction\noperates independently, and a licence issued elsewhere is\nnot recognised as valid for activities within the UK.\n\nIntro to Gambling Regulation\nIn the UK, offering ‘gambling facilities’ without a licence from\nthe Gambling Commission (the competent authority) is\nillegal. Breaching this law can lead to fines, imprisonment, or\nboth.\n\nUnder the UK Gambling Act 2005 (“Gambling Act”),\ngambling is defined as:\n•\tGaming;\n•\tBetting; and\n•\tLotteries.\n\nHowever, securing a gambling licence is difficult, expensive,\nand often doesn’t align with the goal of Web3 game\ndevelopers. Therefore, it’s critical to know whether your\ngame might be considered gambling so you can adjust its\ndesign to avoid this classification.\n\nWith that in mind, let’s look at the main gambling activities.\n\nGaming\nGaming is likely the most relevant gambling activity for Web3\ngames. Therefore, we have spent some more time breaking\ndown the definition so as to try and provide as much\nguidance as possible.\n\nGaming is defined as “playing a game of chance for a prize”\n– here is what this means:\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 46\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 24,
    "content": "Playing\nThe Gambling Act explains that a person is considered to be 'playing' a game of chance simply by participating in the game, regardless of whether they are playing alone or with others.\nImportantly, the law doesn't require players to pay or risk something of value to bring the game under gambling laws. A free game with a prize can still qualify.\nGame of chance\nA \"game of chance\" is broadly defined, and includes games that combine elements of both chance and skill, games where chance can theoretically be eliminated through exceptional skill, and even games that are simply presented as involving an element of chance.\nIn my experience, this is one area founders may accidentally get wrong, because the definition of \"game of chance\" is intentionally broad, and not limited to games that are wholly based on chance.\nFor example, if your game includes randomised item drops (like in Mario Kart) or unpredictable challenges, it's likely a game of chance. On the other hand, if the game is purely skill-based, where the better player always wins, it's more likely to fall outside the meaning of \"game of chance\" and be deemed as a \"game of skills\".\nIn essence, if a skilled player doesn't always achieve better results than an unskilled one, your game likely involves chance.\nPrize\nA \"prize\" under the Gambling Act is defined as \"money or money's worth\" - essentially, something capable of having monetary value.\nIn traditional video games, in-game items are typically confined within the game environment and cannot be freely traded or sold. This is further reinforced by End User Licence Agreements (EULAs), the contracts between game providers and players, which often prohibit users from selling their accounts or monetising in-game assets. Therefore, in traditional video games, in-game items and currencies are unlikely to qualify as something capable of having monetary value (or a \"prize\"), because players are generally unable to extract these 'assets' from the game and trade them for money.\nThe Gambling Commission confirmed this view in relation to loot boxes, stating that:\n\"Where in-game items obtained via loot boxes are confined for use within the game and cannot be cashed out, it is unlikely to be caught as a licensable gambling activity.\"\nHowever, Web3 games often integrate cryptoassets-such as fungible tokens used as in-game currencies, non-fungible tokens (NFTs) representing in-game assets, or other blockchain-based items-which are inherently transferable.\nWhile developers could theoretically design non-transferable cryptoassets (for example, 'soulbound' tokens), this would go against one of the main premises of Web3 games: the ability for players to truly own their in-game assets and use or trade them freely outside the game environment.\nUnlike traditional in-game assets, Web3 assets built on blockchain infrastructure are inherently more likely to be classified as a \"prize\" under the Act. As a result, if a Web3 game includes elements of chance, it is likely to fall within the scope of the Gambling Act.\nTherefore, if your game incorporates cryptoassets, ensure that the mechanics for awarding prizes are entirely skill- based and devoid of any elements of chance.\nBetting\nBetting is defined as placing or accepting a wager on the outcome of an uncertain event, the likelihood of something occurring or not, or whether a specific statement is true. In essence, any situation where a player risks something of value on an uncertain outcome is likely to qualify as betting. In the context of Web3 games, cryptoassets-due to their inherent value-can be considered a wager under this definition.\nThis concept extends beyond traditional betting and is especially relevant to Web3 fantasy sports games. These games often involve prediction-based mechanics, such as forecasting which teams or players will perform best in real- world competitions, with point systems or rewards tied to these predictions.\nIf you are developing a Web3 fantasy game, such as a fantasy football platform, it is crucial to evaluate whether the game could fall under the definition of betting, and you will likely need to adjust the game's design to avoid regulatory pitfalls (for more, please see the Prize Competitions section below).\n47 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nLotteries\nLotteries are defined as arrangements where participants pay to enter, and prizes are awarded entirely by chance. A key feature of lotteries is the combination of a payment-to-enter mechanism and randomised prize distribution.\nIn the context of Web3 games, requiring players to hold a specific NFT to participate is likely to be regarded as a form of payment, given that NFTs are typically purchased. Furthermore, as with gaming, cryptoassets-such as tokens or NFTs-are likely to qualify as prizes due to their inherent monetary value.\nSome mechanics and features that could be classified as lotteries include:\n• Lootboxes: Where cryptoassets (e.g., tokens or NFTs) are awarded randomly through the opening of lootboxes.\n• Randomised Prizes: Mechanics where players pay (e.g., in cryptocurrency) to spin a wheel for prizes, or where prizes are distributed based on chance within gameplay, such as randomised drops from defeating enemies or items scattered randomly on a game map.\n• Token Staking with Randomised Rewards: Where players stake tokens and receive rewards distributed on a randomised basis.\nTherefore, if you plan to include any of these mechanics, or any feature where prizes are allocated by chance and participation involves payment, it is essential to recognise that it will likely qualify as a lottery. Offering such features without proper authorisation could result in a breach of the Gambling Act. Therefore, you will need to make adjustments to the design of the 'game' and to how you offer it to avoid that (please see the Free Draws section below).\nOut of Scope: Free Draws & Prize Competitions\nUnlike the activities discussed earlier, Free Draws and Prize Competitions fall outside the scope of the Gambling Act and can therefore be offered without the need for a licence.\nHowever, it is crucial to ensure that your offering aligns with the legal definitions of Free Draws or Prize Competitions (which are purposefully narrow) to avoid unintentionally falling under the Gambling Act.\n22 Free Draws and Prize Competitions, Gambling Commission (23 October 2024)\nFree Draws\nA free draw is a type of promotional activity where participants are not required to pay to enter.\nThere are two types of free draws:\n• Entirely Free Entry: where all entries must be free of charge (keeping in mind that requiring holding an NFT to participate will likely not qualify as a 'free entry').\n• Paid and Free Entry Routes: where there is both a paid and a free entry option. However, if you include a paid entry route, you must ensure that:\n    • Participants can choose to enter without paying.\n    • The free entry route is no more expensive and no less convenient than the paid route (effectively, you cannot provide preferential or faster entry methods for paid participants while requiring free entrants to go through a more time-consuming or complicated process).\n    • The free entry route is prominently displayed and promoted at the same level as the paid route.\n    • The choice between free and paid routes is clearly communicated to participants.\n    • The system used to allocate prizes treats entries from both routes equally, without favouring one over the other.\nPrize Competitions\nA prize competition is an activity where the outcome depends entirely on participants' skill, judgement, or knowledge.\nTo qualify as a prize competition, the skill, judgement, or knowledge required must:\n• be sufficiently challenging to deter a significant number of people from entering; and\n• prevent a proportion of participants from winning a prize.\nSimple multiple-choice questions or questions that allow a second attempt rarely meet this standard, as they are not deemed challenging enough. 22\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 48 advice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 25,
    "content": "Design With Regulation in Mind\n\nThe last thing you want is to invest significant resources—time, money, and effort—into developing a project, only to later discover that it cannot be legally offered. To avoid this, it’s essential to consider gambling regulations early in the development process and design your game to steer clear of activities that may fall within the definition of gambling. Prioritising skill-based mechanics, where applicable, can be an effective way to achieve this.\n\nCarefully evaluate your project to identify any design elements that could bring it under the scope of gambling regulation.\n\nTo get started, ask yourself the following key questions:\n\nDoes entry to the game require payment?\n(Remember that requiring players to hold an NFT could be regarded as a form of payment.)\n\nAre rewards distributed based on chance?\n(Randomised rewards or prize allocations are highly likely to fall under gambling regulations.)\n\nWhat determines the outcome of the game loop?\n(Is the outcome entirely skill-based, or does it involve an element of chance? For example, if the game loop is repeated multiple times, would the outcome vary due to chance?)\nPlease keep in mind that this is only a starting point to help you identify game elements that might increase the likelihood of your project falling within the scope of gambling regulations.\n\nUltimately, consulting a lawyer who specialises in this area is the most reliable course of action. While this might feel burdensome—especially when you’re juggling multiple challenges in your project—it is a critical investment, particularly in today’s regulatory climate.\n\nFor instance, Sorare, one of the most prominent Web3 games, is currently facing legal action from the Gambling Commission. This highlights the increasing scrutiny on Web3 games and underscores the importance for businesses operating in the UK, or offering games to UK users, to either ensure they fall outside the scope of the Gambling Act or fully comply with its requirements.\n\nA Practical Tip\n\nResist the temptation to rely on financial incentives to drive engagement. Based on my experience, projects that focus heavily on financial rewards tend to attract speculators and traders rather than genuine players. These communities often abandon the project when the tokenomics falter, leaving the ecosystem unsustainable.\n\nInstead, prioritise creating a game that offers a genuinely enjoyable and engaging experience. Players who are drawn in by great gameplay are far more likely to stay loyal. If your game includes cryptoassets (tokens, NFTs, or otherwise), limit their distribution to skill-based mechanics to align with this approach. By focusing on fun and skill-based design, you can build a sustainable and dedicated player community — and as always, please consult a lawyer!\nPhoto Credit: Giammarco Boscaro (www.unsplash.com)\n\n49 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\n\nSocialFi: Boosting Organic User Growth with SocialFi\n(Ian Cox-CEO and Founder, Avark Agency / Manchester\nBlockchain Alliance)\n\nSocialFi has become the latest buzzword in Web3, with many brands and products incorporating it into their strategies. At its core, SocialFi focuses on creating engaging, reward-driven experiences that overcome the design limitations of traditional Web2 apps and social media platforms. By integrating SocialFi, communities are incentivised to interact with an app or platform, produce content about the product and community experiences, and boost the ecosystem’s reach through organic word-of-mouth.\n\nNo Project in Web3 will succeed without a Solid User Base\n\nCommunity building lies at the heart of success, serving as a dependable way to expand the user base and enhance user acquisition. By launching gamified SocialFi campaigns that motivate users to engage and share publicly, brands can lay the groundwork for future success. This strategy generates buzz and momentum while establishing a sustainable foundation to support the ecosystem and fuel ongoing product development.\n\nGreat SocialFi campaigns don’t happen by chance. Success requires a careful balance of strategy, visual design, and storytelling. A well-defined strategy ensures campaigns resonate with the target audience, while exceptional design makes the experience intuitive and visually engaging. Meanwhile, strong storytelling gives campaigns emotional depth, making them relatable and inspiring users to connect with the brand on a deeper level. Together, these elements help create a campaign that captivates users and fosters loyalty.\n\nTurn User Interaction into Valuable Insights...\n\nThe platform’s flow is typically designed to be simple, making it easy for users to get involved. However, the challenge lies in maintaining engagement. Delivering a sense of accomplishment and creating a feedback loop that motivates users to return and share the platform is critical. Ultimately, the goal is to build a legion of super users—individuals who are rewarded for their time and energy and who, in turn, share ownership of the brand. This is the future of Web3 business: building ownership through community.\n\nCampaigns can progress in “seasons,” with each season lasting roughly six weeks. At the end of each season, new features are introduced to sustain engagement and growth. The abundance of metrics available allows for continuous testing, evaluation, and improvement. Developing “super users” is especially valuable. These are the users who rank highest on leaderboards and progress charts, and they can be engaged as testers and ambassadors for your product. They naturally roll into the main platform, becoming an extension of your community and team.\n\nA Loyal Fanbase is your Key to Web3 Success\n\nGamified platforms highlight the importance of creating experiences that users can actively engage with. The power of a dedicated fanbase should never be underestimated, particularly when launching a product or token. These loyal users can—and should—be rewarded for their efforts in building brand awareness.\n\nSteps projects can take to ensure a successful SocialFi strategy with regard to both legal and best practice factors include:\n• ensure you have clear guidelines for community members around good behaviour and expectations. Take time to ensure you block bots from taking part and keep channels clear for genuine users only. The community moderation team will be vital when ensuring proper engagement in any open discussion channels;\n• consider adapting your brand to be more open and allow users to use certain brand assets in permitted ways to create shared videos, assets and images. You will need to consider your intellectual property licences and think about what parts of your brand you would like to protect and what could be opened up to community usage. You could create a brand pack and acceptable use guidelines, too;\n• if you are giving key governance roles to community members, ensure they have the right skills to take on any responsibilities;\n• when collaborating with other brands, use a collaboration agreement to ensure you have clear legal arrangements, including in respect of IP rights;\n• be conscious of marketing and advertising laws, including local restrictions on the advertising of crypto-tokens, and take advice on compliance early on in your project.\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional. 50\n"
  },
  {
    "page": 26,
    "content": "DePIN (Morgan Lewis - Brabners LLP)\n2.3\nWeb3 advocates often state that we should all be concerned\nabout how there is an oligopoly over the second generation\nof the internet and that Web3 presents an opportunity for the\npower and control to be wrestled from the few and given to\nthe many.\nThe development of cloud infrastructure has revolutionised\nthe way governments, businesses and individuals access and\nuse technology. The use of an internal server room and a\npersonal home computer (with its accompanying pc tower\nunder the desk) are now no longer used by the masses and\nhave to a degree become a mark of a tech laggard. However,\nthe supply of the underlying cloud infrastructure can certainly\nbe understood to be an oligopoly due to being dominated by\nAmazon Web Services (AWS), Microsoft Azure, and Google\nCloud.\nRightly so, advocates for and providers of decentralised\nalternatives are quick to point out that such an oligopoly is\ncause for grave concern. This is because its failure would be\ncatastrophic given the pervasive nature of cloud infrastructure\nand the fundamental impact it has on nearly all aspects of our\nday to day life. Surely something so critical to the smooth\nworking of the modern world should not rest upon a\nfoundation of a small handful of powerful companies. At best\nthis small group could hold the world to ransom on price and\nat worst a sudden full or partial failure of the operations of\none of these providers would see entire industries grind to a\nhalt.\nDePINs seek to replace the rows and rows of servers located\nin data centres with the nodes of a decentralised, blockchain\nor encryption-based system, with the nodes typically being\nrewarded for the use of their computational power by the\nnetwork.\nAt this point it is worth outlining a general disclaimer that I\nprovide to any business seeking to disrupt an industry by\nusing new or innovative technology.\nIt is a natural consequence of working in a disruptive manner\nwith new or innovative technology that the legal and\nregulatory backdrop is often not very clear, meaning that any an\nsuch business needs to be prepared to adapt and change as\nthe legal and regulatory landscape develops. Unfortunately\nfor any such business it means that lawyers like myself often\nrespond with \"it depends\", \"we will have to wait and see\" or \"I\ndon't know\" when answering their enquiries. In order to\nnavigate this uncertainty it is wise to focus on \"what\" is\nactually happening in the supply of a product or service\nrather than get too bogged down in the \"how\" it is\nhappening. Doing so will allow you to draw from:\n• existing laws and regulations for guidance as to how the\nlegal and regulatory landscape is likely to develop; and\n• any contractual arrangements that are somewhat similar\nin nature as inspiration for how to structure any new or\nnovel type of contractual arrangement.\nThe contractual framework for the operation of a DePIN\ndiffers from that of traditional cloud infrastructure\npredominantly as a result of the fact that the infrastructure is\nnot owned and the services are not being directly provided\nby the operator of the DePIN.\nFirstly operators of a DePIN will need to ensure that the\ncontracts they enter into with their customers (for access to\nand use of the DePIN) are put together with the\nunderstanding that the DePIN's infrastructure is not owned by\nthe operator of the DePIN. Specific points to note here are\nthat the operator of the DePIN should refrain from giving any\nwarranty that it owns the DePIN or the infrastructure and\nshould ensure that it is permitted to utilise the services of\nsubcontractors (and be permitted to amend these\nsubcontractors without any requirement to notify or receive\nthe approval of the customer).\nFurther, customers are likely to have concerns about the\nscalability, reliability and security of a DePIN when compared\nwith traditional cloud infrastructure. Any operator of a DePIN\ntherefore needs to ensure that a correct balance is struck\nwithin any contract that assuages the customer's concerns\nbut does not over-promise the DePIN's capabilities.\nThe operator of a DePIN will be unable to provide the same\nlevels of guarantees as a household name cloud services\nprovider in these respects and therefore it is likely that the\ncustomer's worries will need to be relieved via educating the\ncustomer on the \"security by design\" nature of DePIN and the\noperators plans for scalability and reliability (instead of by the\ncustomer imposing onerous contractual damages on the\noperator).\nAdditionally, one thing that should not be missed in any sales\npitch is the fact that a balanced contract can in fact be\nentered into with the operator of the DePIN, and not one pre-\ndetermined to favour the cloud services provider (as is the\nway with AWS, Microsoft Azure and Google Cloud standard\nterms).\nSecondly the operator of a DePIN should enter into\nsubcontractor type agreements with the owners of the nodes\non the DePIN in order to utilise each node for the purpose of\nthe provision of services by the operator. Given the number\nof nodes within a DePIN this should be facilitated by requiring\nthe owner of each node to agree to a standard set of terms\nwhen downloading/installing the operator's software that will\ngive the operator access to the computational power of the\nnode.\nguarantees surrounding availability of access to the node's\ncomputational power;\ndetailed information security requirements; and\nadditional protections to ensure the sharing of any\npersonal data is done so in manner that is compliant with\nGDPR/UK GDPR (and if needed the inclusion of an\ninternational data transfer agreement or the standard\ncontractual clauses as approved by the EU, where the\nnode is located outside the UK or EEA). This is still true\neven if the data shared with the node is encrypted\n(irrespective of whether the node has the capability to\ndecrypt the data or not).\nFinally, given that the contracts with the owners of the\nDePIN's nodes will need to be entered into prior to the\noperator of the DePIN agreeing a contract with a customer\n(as it should take place as part of the set-up of the DePIN),\nthe operator needs to retain the ability to amend its contract\nwith the owner of each node without obtaining their approval.\nThis will allow changes to be made based on the obligations\nthat any operator commits to via its contract with any future\ncustomer. This could be done by the contract including an\nFrom my experience, the operators of a DePIN have been\nexpress right for the operator to amend the contract at will\nproactive in putting contracts together with node owners (i) to (although this may be unenforceable in some circumstances\noutline how access and use of the node's computational\npower will work in practice and (ii) to set out the mechanism\nfor how the reward (i.e. the consideration element of the\ncontract) is earned.\nHowever, what is often overlooked is including sufficient\nprotection for the operator of the DePIN to reflect the fact\nthat access and use of each node's computational power is\ncritical to the operator being able to provide a service to its\ncustomers. This means that the contract should include\nguarantees/warranties that would typically be given by a\ncloud service provider to their customer via their standard\nterms, but in this instance be given by the owner of any node\nfor the benefit of the operator of the DePIN.\nFurther thought should also be given to whether this contract\nshould include additional obligations on the owner of any\nnode to reflect the obligations placed upon the operator of\nthe DePIN to assuage the scalability, reliability and security\nconcerns of the operator's customers (as outlined above).\nThese might include:\nand jurisdictions) or by updating the contract/terms and\nrequiring the owner of each node to re-accept the new\ncontract terms when they next login or access the software\ndashboard (that is typically used to manage the node's role\nwithin the DePIN).\nPhoto Credit: Cayetano Gros (www.lummi.ai)\n51 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 52\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 27,
    "content": "Practical Guide for DeFi Developers\n(Maria Riivari - Avara)\nDecentralised Finance (DeFi) has rapidly grown into a diverse\nand complex ecosystem, presenting unique challenges and\nopportunities. This chapter explores DeFi in three key parts:\nfirst, it examines jurisdictional considerations and the current\nregulatory landscape in the UK. Second, it provides\npractical guidance for protocol developers, focusing on\nlegal considerations for creating and operating\npermissionless smart contract protocols. Finally, it offers a\nsimple toolkit for front-end developers, addressing critical\nfactors for navigating running interfaces within the DeFi\nspace based on current industry practices.\nPart 1. UK Regulation & Perspectives on DeFi\nOne of the challenges with modern internet and blockchain\nsystems from a legal perspective is their inherently global\nnature. In contrast, laws are jurisdiction-specific and do not\noperate seamlessly across borders. As a rule, it is not\nstraightforward to identify whether a particular DeFi project\nfalls under one or another jurisdiction due to its decentralised\nand cross-border nature; despite extensive global discussions\nand consultations, currently there remains little clarity on\nwhether, and to what extent, phenomena categorised as\n\"DeFi\" are subject to regulation.\nCurrently in the UK DeFi operates largely in an unregulated\nspace, with the UK legal framework for DeFi still evolving as\nregulators strive to balance fostering innovation with ensuring\nconsumer protection and financial stability. Key legislation\nrelevant to this area, discussed elsewhere in this guide,\nincludes the Financial Services and Markets Act 2023, which\nintroduces provisions for regulating cryptoassets, including\nstablecoins, under existing financial rules. 23 The FCA plays a\ncritical role in overseeing crypto promotions and enforcing\ncompliance with anti-money laundering (AML) regulations,\nsignalling a growing regulatory focus on DeFi platforms.\nHowever, unique challenges such as decentralised\ngovernance, pseudonymity, and the lack of traditional\nintermediaries create uncertainties about the application of\ncurrent UK laws.\nFuture guidance is expected to address these gaps,\nparticularly as DeFi projects are likely to increase\nengagement with traditional financial markets. This evolving\nregulatory environment highlights the need for clarity and\nadaptability to manage the complexities inherent in\ndecentralised financial systems.\nThat said, it should not be forgotten that certain activities\n(which are unlikely anyway to fall under what would be\nunderstood as \"DeFi\") which fall under the regulatory\nframework in the UK include:\n• Custody of Assets: Providing custody services for digital\nassets, such as managing digital wallets or safeguarding\nprivate keys, is subject to regulatory scrutiny. The FCA\noversees firms offering these services to ensure the\nprotection of customer funds and compliance with anti-\nmoney laundering (AML) regulations.\n• Facilitation of Fiat-to-Crypto or Crypto-to-Fiat\nTransactions: Activities involving the exchange between\nfiat currencies and cryptocurrencies are regulated under\nthe UK's AML and counter-terrorism financing (CTF) laws.\nFirms facilitating these transactions must register with the\nFCA and implement robust AML/CTF controls. The FCA\nhas taken enforcement actions against firms failing to\ncomply with these regulations, highlighting the\nimportance of adherence to AML requirements.\n• Stablecoin Issuance: Whilst not fully regulated in the UK\ntoday, the UK government has recently announced plans\nto regulate stablecoins under a unified regulatory\nframework, ensuring they maintain stable value and are\nappropriately backed by assets. Tailored rules will address\ntheir issuance and use, aligning with global standards like\nthe European Union's Markets in Crypto-Assets (MICA)24\nRegulation. The framework, set for early 2025, aims to\nbalance innovation with consumer protection and\nfinancial stability while positioning the UK as a\ncompetitive hub for digital assets. 25\nThis brings us to an important development in the European\nregulatory landscape. Whilst of course not applicable in the\nUK, MICA, which has been announced to serve as the\ninspiration for the future UK regulations, addresses DeFi in\nRecital 22. This recital clarifies the regulation's applicability to\ndecentralised services:\n\"This Regulation should apply to natural and legal persons and\ncertain other undertakings and to the crypto-asset services\nand activities performed, provided or controlled, directly or\nindirectly, by them, including when part of such activities or\nservices is performed in a decentralised manner. However,\nwhere crypto-asset services are provided in a fully\ndecentralised manner without any intermediary, they should\nnot fall within the scope of this Regulation.\"\nThis section can be interpreted to mean that MiCA covers\nservices involving intermediaries, even if some operations are\ndecentralised. In contrast, services that are entirely\ndecentralised, operating without any intermediaries, are\nexcluded from MiCA's scope.\nThis distinction is important for understanding how DeFi\nplatforms may be regulated under MiCA. Unfortunately trying\nto define \"decentralisation\" is like trying to herd cats good\nluck getting everyone on the same page. One attempt to\nshine light on the scope of this carve out came from the\nDanish Financial Supervisory Authority (DFSA) who\nemphasised that significant criteria must be met for an\noffering to be considered truly decentralised. Therefore, this\ncarve-out, while promising, leaves room for interpretation\nand highlights the importance of understanding the nuanced\ndistinctions between decentralised and centralised operations\nwhen navigating the regulatory environment. If there's one\nthing to take away from this carve-out, it's that\ndecentralisation can really impact a project's regulatory\nstatus, especially if it's fully achieved.\nAdditionally, it should be noted that HM Revenue & Customs\n(HMRC) has been particularly active in addressing the tax\nimplications of DeFi activities, such as lending and staking of\ncryptoassets. Recognising the complexities and ambiguities\nwithin existing tax frameworks, HMRC initiated a call for\nevidence in July 2022 to gather insights from stakeholders\non the taxation of DeFi transactions. Building upon the\nfeedback received, HMRC launched a formal consultation in\nApril 2023, proposing legislative changes to better align the\ntax treatment of DeFi activities with their economic\nsubstance.26\nPart 2. A Compass for DeFi Protocol Developers\nRather than dwelling too much on the rapidly changing\nstatus quo of DeFi regulatory developments in the UK, the\nfollowing two sections seek to focus on providing practical\nideas for developers to navigate this evolving landscape.\nSpecifically, we discuss permissionless protocol networks. In\nthis context, \"permissionless\" refers to the ability of anyone to\ninteract with a protocol's smart contracts, either through a\nuser interface or directly on the blockchain.\nIt is important to note that legal risks are highly situation, fact,\nand context-specific, making individual assessments crucial.\nFrom a legal perspective, developers typically have no direct\nconnection or contractual relationship with the end users of\nthe DeFi protocols; they operate in a mere conduit role, solely\nproviding the framework for these decentralised interactions.\nWhile we explore topics related to user interfaces in Part 3 of\nthis Chapter, it is important to consider the distinction\nbetween protocol development and interface development.\nSome organisations engage in both, making all\nconsiderations relevant to their operations. However,\nmaintaining conceptual clarity about these activities is crucial\nfor understanding the developer's position and\nresponsibilities as they can help delineate legal and\noperational boundaries. What follows seeks to offer \"food for\nthought\" on what might make a difference in terms of various\nlegal risks in designing DeFi protocols.\n1. Prioritise Security\nThe protocol's security is your best security. Building on new\ntechnologies is inherently challenging, especially in self-\ncustodial systems where the stakes are high.\nWhile many factors may be beyond developers' control,\nprioritising security is crucial-not only to ensure system\nintegrity but also to protect users. Beyond the ethical\nimperative, the practical reality is that security lapses can\nincrease the risks for developer organisations, including legal\nones. Even if developers are not fundamentally liable,\nmanaging these risks can be time-consuming and stressful.\nInvesting in security is not just about doing the right thing; it\nis also a sound long-term strategy, aligning with the broader\ngoal of building a fair and secure decentralised financial\nsystem.\n26The Taxation of Decentralised Finance Involving the Lending and Staking of Cryptoassets: Call for Evidence, UK Government (27 April 2023)\n23Financial Services and Markets Act 2023\n24Regulation (EU) 2023/1114 of the European Parliament and of the Council of 31 May 2023 on Markets in Crypto-assets, 2023 O.J. (L 150) 1\n25 Keynote Address at the Tokenisation Summit: UK Government Approach to Tokenisation and Regulation, UK Government (25 November 2024)\n53 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 54\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 28,
    "content": "Trade-offs are often unavoidable, particularly in the early\nstages of development. It should be recognised that creating\nrobust systems requires balancing numerous complex factors\nand navigating difficult choices between competing risks.\nJust as Rome wasn't built in a day, industry practices evolve\nas systems mature, providing more reliable security standards\nover time. Security is a key reason decentralisation often\nexists on a spectrum, particularly in early stages. Initial\nconsiderations may involve compromises, such as\nincorporating upgradeability features or temporarily retaining\nadmin keys. These measures can sometimes be justified to\nensure the system's security is reasonably validated and\nprovide additional safeguards to protect end users from\npotential losses. While there is no one-size-fits-all approach\nto managing these challenges, demonstrating that decisions\nwere made with security as a guiding principle can\nsignificantly benefit developers in the long run.\n2. Champion Documentation\nTransparency is fundamental to building trust in DeFi, which\ninherently benefits from its ability to eliminate information\nasymmetries through open and accessible systems.\nDevelopers can embrace this principle by providing clear and\ncomprehensive documentation that explains their protocols,\nhighlights potential risks, and makes relevant data readily\navailable.\nDeFi comes with various risks, including vulnerabilities in\nsmart contracts, unique interoperability challenges related to\nbridges and oracles, and broader economic risks like market\nvolatility. By proactively disclosing these risks as they pertain\nto their specific project, developers not only empower users\nto make informed decisions but also reduce the likelihood of\ndisputes or issues that could undermine the project's\nreputation.\nHigh-quality, credible, and accessible documentation\nbenefits both users and the ecosystem. For users, it fosters\ninformed decision-making and builds trust. For the broader\nDeFi community, it encourages collaboration, innovation, and\ndevelopment by other contributors, ultimately strengthening\ndecentralisation and expanding the ecosystem.\n3. Address the Degree of Control\nDeFi is built on the principle of decentralisation, but this\nconcept encompasses varying degrees and interpretations. In\naddition to what has been discussed above about\ndecentralisation itself, developers might consider the\nfollowing points when designing protocols:\n• Mutability vs. Immutability: Striking the right balance\nbetween flexibility and security is often a key\nconsideration in deciding whether a smart contract could\nbe made immutable. Immutability is often regarded as\nbeneficial because it can be seen to introduce a degree\nof separation between the actions of the developer\ndeploying the DeFi protocol and the permissionless\nactivity that may occur afterward by other users. The idea\nis that this separation might help reduce the likelihood of\ndevelopers being perceived as owners or controllers of a\nsystem, potentially mitigating liabilities.\n• Resilience Through Decentralisation: It has been\nargued that one goal of decentralised systems seeks to\nminimise single points of failure. By reducing reliance on\nspecific individuals or entities, protocols can aim to\nfunction more effectively and distribute risks across the\nnetwork. A resilient system may be more aligned with\ndecentralisation principles, enhancing robustness and\ntrust in the network.\nPart 3. DeFi Interface Developer Cheat Sheet\nPermissionless access to DeFi allows users to engage with\nnetworks and protocols in various ways, and the interfaces\nthemselves vary widely-some focus on specific\nfunctionalities, while others cater to broader DeFi needs,\ncreating a range of user experiences.\nThe regulatory uncertainties surrounding DeFi also extend to\ninterfaces. A distinction is, however, is that interface providers\noften have a closer connection to end users, unlike the\ndecentralised blockchain networks they interact with or the\ndevelopers that wrote the code of the network. However, this\nconnection does not necessarily impose liability on\ndevelopers for user interactions or the underlying smart\ncontracts. Nonetheless, it is a critical consideration that could\nplay a significant role in mitigating legal risks.\nThere is no one-size-fits-all solution for DeFi interfaces, but\nthe following toolkit outlines areas that developers may\nconsider. It reflects practices observed across various DeFi\nfront-ends and highlights aspects that may be relevant\ndepending on specific circumstances. While many points are\nrooted in general principles for online platforms, they can be\nadapted to address the nuances of DeFi.\n55 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n\nAspect\nSecurity\nTerms of Use\nPrivacy Policy\nClickwrap Agreements\nDecentralised Hosting\nGeoblocking\nVPN Blocking\nUser-Friendly Design\nUser Support\nWarnings & Notifications\nFiat On/Off-Ramps\nPromotions\nThird-Party Materials\n\nConsiderations\nSecurity is a critical concern for DeFi interfaces, which are common attack vectors.\nMany interfaces focus on implementing robust measures to protect users and systems.\nSome interfaces adopt detailed terms to outline user responsibilities, limit liability, and\naddress specific risks.\nImportant to provide a clear privacy policy that complies with data protection laws and\nexplains data collection and usage.\nSome interfaces use clickwrap agreements requiring users to actively accept terms and\nthe privacy policy, improving the argument that users understood and agreed to key\nterms.\nHosting on decentralised platforms (e.g., IPFS) is an approach some developers take to\nalign with DeFi's principles and enhance resilience.\nAn option considered by some front-ends is geoblocking to restrict access from\njurisdictions with regulatory or legal concerns.\nSome interfaces include tools for monitoring blockchain transactions or flagging/\nblocking certain wallets based on risk factors from connecting to the interface.\nInterfaces often emphasise user-friendly designs to reduce mistakes and enhance user\nexperience. A well-informed user is less likely to encounter issues. Moreover, in the\nevent of a dispute, developers are more likely to successfully rely on the argument that\nusers were empowered to make informed decisions based on the comprehensive\ninformation provided and accepted by the user.\nWhile many DeFi projects rely on community-managed resources (e.g., Discord), some\ninterfaces consider offering dedicated support channels to address user needs.\nSome interfaces include warnings or notifications to alert users about potential risks,\nsuch as transaction fees, failed connections, or security concerns.\nInterfaces that facilitate fiat on/off-ramps may highlight that the end user typically\nengages directly with the exchange provider, which may be regulated. Developers\nshould consider clarifying these relationships and undertaking due diligence on the\nrequirements on these providers.\nWhere promotions are involved, developers may assess regulations governing\npromotional activities, particularly in jurisdictions with strict advertising rules\nDevelopers may want to address how third-party content or integrations (e.g., incentive\nprograms, fiat gateways, analytics tools) are presented, with disclaimers that clarify the\ninterface provider's role and limit liability for third-party issues.\nThis list aims to guide DeFi interface developers by offering an overview of many industry practices and key considerations. Each project is\nunique, with varying jurisdictional connections, and developers should carefully assess the relevance of these points in the context of their\nspecific circumstances and the evolving regulatory landscape. It is also important to continue innovating and developing new best practices,\nas there is still much to explore and improve in this rapidly evolving space.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 56\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 29,
    "content": "SETTING UP FOR SUCCESS\nAND RISK MITIGATION\n\nOverview of Anti-Money Laundering\n(AML), Sanctions and Compliance Law\n\nThe fragmented nature of regulatory regimes in the UK\nmeans that it can be challenging to ascertain every single\nregulatory and/or legislative framework with which you need\nto ensure compliance. As a rule of thumb, in the context of\ncryptoassets and blockchain, when seeking to mitigate\nagainst financial crime risks and adhering to important\nregulatory standards, the core frameworks that ought to be\nconsidered are:\n\n• The Money Laundering, Terrorist Financing and Transfer\nof Funds (Information on the Payer) Regulations 2017\n(MLRs)\n• Authorisation under the Financial Services and Markets\nAct (FSMA)\n• Electronic Money Regulations (EMRs) and the Payment\nService Regulations (PSRs)\n• Sanctions Regime under the Sanctions and Anti-Money\nLaundering Act (SAMLA) and various implementing\nOrders\n• The Financial Promotions Regime (covered elsewhere in\nthis guide)\n• Data Protection/GDPR (covered in the Product, Data and\nCompliance by Design section)\n\n(Leon Hurd - Cybersandbox and Keystone Law Limited)\n\nAML registration with the UK Financial\nConduct Authority (FCA)\n57\n03\n\nThe MLRs are an important tool in the combatting of financial\ncrime and money laundering. The MLRs were extended to\ncertain types of cryptoasset businesses in January 2020,\npursuant to which: (i) \"cryptoasset exchange providers\"; and\n(ii) \"custodian wallet providers\" (both as defined in 14A of the\nMLRs) are required to register with the FCA for supervision of\ntheir AML processes.\n\nMany cryptoasset service providers ‘CASPs’/Exchanges will,\ntherefore, need to comply with the registration requirement in\norder to deliver services into the UK. To successfully apply for\nregistration, applicants will need to demonstrate robust AML\ncontrols including the following:\n\nRisk Assessment:\n• A comprehensive business-wide risk assessment\n• Individual customer risk profiling\n• Geographic risk considerations\n\nCustomer Due Diligence (CDD):\n• Verification of customer identity\n• Enhanced due diligence for high-risk customers\n• Ongoing monitoring of transactions\n\nOperational Controls:\n• Appointment of a Money Laundering Reporting Officer\n• Staff training programs\n• Suspicious activity reporting procedures\n• Record-keeping systems\n\nThere is a substantial amount of guidance around what\nconstitutes a custodian wallet provider or an exchange. It is\nnot uncommon for a business to believe that it is not caught\nwithin the definition under Regulation 14A because for\nexample, it purports to only provide self-custody wallets\nwhen in fact as part of its broader business there may\nactually be custodian services attached which bring it in\nscope.\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 58\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 30,
    "content": "Similarly, a cryptoasset business might provide ancillary\nservices which bring it in scope: for example, a crypto\nremittance business that might as part of its services include\nan exchange service to enable customers to change USDT to\nETH before remitting the ETH. It is imperative that legal\nadvice is obtained on the entire business model and\ncustomer journey to ascertain whether registration is\nrequired.\n\nAuthorisation under FSMA\n\nFSMA establishes the regulatory perimeter, that is the\nboundary which delineates between regulated activities for\nwhich FCA authorisation is required, and unregulated\nactivities for which FCA authorisation is not required\n(although other legal and regulatory rules may also apply).\n\nBroadly speaking, the need for authorisation is likely\ntriggered, subject to applicable exclusions and exemptions,\nwhere you are: (1) conducting specified activities, (2) involving\nspecified investments, (3) by way of business, and (4) from or\nin the UK.\n\nCurrently, cryptoassets are not expressly included in the\ndefinition of specified investments for the purposes of\nregulation under the specified activities regime (note however\nthat they are included as 'qualifying cryptoassets' under the\nfinancial promotions regime), however, the FCA has by way\nof guidance created a taxonomy by which some cryptoassets\nare capable of being treated akin to specified investments\nand consequently capable of falling within the regulatory\nperimeter if there are specified activities undertaken in\nrespect of them (i.e. traditional financial services such as\narranging deals in investments, managing investments,\nadvising on investments etc.,) by way of business in or from\nthe UK. To achieve this, the FCA categorises cryptoassets\ninto regulated and unregulated tokens:\n• Regulated tokens — primarily security tokens and e-\nmoney tokens;\n• Unregulated tokens -primarily utility tokens and\nexchange tokens.\n\nThe FCA supports a substance over form approach and will\nclassify a token as a security token, and consequently\ncapable of being caught within the perimeter, if they:\n• Have characteristics similar to traditional securities:\n• Provide rights like ownership, repayment of money, or\nprofit share;\n• Are transferable and tradeable on capital markets.\n\nSimilarly, the FCA will deem a token to be an E-Money Token\nif they:\n• Meet the definition of electronic money under EMRs;\n• Maintain stable value pegged to fiat currency;\n• Are used for payment.\n\nSome stablecoins might fall within this definition and it is\nunderstood that there are future plans to include stablecoins\nwithin the definition of e-money under the EMRs. The FCA's\ncrypto roadmap published on 25 November 2024 states that\nthe FCA aims to consult on its regulatory approach to\nstablecoins in Q1/Q2 2025. 27\n\nUnregulated Tokens remain outside the perimeter when they:\n• Are primarily used for exchange;\n• Don't provide rights similar to regulated investments;\n• Function as utility tokens for accessing services.\n\nFrom a compliance perspective, it is essential that careful\nanalysis is undertaken to correctly classify tokens. When\nconsidering whether a business is engaging in authorised\nactivity, the FCA will look beyond any superficial labels that\nare given to an activity and will look at the substance of what\nis happening to determine whether regulated activity is being\nundertaken. They will, for example, closely examine whether\na token is indeed a utility token or whether in fact it is\nbehaving as a security, and may ask probing questions about\nthe operation of the business to help with their assessment.\n\nAdvice should always be obtained as to whether\nauthorisation is required as the position is not always clear.\nThere is, for example, substantial case law around the\nmeaning and application of the different statutory criteria for\ndetermining whether authorisation is required.\n\nWhere authorisation is required, you may need to engage\nservices of compliance consultancies and law firms to\nprepare the various documents needed for an authorisation\napplication, such as policies and procedures, a detailed\nbusiness plan and detail on key personnel and how they\nsatisfy FCA requirements.\n\nThe authorisation process can be lengthy and will usually\ntake a minimum of 6 months if everything goes smoothly. It is\nalso important to note that you cannot undertake authorised\nbusiness before obtaining authorisation as this is a criminal\noffence under FSMA; this can sometimes be alleviated by the\nintroduction of temporary licence regimes, but again careful\nassessment is required to determine what activities can be\ndone while authorisations are being sought.\n\nElectronic Money\nRegulations / Payment\nService Regulations\n\nThe question of whether activities are subject to regulation\nunder the EMRs and/or the PSRs largely depends on whether\nthe cryptoassets, supported by the business/platform, meet\nthe legal definition of “electronic money” (e-money). Activities\nrelating to the transfer of e-money are regulated under the\nPSRs; operating a platform which facilitates the transfer of e-\nmoney from one person to another is likely to fall in scope\nand require a Payment Institution (PI) licence by virtue of it\nbeing money remittance which is a payment service under\nthe PSR.\n\nA cryptoasset business will require an Electronic Money\nInstitution (EMI) licence if it is issuing “money”, this would be\nthe case where it is issuing tokens which meet the definition\nof e-money. There is currently much discussion around\nwhether stablecoins meet the definition of e-money and\nthere are legislative plans to bring stablecoins within the\ndefinition of e-money and, consequently, within scope of the\nEMR and PSR.\n\nCareful consideration should be given to the types of tokens\nthat are supported by a platform, particularly where the\nbusinesses services include the issue or transfer/remittance of\ntokens.\n\nThere are many similarities between an authorisation\napplication under FSMA and an application for an EMI or PI\nlicence and advice should be obtained — by reference to a\ndetailed review of the business and customer journey — to\nassess whether (and which) licences are required and the\ncontent of the application.\n\nSanctions\n\nIndividuals and legal entities who are within or undertake\nactivities within the UK’s territory must comply with UK\nfinancial sanctions that are in force; therefore, overseas\ncompanies operating in the UK are caught. UK incorporated\nentities are subject to UK requirements relating to sanctions\nand the prevention of terrorist financing irrespective of where\nthey are operating. This applies regardless of the regulatory/\ncompliance status discussed above; however, it is worth\nflagging that additional requirements apply to firms within the\nscope of the regulatory regimes referred to above.\nThere are a wide range of economic sanctions imposed by\nthe UK on various countries/political regimes and specialist\nadvice should always be obtained if there are concerns about\nwhether business activities might breach sanctions.\nBusinesses should be particularly mindful of sanctions\nimposing asset freezes on designated persons (individuals\nand entities). Broadly, asset freezes imposed by the UK\noperate to prohibit:\n\n• making funds or economic resources available, directly or\nindirectly, to, or for the benefit of, a designated person or\nto a person who is owned or controlled directly or\nindirectly by the designated person;\n\n• dealing with the frozen funds or economic resources,\nbelonging to or owned, held or controlled by a\ndesignated person or to a person who is owned or\ncontrolled directly or indirectly by the designated person;\n• engaging in actions that, directly or indirectly, circumvent\nthe sanctions prohibitions.\n\nAs a matter of good and robust financial hygiene, businesses\nshould implement AML and sanctions policies which set out\nthe procedures and policies in place to ensure that users are\nadequately screened, and that sanctions and broader money\nlaundering risks are mitigated. From the UK perspective, this\napproach should also be taken by blockchain/cryptoasset\nbusinesses. To support this view, guidance on the regulatory\nexpectations in respect of crypto firms was given in a “Joint\nstatement from UK financial regulatory authorities on\nsanctions and the cryptoasset sector” (March 2022). Some\nkey expectations to note are:\n"
  },
  {
    "page": 31,
    "content": "* where blockchain analytics solutions are deployed, ensuring that compliance teams understand how these capabilities can be best used to identify transactions linked to higher risk wallet addresses;\n* updating business-wide and customer risk assessments to account for changes in the nature and type of sanctions measures;\n* ensuring that customer onboarding and due diligence processes identify customers who make use of corporate vehicles to obscure ownership or source of funds;\n* ensuring that customers and their transactions are screened against relevant updated sanctions lists and that effective re-screening is in place to identify activity that may indicate sanctions breaches.\nBusinesses should also look for red flag indicators that suggest an increased risk of sanctions evasion. These may include:\n* the use of tools designed to obfuscate the location of the customer (e.g. an IP address associated with a virtual private network or proxy) or the source of cryptoassets (e.g. mixers and tumblers);\n* transactions to or from a wallet address associated with a sanctioned entity, or a wallet address otherwise deemed to be high-risk, based on its transaction history or that of associated addresses, or other factors;\n* transactions involving a cryptoasset exchange or custodian wallet provider known to have poor customer due diligence procedures or which is otherwise deemed high-risk.\nThere are also some special reporting duties for cryptoasset exchange providers and custodian wallet providers which require them to report to OFSI where they know or suspect a person is a designated person or has committed sanctions offences.\nIt is always sensible to obtain legal or regulatory advice around the implementation of policies and procedures to address sanctions and broader AML/financial crime risks. There is a lot of value in carrying out this exercise robustly as demonstrating good governance and processes is an important aspect of most licensing and authorisation applications.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nPhoto Credit: Patrick Venegas (www.lummi.ai)\n62\n"
  },
  {
    "page": 32,
    "content": "UK REGULATION OF THE\nFINANCIAL PROMOTION\nOF CRYPTOASSETS\n(Andrew Maguire - Littleton Chambers)\n04\nCryptoassets have been the subject of increased scrutiny\nduring the last couple of years, with both the Government\nand the FCA having previously expressed concern about 'the\nwild west' of crypto promotions, within the context of\nincreased regulation taking place in other jurisdictions. On 26\nNovember 2024, the FCA has published its \"roadmap\",\nwhich outlines planned FCA policy publications for\ncryptoassets where the FCA are seeking feedback and the\ncontent they are expected to cover, concerning the\nregulation of crypto: see crypto roadmap.\n\nOn 7 June 2023, the UK Parliament passed the Financial\nServices and Markets Act 2000 (Financial Promotion)\n(Amendment) Order 2023, which brought cryptoassets within\nthe scope of the regulatory framework which regulates the\nmarketing of financial products in the UK. This legislation\namended the Financial Services and Markets Act (Financial\nPromotion) Order 2005 ('FPO'), extending it to cryptoassets\nwith effect from 8 October 2023. The FPO defines the\ninvestments and activities captured by the financial\npromotions regime as well as related exemptions.\n\nA key component of financial regulation is the control over\nthe manner in which investment products are marketed and\npromoted to the general public, by the Financial Conduct\nAuthority's authorisation of firms marketing regulated\nproducts to the general public. In more recent times, scams\nperpetrated via social and digital media have increased\nexponentially. The UK Government has been keen to ensure\nthat the regulatory framework is fit for purpose and relevant\nto the recent technological developments.\n\nSection 21 of the Financial Services and Markets Act 2000\n('FSMA') provides that a person must not, in the course of\nbusiness, communicate an invitation or inducement to\nengage in investment activity or to engage in claims\nmanagement activity unless the promotion has been made or\napproved by an authorised person or it is exempt. This article\ndoes not deal with claims management activity which is a\nseparate topic.\n\nTherefore, a financial promotion is defined as any\ncommunication that either invites or induces a person to\nengage in investment activity that is communicated in the\ncourse of a business: see s.21 of FSMA and FCA's Perimeter\nGuidance Manual ('PERG') at PERG 8.1.1. [emphasis added]\nGuidance on the FCA's interpretation of the financial\npromotion restrictions and the applicable exemptions from\nthe regime is contained in chapter 8 of PERG, which is\nintended to represent the FCA's views. Although not strictly\nbinding on the courts, in practice, it is usually of persuasive\neffect to judges determining financial promotion regulatory\nissues, as recent case law has shown. This Guidance applies\nto persons who need to know whether their communications\nare subject to, or comply with, s.21 of FSMA; namely, whether\ntheir activities, in making or helping others to make financial\npromotions, are regulated activities. The scale of the risk is\nunderscored by the fact that a breach of s.21 is a criminal\noffence, carrying a penalty of imprisonment for up to two\nyears and or an unlimited fine or both.\n\nIn considering whether any communication relating to\nfinancial promotions is captured by the prohibition in s. 2.1 of\nFSMA, the following five questions ought to be considered:\n\n(i) is a communication being made or caused to be made?\n\n(ii) is the communication an invitation or inducement to\nengage in investment activity? (iii) is the communication\nmade in the course of a business?\n\n(iv) does the communication originate from outside the UK\nand, if so, is it capable of having an effect in the United\nKingdom?\n\n(v) does the communication fall within one of the exemptions\ncontained in the FPO?\n\nIf the communication satisfies the first four questions listed\nabove, and there is no applicable exemption, then the\nfinancial promotion will have to be communicated or\napproved by an authorised person in compliance with the\napplicable financial promotion rules (depending on the type\nof investment product).\nA number of exemptions exist, namely that either:\n\n(i) the person is authorised under FSMA in accordance with\nsection 31 of FSMA; or\n\n(ii) the content of the communication has been approved by\nan authorised person that is a permitted approver in\naccordance with the FCA rules; or\n\n(iii) the communication is covered by an exemption pursuant\nto the Financial Services and Markets Act 2000 (Financial\nPromotion) Order 2005, as amended; or\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n64\n"
  },
  {
    "page": 33,
    "content": "(iv) there is (currently) a time limited exemption for certain\ncrypto asset businesses who are registered with the FCA\nunder the Money Laundering, Terrorist Financing and\nTransfer of Funds (Information on the Payer) Regulations 2017\n('MLR 2017'); as from 8 October 2023.\nThe guidance in PERG8 provides useful insights into the\nquestion of whether any communication is likely to be held to\nbe an invitation or inducement to engage in investment\nactivity, such as the following random examples: web links;\nadvertisements; communications by employers to their\nemployees; invitations to attend meetings or to receive\ntelephone calls or visits, investment trading methods and\ntraining courses; advertisements inviting contact with the\nadvertiser; image advertising; performance tables; company\nstatements and announcements.\nIn addition, PERG8 provides guidance on what it means to\ncommunicate financial promotions; in practice, a person will\nneed to have taken active steps to make the communication,\nwhich will be a key question of fact. The FCA take the view\nthat a person is making a communication where they give\nmaterial to the recipient or are responsible for transmitting\nthe material on behalf of a person. Thus, if a person\nknowingly were to leave a copy of a document where it is\nlikely that people will pick up such copies (who may seek to\nact on the information contained in those documents), that\nperson will be communicating the content of that document.\nPERG8 also distinguishes between a communication which is\nmade to another person, such as if it is addressed verbally or\nin legible forms and a communication which is directed at\none or more persons if it is addressed to persons generally,\nsuch as a television broadcast or a website: this distinction\nbecomes important when the issue of exemptions is being\nconsidered.\nThe requirement, in s.21(1) FSMA, that only invitations or\ninducements communicated in the course of a business are\nregulated is not restricted to those carrying out regulated\nactivities. Therefore, anyone who carries on a business that is\nnot a regulated activity, should be careful when making\ncommunications, that may amount to financial promotions, if\nthey seek to persuade or invite others to engage in\ninvestment activity.\nRestrictions cover both written and oral communications.\nHowever, the exemptions in the FPO draw distinctions\nbetween real time and non-real time and solicited and\nunsolicited communications.\nThis is because consumers are believed to be more likely to\nbe influenced into buying a product as a result of high-\npressure sales tactics during unsolicited telephone or face to\nface, real time discussions, so that such activities are thus\nsubject to greater regulation.\nThe territorial scope of the financial promotions regime in the\nUK will depend on issues such as the location of both the\ncommunicator and the recipient of the promotion. In general,\nany promotion with the UK link, be that an incoming or\noutgoing communication, will be caught. Such restrictions\nwill apply its promotions to recipients located in the United\nKingdom, subject to exemptions, and under section 21(3) of\nFSMA any promotions originating outside the UK will also fall\nwithin the restriction, if they are capable of having an effect\nin the United Kingdom.\nFinancial promotions by authorised persons are not subject\nto the financial promotion restriction in s.21. However,\nauthorised persons must ensure that any financial promotion\nthey communicate must comply with the relevant financial\npromotion rules. The financial promotion approval gateway\nintroduced in 2023, replaced the previous regime under\nFSMA that allowed an authorised person to approve the\nfinancial promotion of an unauthorised person for the\npurposes of s.21. Under the new gateway a financial\npromotion requirement automatically applies to all authorised\nfirms that have not applied for and be granted approval\npermission by the FCA. Under s.21, the content of the\nfinancial promotion can only be approved by an authorised\nperson who either:\n(i) is a permitted approval in relation to the financial\npromotion; or\n(ii) falls within the scope of an approver permission\nexemption, as set out in the FSMA 2000 (Exemptions from\nFinancial Promotion General Requirement) Regulations 2023,\nwhich allows an authorised person to approve its own\nfinancial promotion without requiring permission.\nThe many exemptions to financial promotion restrictions are\ntoo wide-ranging and varied to accurately set out in this brief\narticle, as there are over 70. Specialist regulatory advice\nought to be obtained from expert lawyers in relation to such\nexemptions; particularly given that a wrong decision in\nregards whether an exemption applies or not could have\nliterally catastrophic consequences to the individual and the\nentire business.\n65 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nSome examples of decision making, in corporate activity,\nregarding whether a financial promotion is being\ncommunicated, arise in the following circumstances,\nespecially where outside investment is being sought which\ngive rise to all such communications being compliant with\nthe regulatory regime: press presentations; the publication of\ncompany annual reports and accounts; the distribution of\nanalysts research reports in the marketing of an initial public\noffering; the publication of a prospectus for listed securities;\ncompanies promoting either the buyback of its shares for\nholding in treasury or the sale of treasury shares;\ncommunicating with employees regarding employee share\nschemes; or unlisted companies promoting investment in its\nbusiness to private equity funds.\nFinancial promotions, involving consumers, cover a wide\nrange of material including stationery, shop fronts, faxes,\nleaflets, newspaper advertisements, emails, text messages,\nhyperlinks, sponsored links and banner advertising, websites,\nTV and radio commercials and increasingly communications\nvia digital and social media; such as blogs, microblogs such\nas X, social networks such as Facebook, LinkedIn, Google+,\nforums, image and video sharing platforms such as YouTube\nand Instagram.\nAn illegal financial promotion is one communicated in breach\nof s21. For example, an unauthorised influencer\ncommunicating a financial promotion without approval from\nan appropriate authorised person and where no FPO\nexemption applies.\nAn example of an invitation might be as simple as: \"Invest in\n[A] Ltd's share sale by completing the attached application\nform\". An example of an inducement might be: \"[A] Ltd's\ngrowth to date has been spectacular and that growth is\nexpected to continue\".\nTherefore, the following examples would be likely to breach\nthe applicable rules and be in essence criminal behaviour:\n(i) an influencer is directly compensated by a firm and issues\nposts encouraging followers to use the firm's services;\n(ii) an influencer is not currently employed by a firm but is\npromoting a firm's services to generate revenue from a\nrelationship with the firm in the future;\n(iii) an influencer is promoting the services of a firm on a\nsocial media platform in a bid to acquire more views and\nattention for their content. They are then directly\ncompensated by the social media platform for the views they\nacquire;\n(iv) an influencer is promoting the services of a firm but only\nto try to acquire more followers and likes. They will then use\nthe increased followers and likes to ask for a higher fee in\nfuture brand deals with firms;\n(v) person A is promoting chatroom B which they run to\npromote investment products. They have a commercial\nrelationship with firm C who sells investment products;\n(vi) person A is promoting investment products on a social\nmedia platform to lead people to a chatroom centred around\ninvesting that they run or are involved in running. They gain a\nmonetary benefit from the success of the chatroom, for\nexample by selling courses about investing;\n(vii) an influencer promotes the services of a firm through an\naffiliate link. When a consumer clicks the link and purchases\nthe product the influencer will be directly compensated for\ntheir purchase.\nActivities that are less likely to be captured by the regulatory\nregime are myriad, such that it is almost impossible to\ngeneralise, as the wording of each communication would\nneed to be considered in isolation. However, some random\nhigh-level examples of communications are as follows:\n(i) those which are purely profile raising and which do not\nidentify and promote particular investments or investment\nservices may not amount to either an invitation or\ninducement of any kind. Examples of this include where listed\ncompanies sponsor sporting events or simply put their name\nor logo on the side of a bus or on an umbrella;\n(ii) statements of fact about a company's performance or\nactivities may not, in themselves, be inducements to engage\nin investment activity even if they may lead persons to decide\nto buy or sell the company's shares. However, statements\nwhich speculate about the company's future performance or\nits share price may have an underlying purpose or intent to\nencourage investors to act.\nThese few examples starkly demonstrate that seeking expert\nadvice is prudent, as compliance with s.21 is mandatory;\nthere is no \"best endeavours\" defence available: the\nunderlying policy requirement is for firms to unconditionally\ncomply with the legal framework. This may require the\nobtaining of expert advice, if any doubt arises as to the\nlawfulness of a proposed communication. Increasingly, in the\ncrypto space, such compliance is increasingly sought by\npotential investors, many of whom will be aware of the\ncalamities that have arisen in the unregulated crypto market.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 66\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 34,
    "content": "67\nTAX, VAT AND\nACCOUNTING\nDion Seymour - Andersen LLP ;\nMark Pearce - Alkimi\n05\nImportant note: The content in this section, including\nany rates and thresholds mentioned, changes very\nquickly and is highly subject to variation based on\nindividual circumstances. This is a guide for general\ninformation purposes only and it is extremely important\nto engage a professional advisor for advice on your\nparticular circumstances.\nAll guidance in this section, including any details of rates,\nrefers only to the position in England and Wales on the\ndate of publication of this guide. Please seek specific\nguidance on Scotland and Northern Ireland, where\nrelevant to your project.\nThe 5 W's\n(Mark Pearce - Alkimi)\nWhy should I read this?\nThe UK tax system is constantly being reformed and is still\nvery vague on how tax should apply to digital assets or\n\"crypto\".\nThis section summarises some of the key issues that founders\nwill need to consider when launching a crypto project. The\nfollowing section by Dion Seymour provides more detail on\nthe key topics but readers should bear in mind that there are\ncurrently over 17,000 pages of tax legislation that are\nconstantly being changed and updated so it is vital that\nfounders take advice from a suitable professional.\nFailure to comply with your tax responsibilities can lead to\nvarious sanctions including, at their most extreme, a prison\nsentence. It is each person's responsibility to file their tax\nreturns correctly and ignorance is not considered a defence.\nWho am I?\nThe first question that founders need to ask themselves is the\nnature of the entity that is going to run the project. In the UK\nthere are three main options, a company, a partnership or as\nan individual.\nA company?\nEstablishing a company is the most common option. It is\nrelatively simple and cheap to establish a company in the\nUK. A company is a separate legal entity, which is run by\ndirectors who are subject to various powers retained by\nshareholders (for example shareholders often have the power\nto appoint and remove directors). This can allow founders to\nappoint experts to help run their company but with the\nprotection that they can remove those directors in the future\nif necessary.\nWhile it is possible for people living in the UK to establish\ncompanies in a number of jurisdictions the UK has detailed\nanti-avoidance rules that will often bring profits of foreign\ncompanies established or managed by UK residents within\nthe scope of UK taxation. Founders wishing to establish\ncompanies outside the UK should ensure they take detailed\nadvice both in the UK and the intended county of\nestablishment so they can be confident of understanding all\nthe tax and regulatory requirements that will apply to them.\nFounders of UK crypto companies should also consider with\ntheir accountants whether they can take advantage of various\ntax incentives or rebates such as EIS/SEIS, R&D credits or\nVAT recovery.\nA partnership?\nPartnerships can, themselves, take various forms such as\ngeneral, limited or limited liability partnerships. If a\npartnership is set up outside the UK there are often even\nmore choices available and, again, separate advice will need\nto be sought. Many, but not all, partnerships are taxed\nsimilarly to companies or individuals so this guide will focus\npredominately on these two options.\nAn individual?\nIt is not a legal necessity for an individual to run a project as a\ncompany or in a partnership. If a project is the brain-child of\none person then it is possible for that person to manage the\nproject as an individual or sole-trader. While being a sole-\ntrader might incur the least initial legal and accounting costs\na person acting as a sole-trader could face a number of\ndifficulties quite quickly. The major concern for many\nfounders is the potential liabilities that may apply to\nindividuals that might not necessarily apply to companies. It\nis possible for people acting as sole-traders subsequently to\nincorporate their business but this may incur more costs than\nwere saved by not incorporating initially.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 68\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 35,
    "content": "Where am I?\nThe UK generally levies taxes based on the location (or situs in legal parlance) of both the relevant person and the source of taxable return. For individuals living in the UK they will generally be regarded as UK resident for taxation. The UK has a fairly prescriptive statutory residence test, which allows individuals to calculate whether or not they are UK resident. 28 Individuals born outside the UK should consider their domestic tax regime as well as any relevant double tax treaties. 29 Companies are generally resident where they are incorporated but non-UK resident companies can be taxed in the UK if they are managed from the UK or have a permanent establishment in the UK.\n\nWhere is my crypto?\nAs for the situs of crypto, the UK's default position is that crypto is situated where the person owning the crypto is resident. It is arguable if this is completely accurate, especially when one considers cold wallets and closed networks, but serves as a statement of general principle.30\n\nWhat tax is charged?\nTo determine what tax is charged it is necessary to consider whether a receipt is income or capital gain in nature. There is no definitive test for all scenarios that can exist but as a general rule income is often regular in nature or deriving from a trade while capital gain is often realised on the sale of an asset. Common forms of income include salaries, contractor payments and rewards such as might arise from staking. The sale of an asset or the conversion of one type of an asset to another is more usually capital.\n\nThe distinction between income and capital gain is less relevant for companies as they are subject to corporation tax rather than income or capital gains tax. The distinction is, though, important for certain reliefs and rebates so your accountant should keep accurate records of whether a return is income or capital.\n\nFor individuals, there is a significant difference currently between the tax rates that can apply to income (up to 45% at the time of writing) and capital gains tax (up to 24%). As such, determining whether a return is income or capital can lead to a significant difference in the tax due.\n\nIt is also worth noting that inheritance tax might be charged if you own assets on death, such as direct crypto holdings or shares in a company, or if you make certain lifetime transfers of assets. Inheritance tax is not likely to be relevant to many founders so this guide does not consider this further.\n\nFinally, other, discrete taxes might apply in specific circumstances. For example, if you employ staff or pay yourself a salary then national insurance contributions may fall due. Certain contracts you enter into may be subject to VAT and if you incorporate a business you may be able to reclaim any VAT that you have spent.\n\nWhen is tax charged on my crypto\nIncome tax\nIf you receive a salary, including a bonus, then your income tax is likely to be deducted by the paying company before you receive the income through PAYE. PAYE is often a 'best guess' as to your tax liability and when you come to complete your tax return you may find that there is some more tax to pay or, alternatively, a tax repayment owed to you. However, this is not something you need to calculate until it is necessary to file your tax return. Other forms of income will need to be declared in your tax return.\n\nCapital gains\nCapital gains are also declared in your tax return so it is important to know what is a chargeable disposal for capital gains tax purposes. In essence, the conversion of any asset to another asset is a chargeable disposal that may give rise to a gain or a loss. These gains or losses must be calculated in GBP meaning that you may also need to consider fluctuating exchange rates to ascertain whether a disposal gives rise to a profit or a loss.\n\nHMRC regards all crypto as being a separate asset meaning that changing from one crypto token to another token should be recorded as a disposal. It is the subject of much academic debate but this could even apply whether you go from a token such as ETH to a wrapped version such as WETH. Below is a simplified, illustrative example showing how much detail founders should record, which hopefully highlights the need for accurate book keeping from the outset.\n\nDate\tFrom\tTo\tFrom value\tTo value\tGBP-USD\tTotal Gain\n06.04.24\tGBP\tUSDT\t£10000\t$12,000\t1:1.2\t0\n13.06.24\tUSDT\tETH\t$12,000\t$12,000\t1:1.13\t£620\n22.08.24\tETH\t$Founder\t$18,000\t$18,000\t1:1.25\t£3,780\n07.12.24\t$Founder\t$BTC\t$90,000\t$90,000\t1:1.15\t£63,860\n14.02.25\t$BTC\t$USDT\t$80,000\t$80,000\t1:1.2\t-£11,594\n05.05.25\t$USDT\tGBP\t$80,000\t£72,727\t1:1.1\t£6,061\nTOTAL\n\nThe important point to note here is that even though from a USD perspective there was no gain or loss on the 13 June 2024 transaction, because the GBP:USD exchange rate had changed since 6 April 2024 a taxable gain was still realised.\n\nCorporation tax\nEach company will have its own accounting period after which it will need to file accounts (usually 12 months after the end of an accounting period) and pay tax (usually 9 months after the end of the accounting period).\n\nUK companies may wish to consider aligning their accounting period to the UK tax year (6 April to the following 5 April) but if, for example, the company is heavily US focussed it may wish to align it more to the US tax year (1 January to 31 December).\n\n28 Guidance Note for Statutory Residence Test (SRT) (RDR3), UK Government (22 January 2020)\n29 Tax Treaties, UK Government (28 July 2014)\n30 CRYPTO22600 - Cryptoassets for individuals: Capital Gains Tax: determining the location of exchange tokens, HM Revenue & Customs (21 August 2023)\n\n69 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nPhoto Credit: Joy Tyson (www.unsplash.com)\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 70 advice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 36,
    "content": "Overview of Tax and Accounting for Crypto\nProjects (Dion Seymour - Andersen UK)\n\n1. The UK crypto tax landscape\nThere is no 'crypto tax' law. Cryptoasset transactions are\nnonetheless taxable. Existing tax laws and principles must be\napplied to cryptoassets in the same way as they do to other\nassets.\n\nThere are a number of different taxes that may apply to you\nand your business. The main taxes that you will need to\nconsider are Income Tax (IT), Capital Gains Tax (CGT)\nCorporation Tax (CT) and Value Added Tax (VAT).\n\nIT, CGT and CT are called \"direct taxes\" as the tax is charged\nagainst income, capital gains or profits arising from a\nparticular activity (e.g. employment income, investment gains\nor trading profits). VAT, by comparison is known as an\n\"indirect\" tax because it is charged on \"consumption\" (i.e. on\nthe goods or services being \"consumed\" and not the\nactivity).\n\nHMRC publishes tax guidance (called manuals) to help\ntaxpayers understand what they must do. However, multiple\nmanuals covering different taxes and a targeted cryptoasset\nmanual means that assessing one's tax position can feel like\nsearching for a needle in a haystack. That said, the manuals\nare very helpful in understanding HMRC's opinion on topics,\nalthough it is just HMRC's view, and there may be alternative\npositions.\n\nAn online platform for engaging with HMRC, covering\nregistration to submitting tax returns, is available through the\nGovernment Gateway at Gov.UK. This can be used for all the\nmain taxes, including IT, CGT, CT, and VAT. It is important to\nnote that there are deadlines for registration with HMRC, and\nif these are not met, HMRC may charge penalties.\n\n2. Important dates\nYou are responsible for the completion of and ensuring that\ntax returns are submitted on time and are accurate. The\nsystem is generally referred to as \"self-assessment\" as you\nassess the due tax and report (and pay) that to HMRC. HMRC\noperates a \"process now, check later\" approach to taxation.\n\nThis means that HMRC does not actively check each and\nevery tax return, however, they do undertake compliance\nreviews to ensure that tax returns for individuals and\nbusinesses are complete and accurate.\n\n2.1 Income and capital gains tax\nIT and CGT self assessment (SA) is a way of reporting\nincome/profit/gains and paying tax to HMRC. This is for\nindividuals and also applies to the self-employed or a partner\nin a partnership. Any capital gains from selling cryptoassets\nmust also be included in the SA return. Anyone earning\nincome outside of PAYE or CT must complete an SA tax\nreturn.\n\nThe key dates for SA tax returns are:\n5 October - register for SA for the first time\n31 October - submit paper tax return\n31 January - submit online tax return\n\n2.2 Corporation tax\nTo register as a company, one must also submit an annual\nreturn to Companies House and an annual tax return to\nHMRC. CT self-assessment is relevant for companies, and the\nkey dates for CT Self Assessment are based on the periods in\nthe accounts, also called the accounting period. The\nsubmission date for the CT tax return, called the CT600, is 12\nmonths after the end of the accounting period. There is a\nseparate deadline to pay the CT bill, which is usually 9\nmonths and one day after the end of the accounting period.\n\n2.3 VAT\nYou must register your business if it makes \"Vatable\" supplies\nexceeding £90,000.\n\nIf your business makes supplies that are in the scope of VAT\nand the taxable turnover for the last 12 months goes over\n£90,000 or you expect your taxable turnover to exceed\n£90,000 in the next 30 days, registration must be\ncompleted within 30 days of the end of the month when the\nthreshold was exceeded.\n\n71 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n\nThe effective date of registration is the first day of the second\nmonth after exceeding the threshold.\n\nYou also need to register if the business is based outside the\nUK and supply any goods or services to the UK.\n\nUnlike CT or IT, which are annual returns, VAT periods are\nquarterly, and the VAT return needs to be submitted by the\nend of the following month.\n\nSeveral VAT accounting schemes are available, such as the\nflat rate scheme, which can simplify the calculation of VAT,\nand the Annual Accounting scheme, which requires a VAT\nreturn to only be submitted once a year. There are conditions\napplied to the schemes and these may not be suitable for all\nbusinesses.\n\n3. UK regulated start-ups\nA UK regulated start up is one that has the necessary\nregistrations with the FCA (and other relevant regulatory\nbodies). The UK company is permitted to conduct its\nbusiness and crypto transactions in the UK.\n\n3.1 Trading v. investment\nThe first matter to assess is whether the company is investing\nor trading in crypto.\n\nOften, when cryptoassets are bought and sold, this is\ndescribed as \"trading\". However, the term has a different\nmeaning when it comes to taxes. For direct tax, there is a\ndifference between trading (buying and selling crypto) and\nthe meaning of trading for tax purposes.\n\nFor tax purposes, trading is a \"venture in the nature of trade.\"\nThis is an old phrase from case law that describes, essentially,\na business. That does not mean that trading in crypto is also\na \"venture in the nature of trade.\" This is important as profit\nfrom a business can have different tax implications.\n\nTypically, the buying and selling of crypto will be treated as\nan investment activity. Any profits from transactions are\nknown as chargeable gains and are liable to corporation tax,\nwith losses being offset against the gains.\n\nHowever, where the company is actively trading in\ncryptoassets with a sophisticated level of operation, such as\npersonnel, algorithmic bots etc. and a clear profit motive, it\nmay be treated as a financial trader.\n\nThis is important to note when it comes to loss relief. Whilst\nchargeable gains and trading profits are both taxable to\ncorporation tax (i.e. the same tax rate), there is a difference in\nhow losses are treated for corporation tax. Trading losses can\noffset against both capital gains and other trading profits\narising in the same period, or be carried forward for offset in\nfuture periods. Capital losses can only be offset against\ncapital gains, and where they exceed available gains in a\ngiven period, they are carried forward to offset against future\ncapital gains only.\n\nTransaction fees will be considered within any cryptoasset\ntransactions as these will be treated as an allowable cost\nwhere they are for the acquisition or disposal of an asset for\nthe business.\n\n3.2 Accounting\nCompanies must complete financial statements each year for\nsubmission at Companies House under accounting\nstandards. These are due to be filed with the registrar 9\nmonths following the company's year-end.\n\nUK accounting standards (FRS) consider most cryptoassets to\nbe an \"intangible asset\" which is a \"non-monetary\" asset.\nWhilst many users might consider cryptoasset to be cash or\ninvestments, treatment as an intangible asset creates unique\nissues for accounting purposes that need to be considered.\n\nThis includes the cost basis for including as an asset, tracking\nunrealised and realised gains on the disposal of cryptoassets,\nwhether assets can be revalued (if there is a sufficient active\nmarket and liquidity) and how often revaluations take place.\n\nUnless a business disposes of cryptoassets immediately on\nreceipt, there is likely to be a gain or loss that crystalises on\ndisposal. This, along with the cost basis for intangibles, also\nneeds to be recorded.\n\nIt is therefore important to consider suitable software to track\nonchain movements both for accounting purposes and tax\ncalculations, and matters can escalate in complication\nquickly.\n\nAny goods or services purchased using cryptoassets would\nbe recorded at the value of those assets at the time of\ndisposal. Where these are incurred for business purposes,\nthey are deducted from income in order to calculate the level\nof profits that are subject to corporation tax.\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 72\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 37,
    "content": "To transfer cryptoassets there is typically some form of \"gas\" fees (fees paid to validators of transactions on the blockchain). The gas fees are payable in cryptoassets (usually in the same cryptoasset as the transaction), and this, too, is a disposal (i.e. any gain or loss in the crypto needs to be recognised). However, the gas fee would be a tax-deductible expense for the business.\n\nAside from accounting principles, it is highly recommended that businesses consider the value held in cryptoassets, as well as the liquidity of the business. Where cryptoassets are received from services performed, those cryptoassets are valued for accounting and tax purposes at their market value at the time of receipt. When markets suffer, if the liquidity is held in cryptoassets, the business may be required to make disposals for fiat, which could make it difficult to settle taxes due.\n\n3.3 VAT\n\nTo date, limited guidance has been released from HMRC on the implications of VAT on cryptoassets. However, the CJEU (Court of Justice of the European Union) was one of the first courts to consider the implications of tax on cryptoassets. In the case of C-264/14 Skatteverket v David Hedqvist, the CJEU considered that exchanging Bitcoin for fiat currency (and visa versa) was considered to be an exempt supply on the basis that it was a supply of financial services. It should be noted that only Bitcoin was considered presenting uncertainty if there is no fiat currency involved (i.e. cryptoasset to cryptoasset transactions) the treatment would be the same.\n\nVAT is charged on the supply of goods and services with VAT liability following the activity. Cryptoassets, such as SOL, are neither a good nor a service in their own right. Therefore, a business selling cryptoassets would not add VAT to their sale as they are not a good (i.e. they do not have a physical form). They would, however, add VAT to the charge for providing that service.\n\nFor VAT to apply, there must also be a clear link to the customer and the service being provided. Where a business undertakes mining the activity does not constitute an economic activity as there is not a sufficient link between the service and the consideration (the fees that have been received) for providing that service as there is no clear customer.\n\nA great example of the complexities that can arise when applying existing VAT principles to cryptoasset transactions is the application to NFTs. As NFTs can cover a wide range of uses this means identification of what is being supplied must be considered on a case-by-case basis. Some EU jurisdictions have stated that the supply of a 'jpeg' NFT is a service and, if that is correct, it follows that the treatment would follow the rules of electronically provided services (ESS). For B2C transactions, this would require the seller to register for VAT in their customer's location. Of course, many NFT projects do not know where the seller is located. Some jurisdictions, such as Spain, will treat all sales as to Spanish customers unless evidence can be provided to the contrary. There has been a mixed approach from HMRC in some cases adopting a similar position in Spain and in others (incorrectly) treating the NFT as a security and exempt from VAT!\n\nWhilst NFT jpegs may have had their day, NFTs have multiple use cases not least to represent real world assets (RWAs) or intangible property. This means that not all NFT sales should be considered as providing a service. As VAT follows the liability of the goods or services, selling RWAs that are VATable in the \"real world\" should also be VATable if they are tokenised. There is no clear guidance from HMRC on whether or not this is the case.\n\nFor the UK business, it is important to consider the VAT consequences of their NFTs' attributes at the design stage -as it may be possible to secure more certainty or efficient VAT outcome with some changes. There may well be other indirect taxes, for example, NFTs representing real estate or shares in a UK company owning real estate as Stamp Duty Land Tax (SDLT) or Stamp Duty Reserve Tax (SDRT) may be due.\n\n4. UK unregulated start-ups using offshore regulated entities\n\nThe current UK regulatory landscape means that many web3 start ups are unable to carry on their business in the UK. A common regulatory solution is to set up an offshore entity in a more favourable regulatory environment to undertake the crypto transactions, even if the people running the business are not offshore.\n\nHowever, a common misconception is that if a company is established outside of the UK there can be no tax liability in the UK. This is incorrect. A UK resident individual or company is subject to UK tax on their worldwide income and gains.\n\n4.1 Out of the fire and into the frying pan - 100 years of anti-tax avoidance\n\nWhilst the regulatory solution may be simple, this usually catapults the business and/or its founders into complex tax issues, the types of issues that have been traditionally reserved for large well-funded multinational groups, not bootstrapped start-ups!\n\nThe UK has 100 years of anti-tax avoidance rules and case law that prevent such persons from creating offshore companies in low or no tax jurisdictions, with little or no substance (i.e. no local people functions), and parking profits there with a view to avoiding UK tax.\n\nBroadly, these anti-avoidance rules will deem the income, gains or profits (depending on which set of rules apply) to belong to the UK resident person on an arising basis (i.e. even if not distributed).\n\nThe main anti-avoidance rules to consider include:\n• Transfer of Assets Abroad (ToAA)\n• Profit Fragmentation (PFrag)\n• Controlled foreign companies (CFC)\n• Transfer pricing (TP)\n• Intangible fixed asset (IFA) regime.\n\nWhilst the rationale for offshoring is not tax avoidance, these rules nonetheless apply, and can lead to taxation in the hands of an unintended party or double taxation without relief.\n\nIn addition, care needs to be given to the board composition of the offshore company and its engagement of UK employees or contractors so as to ensure that it is not brought into the UK by virtue of establishing corporate residence or a branch in the UK.\n\n4.2 Common traps and pitfalls\n\nThe anti-avoidance rules and their interaction are complex and turn on the smallest of facts. At their simplest, the most common issues include:\n• The creation of a non-UK company by a UK resident individual will trigger the ToAA rules. These rules will deem the income of the offshore company to belong to that individual and subject to UK income tax (currently up to 45%) on them personally, even if no dividend is distributed.\n• Where a UK company creates a subsidiary in a low or no tax country to undertake its income generating activities it will be a CFC. Its profits will be deemed to belong to its UK parent and subject to UK CT (known as the CFC charge). Costs incurred in the UK parent are not deductible against this allocation. This can lead to double taxation.\n• Where an offshore company has a majority of UK resident directors or only UK resident directors, it will likely be UK tax resident and subject to UK CT.\n• Where an offshore company has offshore directors, but UK resident employees, a UK branch will be created and profits attributable to the UK activities subject to UK CT.\n• Where an offshore company has offshore directors and no UK employees, but has a service agreement (and potentially a licence agreement, depending on where IP is owned), with a UK DevCo, profits will need to be attributed to that DevCo on an arm's length basis either under the TP rules, PFrag rules or IFA regime.\n\n4.3 Special types of offshore entities and DAOS\n\nDecentralised Autonomous Organisations (DAO) have become an increasingly popular community led method of organisation. There has yet to be any published guidance from HMRC as to their view on the tax treatment. The Law Commission considers that DAOs are a novel organisational structure often likened to existing legal forms such as a general partnership or unincorporated association. The tax treatment is, therefore, uncertain. Characteristics may lead to the conclusion that the DAO is a general partnership, in which case profits attributable to its UK members (the partners) would be chargeable to income tax. However, it could be concluded that the DAO is a form of unincorporated association, in which case the activities would fall into scope of corporation tax.\n\nDue to the uncertainty of legal form and, therefore, tax treatment, many projects will set up a special type of offshore entity or structure to establish a legal wrapper and create tax certainty. Typically these offshore legal entities will be \"orphaned\". This is typically a not-for-profit entity in that it cannot distribute its profits to its members and include the Cayman foundation company, the Swiss Association, the Panama foundation, a company limited by guarantee, a purpose trust, amongst others.\n\n73 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 74 advice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 38,
    "content": "In addition to the anti-avoidance rules highlighted above, the\ncreation of such structures can lead to severe inheritance tax\nconsequences for UK based founders, if not structured\ncorrectly. Interestingly, provided structured correctly many if\nnot all the above mentioned anti-avoidance rules may be\nblunted due to the decentralised nature and ambitions of the\nproject.\n\n4.4 200% penalties\n\nWhere HMRC successfully identifies unpaid tax through the\nuse of offshore structures, the penalties, absent formal\nwritten tax advice, will be 200% of the underpaid tax!\n\n5. Paying the founders / team in tokens\n\n5.1 Earnings in crypto\n\nBusinesses can pay their employees in cryptoassets. This is a\ndisposal for the company, and any gain or loss needs to be\naccounted for. Consideration needs to be given to the value\nbeing paid to employees, as the number of tokens that may\nneed to be sent to employees to satisfy their net pay may\nchange between the payroll processing date, and the\npayment date.\n\nIf employees are being paid in stablecoin denominated in a\ndifferent currency (e.g. USDC), the exchange rates also need\nto be considered. In addition, the business must withhold\nPAYE and pay employees' and employers' National Insurance\nContributions (NICs).\n\nUK businesses are also required to operate a workplace\npension for employees. More information on this can be\nobtained from the pensions regulator.\n\nIf a company is paying token incentives to employees, the\ntokens they pay to employees are likely to be taxable and\nwould be processed through the payroll. Under these\ncircumstances, the business will need to retain broadly 50%\nof the cryptoassets they wish to pay the employee and either\nfund the PAYE / employees' NIC out of any fiat currency held\nor convert the cryptoassets into fiat currency.\n\nWhere the company is receiving tokens from a DAO structure\nunder a service agreement, careful planning is required to\nmatch cryptoassets receipts (i.e. service fee income) with\npayments in cryptoasset to employees (i.e. a deductible\nexpense) to minimise exposure to the volatile movements in\nthe valuation of these assets.\n\n5.2 Founder/team token planning\n\nSome projects will seek to launch their own native token. The\ntokenomics will usually provide an allocation to the founders\nand initial start up team. It may be possible for those\nfounders and team to effectively mitigate the IT\nconsequences described above and only be subject to tax,\nCGT, if and when they sell their tokens. This would require\nthe founders/team acquiring their token rights very early on -\nbefore any agreements with third parties have been made\nestablishing a market value - under an agreement such as a\nsimple agreement for future tokens (SAFT), although they\nhave many other names.\n\nProvided no independent value has been created (i.e. no\nSAFTs with third parties have been agreed or executed\nestablishing a price per token), it may be possible to use a\ncost based valuation to determine the price the founders/\nteam should pay for their tokens. This would take all costs to\ndate associated with the token, divided by the expected total\ntoken supply plus an arm's length mark up = a price per\ntoken. The founders / team must pay this for their token\nallocation. A special election needs to be made by the\nemployer to protect the CGT treatment on the sale should\nHMRC successfully challenge the valuation. It is\nrecommended to obtain an independent valuation.\n\nEven though the founders/team acquire their token rights\nunder the SAFT, it is possible to include forfeiture clauses\nwhilst retaining tax benefits described. Such clauses mean\nthat if an employee leaves before all their tokens unlock, any\nunlocked tokens may be forfeited.\n\nA token bonus or incentive scheme requires careful planning.\n\n5.3 Sale of tokens\n\nFor those who have received tokens, the difference in the\ntoken's value at the time of acquisition (receipt) and\nsubsequent disposal will be charged to CGT.\n\nA common misconception is that tax is only due when you\nsell cryptoassets for fiat currency. This is not true. Tax is also\ndue when crypto is exchanged from one crypto to another;\nfor example, an exchange of SOL to BONK would be classed\nas a \"taxable event\". The amount of tax due is calculated in\nreference to what is called either the \"pooling rules\" or\n\"section 104\".\n\nThese rules apply to all cryptoassets and create a \"pool\" for\neach cryptoasset you have. If you have SOL with some\ndifferent accounts or wallets, the rules consider that these are\nall in one, with other cryptoassets also having their own pool.\nTherefore, the holding of SOL and BONK would be\nconsidered separately. The rules create an average cost for\nthe token used to calculate any gains or losses.\n\nThe tax calculation can become more complex as the\nnumber of transactions and different cryptoassets that are\nowned increases. Additional rules, such as the same-day, 30-\nday rules, also apply that add further complexity.\n\nRemember: tax can arise whenever tokens are disposed\nof, whether or not cash is received, such as when one\ncryptoasset is exchanged for another.\n\n6. HMRC enquiries\n\nHMRC has a dedicated crypto team and already receive data\ndumps from exchanges and other cryptoasset service\nproviders. HMRC will then use other means to open an\ninvestigation such as statements on a project's or individual's\nX or discord.\n\nHMRC enquiries can be lengthy and require careful handling.\nIn addition to any unpaid tax, interest and penalties can also\nbe added. Penalties depend on \"customer behaviour\" and\ncan be up to 100% of the underdeclared tax, which can\nincrease to up to 200% where offshore links exist.\n\nIt is well known that crypto can be traced and owners\nidentified. Tax administrations globally are increasing their\nefforts to ensure that the correct tax is paid. Recently, HMRC\nsent \"nudge letters\" to those that they considered had\npotentially undeclared tax liabilities, and the information on\nownership of cryptoassets continues to grow.\n\nThe Crypto Asset Reporting Framework (CARF) is a new\nreporting framework from the OECD that requires\ncryptoasset exchanges to provide details of cryptoasset\ntransactions to tax administrations. CARF is being introduced\ninto approximately 60 jurisdictions around the world.\n\nHMRC has released the draft regulations for CARF, which will\nbe put into force in the UK from 1 January 2026. This will\nprovide HMRC with more information than ever before on\ncryptoasset owners.\n\nCryptoasset exchanges in the scope of CARF, will be required\nto put systems in place to gather the required information on\ntheir customers. This must include gathering self-\ncertifications from all customers and recording all\ntransactions for each cryptoasset for the information to be\naggregated and submitted to HMRC.\n\nACOSTE\n\nTAXI\n\nBridge\nPhoto Credit: Sabrina Mazzeo (www.unsplash.com)\nAX16 OCO\n75 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 76\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 39,
    "content": "77\nTRACING, FREEZING AND\nRECOVERY - WHEN CRYPTO\nASSETS ARE STOLEN\n(Matt Green - Lawrence Stephens and\nMarcin Zarakowski - Token Recovery)\n06\nThe misappropriation of crypto assets is common and often\nversed as an operational risk. Whether:\n(i) via hacking like phishing, ransomware, state sponsored\noperations or data thefts;\n(ii) through social engineering operations like fake\ninvestment platforms or romance scams; or\n(iii) from insider threats like rogue employees, developers\nor even rug pull scams,\nit feels helplessly difficult to recover the funds. Lack of a\ncentralised intermediary to report your loss to, pseudonymity\nand near-instant transactions to anywhere in the world, are\nunfortunately also strong enablers for criminal activity.\nTo be clear, recovery is real, court sanctioned and expected.\nIf assets are gone, time is of the essence. Report this to your\nlawyer and or private blockchain investigation firm\nimmediately, and provide transaction hashes, asset type and\nquantum. Always report the incident to law enforcement as a\nmatter of good practice and obtain a crime reference\nnumber.\nFurthermore, as a Web3 builder or platform operator, you\nplay a pivotal role in addressing stolen crypto assets,\nparticularly if your project becomes a conduit for illicit\nactivity.\nFor centralised platforms that custody crypto assets,\napplicable regulations often require you to collect KYC data\nfrom users and actively detect and prevent misuse. If stolen\nassets are traced to your platform, you must be prepared to\nrespond promptly to legal notices, freeze affected accounts,\nand provide disclosure as mandated by court orders.\nFor decentralised and non-custodial projects, while you\ncannot freeze or seize assets, you can still contribute by\nproviding transparent access to transaction data, educating\nusers about risks, responding to legal notices, and\nimplementing monitoring tools to detect illicit activity.\nProactive cooperation with investigations not only reduces\nlegal risks but also strengthens trust in your platform's\nintegrity.\nCryptoasset Tracing\nThe usual goal of criminals is to as soon as possible convert\nstolen crypto assets to fiat currency and launder the money\noutside of blockchain networks. Off-ramping into fiat can\ntake place only through centralised service providers (e.g.\ncrypto exchanges), which have ability to freeze and seize\nstolen funds. Therefore, your first step should be to identify\nthe movement and location of the assets up until such\ncentralised intermediaries are determined. This can be done\nthanks to the very nature of blockchain technology.\nMost blockchains serve as public, immutable ledgers, making\nthe movement of cryptoassets directly visible onchain. By\nstealing crypto assets and transacting with them further,\ncriminals leave tamper-resistant trail of evidence, which may\nbe used to find them and bring them to justice. In order to do\nthat, it is therefore crucial to combine onchain transaction\ndata with offchain information (like KYC data, or wallet\nownership) to identify the individuals or entities behind\nreceiving or transacting addresses. This can be achieved by\nusing blockchain analytic tools available on the market, which\nnot only visualise transaction flows but also enhance them\nwith offchain data, such as attributing specific addresses to\ncryptocurrency exchanges or other centralised service\nproviders.\nSuch tools are used to trace crypto assets and conduct\nblockchain investigations by law enforcement, private crypto\nrecovery companies but also by crypto asset service\nproviders (e.g. crypto exchanges). The latter use such tools\nalso to regularly monitor processed transactions and assess\nrisks of money laundering and terrorist financing.\nCriminals are well aware of the traceability of their onchain\ntransactions and employ various techniques to obfuscate\ntheir activities and complicate tracing efforts. These methods\ninclude using mixers or tumblers to mask transaction origins,\ntransacting through multiple services-often with accounts\nopened under fake identities or via money mules-and\nleveraging cross-chain bridges to move assets across\nblockchains. While these tactics create additional complexity,\ntracing and overcoming such obstacles is often achievable\nwith the right analytical tools, expertise, and persistence.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 78\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 40,
    "content": "When stolen assets are held in unhosted wallets, there is\ngenerally little that can be done to freeze or seize them, apart\nfrom ongoing monitoring and flagging as stolen in different\ndatabases and networks. This renders such assets \"tainted,\"\nmaking them virtually untouchable for legitimate service\nproviders.\nAn exception to this rule is stablecoins-digital assets\npegged to fiat currency, such as USDT and USDC. Issued\ncentrally by Tether and Circle, respectively, these stablecoins\ninclude functionalities in their underlying smart contracts that\nallow the issuers to blacklist (freeze) wallets and even burn\nand re-mint tokens to another wallet. In such cases, the goal\nof tracing is to gather sufficient evidence to enable law\nenforcement or courts to request stablecoin issuers to\nblacklist the stolen assets and reassign them to their rightful\nowner.\n\nLegal Procedures\nProceeds of Crime Letters and Procedure\nOnce you know the location of the assets and their pathways,\nthe first step is a legal letter, to put the cryptocurrency\nexchange or service provider on notice that they have\nreceived the proceeds of crime, and to detail how they must\ntreat those assets. Failure to comply is likely to be a criminal\noffence in most jurisdictions. This draws a line in the sand,\nand ensures those exchanges are aware of the fraud and\ntheir roles going forward.\nThat letter will include a blockchain analytics report to show\nthe movement and location of funds, including any mixing\nservices if appliable. It will also request balances at the\nrelevant address (or account where funds are pooled31) to\nensure pursuing funds is commercially viable. The letter also\nrequests certain disclosure relating to their customers who\ntook receipt of the funds, and to prevent any withdrawals\nfrom the respective addresses/ accounts. The exchange\nusually seeks a Court Order compelling them to do so.\n\nCourt procedures can broadly be divided into two parallel\nprocesses, Process 1 being a substantive claim, outlining the\nclaim for, amongst other things, deceit and restitutionary\nclaims (making someone whole) against the bad actors and\nProcess 2 being interim reliefs, like injunctions to prevent the\nassets from being dissipated. Process 2 is run to ensure\nProcess 1 is fruitful and to mitigate risks.\n\nIdentifying the Defendants\nThe process starts by relying on \"persons unknown\"\njurisdiction, 32 meaning that categories of currently unknown\ndefendants can be included in proceedings.\nThe first defendant will be a category defined by their\nactions, which may include a person who used a social\nmedia account, hosted a platform, or at least deprived an\naddress of certain assets, being D1. This jurisdiction applies\nwhere you can serve the defendant with legal documents, 33\nin this instance via an NFT34 to the receiving address to which\nthe stolen funds were paid, or otherwise.\nThe second category of defendant is the person/persons\nwho are recipients of the traced funds and are customers of\nthe cryptocurrency exchanges identified in the blockchain\nanalytics report, here called D2. These parties remain\nunknown until the cryptocurrency exchange provides details\nunder Process 2.\nThe other defendants are the relevant cryptocurrency\nexchanges whose customers are D2, and are not alleged to\nhave committed any wrongdoing. They are included to\nensure they provide disclosure of D2 (and D1 if possible) and\nto comply with the freezing of funds. So long as these\nexchanges can take receipt of Court documents, whether by\nemail, NFT to the relevant address or otherwise, they can be\nincluded. Registrations in faraway jurisdictions, or claims of\ndecentralisation do not defeat this process. Similarly,\nexchanges unwilling to provide their corporate structure can\nbe included as another category of persons unknown, being\nthose parties who control, operate, manage and or own that\nexchange. 35 In any event, these exchanges are the vital\ntouchstone of the case, and demask D2.\n31 Piroozzadeh v Persons Unknown and Others [2023] EWHC 1024 (Ch) particularly paragraphs 8 and 26\n32Bloomsbury Publishing Group Ltd v News Group Newspapers Ltd [2003] EWHC 1205 (Ch), see paragraph 21 and and CMOC Sales & Marketing Ltd v\n33Person Unknown & Ors [2018] EWHC 2230 (Comm) (26 July 2018) at paragraph 9\nTippawan Boonyaem v Persons Unknown Category (A) & Ors [2023] EWHC 3180 (Comm) and by comparison Mooij v Persons Unknown (February 2024)\nEWHC 814 (Comm) considering Cameron v Liverpool Victoria Insurance Co Ltd [2019] UKSC 6\n34 Fabrizio D'Aloia v. (1) Persons Unknown (2) Binance Holdings Limited & Others [2022] EWCH 1723 (Ch) (June 24, 2022)\nLMN v Bitflyer Holdings Inc and others [2022] EWHC 2954 (Comm)\nAA v Persons Unknown & Ors, Re Bitcoin [2019] EWHC 3556 (Comm) (13 December 2019)\n79 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For\nadvice specific to your situation, consult a qualified professional.\n\nFreezing Funds and Disclosure\nProcess 1 allows for a claim against the Defendants broadly\nas above. Process 2 includes a Court application made\nwithout notice on D1 and D2, for, amongst other things, (i) the\nspecific treatment of the traced funds as property36 (in equity\nor otherwise), including to demarcate, ringfence and prevent\nthe withdrawal or conversion of those funds (ii) a freeze over\nall of D2's assets worldwide and (iii) identification details of\nD2, including any documents or information used for\nonboarding at the exchange, and any transactions details in a\nspecified period. We are able to rely on disclosure even\nwhere information is fake, where the email address is\ndesigned for a one-time use, or manipulated identification\ndocuments are used.\nOnce the documents are served on D2 (now identifiable\nindividuals), they are entitled to give evidence at a return date\nin Court. Most do not, as they are money mules uninterested\nin giving evidence in formal proceedings. That is the cost of\noperation. At this stage, funds should be frozen at exchanges,\nand Process 2 is largely complete.\n\nRecovering Funds\nProcess 1 continues, and the defendants will have a number\nof days to file a defence in Court. In most instances they fail\nto do so, and the victim can apply for default judgment (the\ndefendants have run out of time) or summary judgment\n(broadly there is no reasonable grounds for defending the\nclaim). This is a win on paper.\nAs to enforcement, 37 the judgment can be used to seek\nrecompense from the exchanges, who have D2's assets\nfrozen. Another Court order will compel the exchanges to\nhand over the funds, and a recovery is made. If the funds\nhave been cashed out, the disclosure should provide for the\nD2's bank details too, and banks can assist.\nThis is a very simple outline of how these processes might\nrun, and things can become more complicated depending\non the fact pattern. However, this process can be quick, cost\neffective and prevents bad actors relying on\npseudonymisation, being located offshore, or appearing to\nnot exist at all.\n35LMN v Bitflyer Holdings Inc and others [2022] EWHC 2954 (Comm)\n\nReceiving Proceeds of Crime and Letters Requesting\nFreezing\nIf you run, operate, manage, control or own a cryptocurrency\nexchange, are a service provider which deals with\ncryptocurrencies, including Web3 projects, and receive the\nproceeds of crime, even unknowingly, you may still be liable\nunder proceeds of crime legislation.\nTransaction monitoring services are extremely useful in\nmitigating risks of processing and custodying the proceeds of\ncrime and should be used as a matter of good practice.\nIn the event you are aware that you are processing,\ncustodying or dealing with the proceeds of crime in any way,\nyou must deal with them carefully. If you receive a letter\nalleging receipt of the proceeds of crime, you must act as if\nyou have done so.\nBroadly you should not allow the assets to be withdrawn,\nconverted or transacted, and inform a member of law\nenforcement without delay, called an authorised disclosure. It\nis vital to check the rules around dealing with the proceeds of\ncrime in your relevant jurisdiction. You must also not tip off\nthe party who has provided those assets.\nIt is best practice to note instances of dealing with proceeds\nof crime without delay.\n36AA v Persons Unknown & Ors, Re Bitcoin [2019] EWHC 3556 (Comm) (13 December 2019)\n37 Joseph Keen Shing Law v Persons Unknown & Huobi Global Limited (unreported, 26 January 2023)\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 80\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 41,
    "content": "81\nYOU'RE OFF\nTOKEN LAUNCH\n(James Burnie and Pavan Kaur - WAGMI\nAdvisers, Gunnercooke)\n07\nTraditionally, token launches have been seen as a global\nphenomenon, the idea being to play a numbers game to\ngenerate as much income from the launch process as\npossible. However, such an approach has become\nincreasingly illegal, with rules and licensing restrictions both\nin terms of the place (i) where tokens are sold from and (ii)\nwhere tokens are sold to.\nFurthermore, in order for a token launch to be truly\nsuccessful, it is vital to look beyond legal considerations and,\nfor example, curate a well-developed and functioning\ncommunity that supports the token.\nLegal: Boring until it isn't!\nA UK token launch: for start-\nups, a thing of the past\nThe act of selling a token from the United Kingdom (UK)\ntriggers a requirement to register with the FCA under the\nMoney Laundering, Terrorist Financing and Transfer of Funds\n(Information on the Payer) Regulations 2017. Currently, there\nare around 50 firms registered with the FCA, against a\nbackdrop of a failure rate of around 90% among those firms\nthat have applied. Whilst, with the right advisors, the process\nfor becoming FCA registered is clear and achievable, it is\ngenerally not an appropriate first step for a start-up to\nbecome registered. Rather, it is more usual to sell into the UK\nfrom an offshore jurisdiction and, whilst a consideration of\noffshore jurisdictions is outside the scope of this guide, it is\nworth noting that tax considerations have an integral role to\nplay in determining what jurisdiction to sell into the UK from.\nSelling into the UK: getting it right matters\nOnce the token issuing entity is set-up, the next question is\nwhat jurisdictions the token can be sold to. In this respect,\ndifferent countries have brought in different regimes in order\nto protect their populations. For example: in the EU, this has\ntaken the form of MICA; in the UK, it takes the form of the\nfinancial promotions regime; and in the USA (whilst the\nposition is currently unclear), it generally takes the form of\ntreating the majority of cryptoasset activity as falling within\nthe existing securities rules. Whilst these are the most well-\nknown regimes, it is worth noting that most new regimes\nranging from Kazakhstan to Botswana to Mauritius\ngenerally have restrictions on selling to their general\npopulation unless local legal and requirements are met.\nTraditionally, a \"who cares?\" approach has been taken to\nthese developments, the assumption being that nothing will\nactually happen if these marketing rules are broken\nhowever, this approach is coming under increasing pressure.\nThere are, of course, the well-publicised moves by the SEC in\nthe USA to take jurisdiction over any cryptoasset enterprises\nthat interact with US persons (that may include persons with\na US passport even if not in the US). In the UK, we are also\nseeing the FCA flex its muscles, as indeed a failure to comply\nwith UK requirements is a criminal offence, punishable by an\nunlimited fine and imprisonment for up to 2 years. The\n\"criminal offence\" element here is particularly important, as it\nmeans that all service providers to a project, such as banking\npartners, are handling the proceeds of crime if cryptoassets\nare sold in breach of the UK financial promotion rules. As\nsuch, the FCA has the ability to simply make a public\nstatement that a project is in breach of the UK rules (called a\nconsumer warning), and the effect will be that many service\nproviders will no longer be prepared to support the project\nfor risk of sanction. Furthermore, in more extreme cases, we\nhave seen the FCA and other regulators co-ordinate to bring\nan end to projects considered particularly harmful.\nIt is worth noting that the FCA is taking a broad interpretation\nregarding what is meant by selling into the UK - and\ngenerally any communication in English needs to be\nconsidered carefully. As such, even if the intention is not to\nsell into the UK, care needs to be taken to ensure that\nappropriate barriers are in place to block communications\nfrom being viewed or accessed by persons in the UK. This\nincludes making sure that, for example, appropriate\ndisclaimers are in place to make it clear that a\ncommunication is not intended for the UK market in all social\nmedia posts.\nSelling into the UK: the thing of the future.\nGiven the evolving landscape, token sales becomes a\nnumbers game from a legal perspective. In this respect,\nwhilst we have seen the UAE often held out as a jurisdiction\nto sell into due to its traditionally relatively lax approach, in\npractice this is limited as the hype of what can be achieved in\nsales simply does not meet the reality. This causes projects to\nlook elsewhere. The EU, which was also previously lax in the\nsense that certain licences were relatively cheap and easy to\nobtain, is now moving into a more aggressive regime under\nMICA, which brings with it added uncertainty.\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 82\nadvice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 42,
    "content": "What is certain is that the EU will become more expensive — however, we note that with the right structuring, it is possible to sell tokens into the EU without requiring a MICA licence, and so well-informed projects will be able to manage costs. Given, therefore, the UK is one of the largest crypto economies globally, and the relative cost of accessing the UK will become relatively cheaper as other jurisdictions become more expensive, it is likely that the UK will increasingly become a vital part of the product road-map for successful projects.\n\nAgainst this background, the UK is likely to become a more attractive jurisdiction to sell into. In this respect, it is worth noting that not all cryptoassets are within the scope of UK financial promotions regime: tokens are not in scope if they are unregulated tokens (on which see below) and either (i) non-fungible or (ii) non-transferable. As such, unregulated NFTs are generally not subject to any restrictions on selling into the UK.\n\nTokens are unregulated where they do not constitute e- money or securities. The definition of e-money is relatively narrow, and so does not cover most of the stablecoins that currently exist, however this may change as a new regime for regulating stablecoins used for payment services is coming into force. The definition of security in the UK is relatively tightly defined, by reference to a specific list of so-called “specified investments”. Most of the time, it will be clear whether a cryptoasset is a “specified investment”, as for example tokenised equity and bonds are clearly security tokens. Where it gets more complex is in relation to cryptoassets where the holding of such gives a right to a variable income, as this may imply that the cryptoasset is a “collective investment scheme” (or in less formal language, a “fund”).\n\nIt is worth noting that when selling into the UK, other than doing so on the basis of relying on one of the limited exemptions, a proper user interface build for UK consumers is required, for example there is a 24 hour cooling off period and an appropriateness assessment that must be complied with, as well as limits on the ability to use certain marketing techniques — for example incentives such as “refer a friend” campaigns are prohibited.\n\nThe universal passport that is the UK legal system\n\nWhilst the complexity of the UK rules should not be underestimated, they do have the advantage of clarity. It is also worth noting that different regulators are taking note of regimes in other jurisdictions, and in this respect, we note that the UK legal and regulatory regime, being one of the first global movers to regulate Web3, is often used as a starting point for other jurisdictions looking to regulate the industry. In this respect, it is notable that UK opinions are often, for example, accepted by non-UK exchanges as giving a solid indication of the likely regulatory treatment of cryptoassets in their jurisdiction, even if not technically on-point.\n\nIt is also worth noting that UK law, being internationally recognised as robust and well-equipped to deal with the Web3 industry, is often the law of choice when contracting, even if none of the parties involved have a UK nexus. As such, the UK is a logical part of the international roadmap for token projects seeking to develop a solid international reputation.\n\nBeyond the Legal: a CMO's Perspective\n\nWhilst we are seeing a rise in the use of security tokens, currently the majority of the liquidity for cryptoassets is in unregulated tokens (i.e. not e-money nor securities), and so generally start-ups are focussed on selling unregulated cryptoassets into the UK. In this respect, there are a range of options available for selling unregulated tokens into the UK depending on budget and the intended reach for the token. These range from using exemptions (which in very broad terms limit participants to e.g. fund managers and companies with assets over GBP 5 million), to listing on a UK exchange that can make promotions on its own behalf (and thereby indirectly promote the cryptoasset), and lastly to obtaining sign off of promotions by firms with the appropriate FCA authorisation to provide such sign off (which are relatively few in number).\n\nWhilst regulation is generally jurisdictional-specific, marketing campaigns are generally global in nature. As such, in this section we take a more jurisdiction agnostic approach.\n\nAll token marketing campaigns worldwide must now consider compliance at every step, though it is not as daunting as it sounds. Incorporating legal disclaimers when seeking to promote your token, alongside aligning communications with your terms of business, will materially support your business’ long-term interests. This is a standard operating procedure across all regulated industries.\n\n83 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\n\nWhile your venture is building its own unique brand identity and community culture, it is important to take a considered approach in order to have a robust model that will withstand future developments. In this respect, it is worth noting that regulators globally are starting to take an interest in how Web3 projects are marketed, and so businesses are beginning to adopt best practices to future-proof their position. In this respect, we have seen firms having to defend historic marketing to regulators when seeking (for example) to obtain licences to operate, and so getting your marketing wrong, even if at an early stage, can cause real damage to the future prospects of a business.\n\n1. Community Management\n\nYour community, although not necessarily mutually exclusive, is divided into two groups: commercial users and token holders (investors). Combined, they form your largest stakeholder group (in terms of numbers of individuals) and should be treated with a level of importance and care that recognises this fact.\n\nContrary to popular belief, community management is different to community growth with one requiring a very different set of skills to the other. Community management is the day-to-day oversight of your Telegram / Discord presence.\n\nEffective community management combines frequent and transparent communication with the implementation of robust moderation and security policies for all team members within this division. Think of it like a well-oiled cog that’s a fundamental part of a larger machine, your business operations.\n\nCommunity management is imperative to treasury management.\n\nAlongside policies, giving your Head of Community, Community Managers, and Ambassadors professional training therefore comes with high recommendation as, beyond the brand championing, they need to be equipped to identify the warning signs of a security breach, and respond effectively to Fear, Uncertainty & Doubt (FUD).\n\nOutsourcing your community management team may be a quick way to ‘get the job done’, though it is generally not recommended in the long term as this approach can impose expensive fixed costs (as opposed to having SAFT agreements with Ambassadors for example), be robotic-like in nature and fail to create authenticity in the brand.\n\nThe question you should ask yourself continually as a founder is, what are we doing to show our existing and prospective token holders that we care about what we are building? So, what approaches should you take to growing your community?\n\n2. Community Growth\n\nAs part of your go-to-market strategy, you will have identified your target audience and competitive landscape, all of which is in alignment with your tokenomics, corporate structure and regulation. By leveraging the below tools with an overarching pragmatic, risk-based approach, you can seek to grow a vibrant community.\n\ni. Influencers\n\nWhile influencer campaigns are arguably one of the most popular ways to grow your community across social media and community channels, engaging with them is not without reputational risk. The FCA has recently cracked down on ‘Finfluencers’, as they are labelled, and regulators globally show no sign of slowing down their efforts to protect the interests of the industry.\n\nFounders can manage this reputational risk through implementing robust performance screening that delves into previous campaign metrics, including how organic their audience is. Day-to-day management of influencers can include implementing various KPIs and creating campaigns that align with your public relations and media outreach strategy.\n\nIn addition, engaging with an experienced lawyer to ensure ‘well written’ contracts are in place, and ‘dos’ and ‘dont’s’ guidance is shared with each influencer is another solid preventative measure founders can take.\n\nAs a general rule, seeking to engage with influencers that are relevant to your vertical and that you genuinely believe are needed for what you are building may be a more sustainable approach that goes a long way with your community. After all, if your largest stakeholder group witnesses the development of a long-term relationship with a well-known name in the industry, sentiment in your project can become increasingly positive.\n\nii. Public Relations & Media Outreach\n\nPress is not a ‘grow a big community quick’ tool. Rather, press is a long-term investment to increase the touch points through which retail can learn about and access your brand.\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 84 advice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 43,
    "content": "While you may seek to purchase sponsored packages directly from Tier 1 outlets to get the word out about a rewards scheme or milestone, gaining earned media is often seen as the more 'sophisticated' approach and a great way of building credibility.\n\nIt is important you work with an external provider that understands the nuances of public relations, has an expansive network of journalists, and has proven readership success.\n\niii. Market-Makers\n\nMarket-makers are essential to ensure that there is a buyer and seller of your token on a centralised exchange, and as such are essential to keeping volatility at bay. As a highly requested service provider, it is well documented that market-makers can manipulate markets and dump tokens on unsuspecting investors.\n\nFounders often find themselves in a precarious position, wanting to rely on these entities to gain traction yet remaining unsure of their intentions. To avoid being left with your tail between your legs, it is important to consider the following:\n\n•\tEngaging with an experienced, independent advisor who can act as a knowledge base on your behalf in conversations with market-makers, for example if presented with complex financial instruments, such as options and loans. A lack of understanding surrounding such topics could lead to long-term financial burdens.\n\n•\tHaving expectation management conversations with market-makers early on can help you in selecting a party that aligns with your interests. For instance, how often are they willing to check in with you and discuss performance? Do they have a live dashboard facility where you can track trading activity? What are their compliance processes? Do they have adequate systems and controls in place that prevent them from market manipulation? Do they come with good recommendations?\n\nTo navigate the complexities of market-making, you must stay vigilant and well-informed. It is crucial to choose reputable partners, carefully review contract terms, and maintain constant communication with the market-maker. By understanding the risks and benefits, you can make informed decisions and protect your project.\n\nShooting for the moon in the beginning stages of listing your token with Tier 1 exchanges is no longer a viable approach to take. Creating a clearly defined listing strategy with your external advisor that honours the value in organic growth may be a more sustainable outlook, and one that prevents the token landing into a crisis, impacting your treasury and reputation.\n\nIt is also worth noting that certain exchanges will enable access to certain jurisdictions, and so this is worth thinking about as part of your go-to-market strategy.\n\niv. Whitepaper\n\nThe whitepaper is the most important promotional material that you will create in your token launch journey. Catered to prospective investors, it should contain detailed information on your commercial strategy, technical implementation strategy and token economy. As its contents are composed of multiple disciplines, it is important to create a refined process to align everyone in your executive team and create a singular tone of voice that resonates with the target audience.\n\nAs well as a mandatory legal disclaimer, adding research that backs up your value proposition, and is correctly cited, will aid in creating a well-rounded document for public consumption.\n\nNaturally, your value proposition may evolve over time, and so it is important that when creating your whitepaper, the wordage recognises this, thus allowing room for both malleability in the business and managing the expectations of investors.\n\nv. FAQ\n\nSupplementing the whitepaper, a robust FAQ of at least 50 questions and answers can be created to strengthen communication around the value proposition and highlight the depth of consideration given to all areas of interest to investors.\n\nThe FAQ should be transparent, informative and easily digestible. As a relatively inexpensive way of creating meaningful content that will take investors through the token launch and beyond ICO, it is a valuable trick to explore.\n\n85 Disclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For advice specific to your situation, consult a qualified professional.\n\nvi. Media Training\n\nFirst time crypto founders may see significant value in undergoing training to learn how to communicate with prospective investors via the media. This applies to any appearance, ranging from a YouTube collaboration with an influencer to a public speech at a high-profile event.\n\nIf you understand the habits of the demographic group which you are purporting to communicate with and are prepared on how to answer the 'harder' questions from retail, you can create a clear narrative with an aim to 'convert' listeners into active participants of your ecosystem, whether that be as an\n\nIf you understand the habits of the demographic group which you are purporting to communicate with and are prepared on how to answer the 'harder' questions from retail, you can create a clear narrative with an aim to 'convert' listeners into active participants of your ecosystem, whether that be as an investor, commercial user or follower.\n\nPhoto Credit: Sora Shimazaki (www.pexels.com)\n\nLet's face the Music and Dance\n\nGiven the complex multi-faced nature of marketing, it is easy to spend a lot and achieve little. Or even worse, land yourself in regulatory hot water. As such, it is important to ensure that GTM is fully thought through well in advance of a token launch. Because whilst dancing to a bull market is fun, there may be trouble ahead...\n\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 86 advice specific to your situation, consult a qualified professional.\n"
  },
  {
    "page": 44,
    "content": "87\nTHE IMPORTANCE OF\nCOMMUNITY AND WEB3\nACCELERATORS\n(Cap - Superteam UK)\n08\nThroughout this guide, we have provided snapshots of the\nmany areas where projects need to cut their way through\nthe tangled forests of legal and regulatory factors in order to\nget to a successful launch, break new ground, innovate and\ncreate.\nIn some areas of this guide, there might be simple do's and\ndon'ts. In other areas, it is more a question of being\ncompetent in spotting areas, such as data protection, AML\nand financial promotions, where thorny issues could entrap\nyour project. Being literate in the main principles and\nconcepts that underpin each area will allow you to separate\nout the key questions and communicate most effectively\nwith advisors. Increasingly, technical ability in successfully\nmanaging legal and compliance factors will be an essential\nskill for projects. Projects that deal well, not just with tech,\nbut also with compliance and regulatory strategy, will also\nbenefit from a further moat and competitive advantage. The\nfact that this area has some level of entry complexity is not\njust to be seen as a hurdle to jump over, but also protection\nthat once you have made this investment of time and\nenergy, it will be far harder for competitors to keep up.\nIn this regard, as projects are starting out but also as they\ngrow, there is huge strength in being part of a powerful\ncommunity. As the landscape continues to develop and\nmature, surrounding yourself with likeminded innovators\nwho are finding creative ways to overcome sectoral\nchallenges can be a huge source of support. The Web3\nethos has always been concentrated around the ideals of\nthe open-source community ethos - if there is a challenge,\nthere is nothing that we can't build to overcome it. Some of\nthe best multidisciplinary minds in the world find themselves\nin Web3, in no small part due to the everchanging\ncomplexity and challenge of every aspect of this industry.\nWhatever key principles exist, whatever market norms or\ntraditional ways of doing things, they can be questioned,\nreimagined and redesigned.\nBeing around like-minded innovators to share a space,\ncollaborate and learn is an exciting part of your journey. The\nSuperteam UK member group provides this environment,\nallowing you to access an everyday opportunity to\ncollaborate with peers at the cutting edge of the digital\neconomy.\nSo whether you are planning a GTM or at a more advanced\nstage of your project, but still aiming to stay well clear of any\nhot water, an important first step is to connect with your\nlocal Superteam UK community to access support,\nresources, and guidance.\nSuperteam accelerators and community will be both the\ncatalyst and the safety net that helps you achieve your vision\nand ambitions in this exciting and dynamic new industry.\nperteam\nUK\nDisclaimer: This guide provides general information and without limitation is not legal, tax, strategic or financial advice. Please do your own further research. For 88\nadvice specific to your situation, consult a qualified professional.\n"
  }
]